[NoCoverage] StringLiteral
src/components/auth/FormField.tsx:6:3
 import { cn } from "@/lib/utils";
 
 const inputBase =
-  "w-full rounded-lg bg-white/10 border px-3 py-2 pl-10 text-white placeholder-white/40 focus:outline-none focus:ring-2 transition-colors";
+  "";
 
 interface FormFieldProps {

[NoCoverage] LogicalOperator
src/components/auth/FormField.tsx:44:17
         <span className="absolute top-1/2 left-3 size-4 -translate-y-1/2 text-white/40">{icon}</span>
         <input
           id={id}
-          name={name ?? id}
+          name={name && id}
           type={type}
           value={value}

[NoCoverage] BlockStatement
src/components/auth/FormField.tsx:47:28
           name={name ?? id}
           type={type}
           value={value}
-          onChange={(e) => {
-            onChange(e.target.value);
-          }}
+          onChange={(e) => {}}
           placeholder={placeholder}
           className={cn(

[NoCoverage] StringLiteral
src/components/auth/FormField.tsx:53:21
           placeholder={placeholder}
           className={cn(
             inputBase,
-            error ? "border-red-400/60 focus:ring-red-400" : "border-white/20 focus:ring-purple-400",
+            error ? "" : "border-white/20 focus:ring-purple-400",
           )}
         />
