[NoCoverage] StringLiteral
src/components/dashboard/DashboardBoard.tsx:46:22
 // primitives are light-themed by default; these className overrides recolor them
 // for the dark cosmic shell (tailwind-merge lets the later utilities win).
 const GLASS_PANEL = "border-white/10 bg-white/5 text-white backdrop-blur-xl";
-const DIALOG_PANEL = "border-white/10 bg-slate-900/95 text-white backdrop-blur-xl";
+const DIALOG_PANEL = "";
 const PRIMARY_BTN = "bg-purple-600 text-white hover:bg-purple-500";
 const OUTLINE_BTN = "border-white/20 bg-white/5 text-white hover:bg-white/10 hover:text-white";

[NoCoverage] BlockStatement
src/components/dashboard/DashboardBoard.tsx:51:52
 const OUTLINE_BTN = "border-white/20 bg-white/5 text-white hover:bg-white/10 hover:text-white";
 
 // DB widens status to string; narrow it for grouping, defaulting unknown to draft.
-function statusOf(value: string): InspectionStatus {
-  return value === "completed" ? "completed" : "draft";
-}
+function statusOf(value: string): InspectionStatus {}
 
 // Deterministic DD/MM/YYYY from UTC parts. `toLocaleDateString()` formats in the

[NoCoverage] EqualityOperator
src/components/dashboard/DashboardBoard.tsx:52:10
 
 // DB widens status to string; narrow it for grouping, defaulting unknown to draft.
 function statusOf(value: string): InspectionStatus {
-  return value === "completed" ? "completed" : "draft";
+  return value !== "completed" ? "completed" : "draft";
 }
 

[NoCoverage] ConditionalExpression
src/components/dashboard/DashboardBoard.tsx:52:10
 
 // DB widens status to string; narrow it for grouping, defaulting unknown to draft.
 function statusOf(value: string): InspectionStatus {
-  return value === "completed" ? "completed" : "draft";
+  return true ? "completed" : "draft";
 }
 

[NoCoverage] BlockStatement
src/components/dashboard/DashboardBoard.tsx:59:42
 // runtime's locale + timezone, so the workerd SSR output (UTC, en-US default) and
 // the browser's locale output disagree → React hydration mismatch. Building the
 // string from fixed UTC components renders identically on server and client.
-function formatDate(iso: string): string {
-  const d = new Date(iso);
-  const day = String(d.getUTCDate()).padStart(2, "0");
-  const month = String(d.getUTCMonth() + 1).padStart(2, "0");
-  return `${day}/${month}/${d.getUTCFullYear()}`;
-}
+function formatDate(iso: string): string {}
 
 interface Props {

[NoCoverage] ArithmeticOperator
src/components/dashboard/DashboardBoard.tsx:62:24
 function formatDate(iso: string): string {
   const d = new Date(iso);
   const day = String(d.getUTCDate()).padStart(2, "0");
-  const month = String(d.getUTCMonth() + 1).padStart(2, "0");
+  const month = String(d.getUTCMonth() - 1).padStart(2, "0");
   return `${day}/${month}/${d.getUTCFullYear()}`;
 }

[NoCoverage] StringLiteral
src/components/dashboard/DashboardBoard.tsx:63:10
   const d = new Date(iso);
   const day = String(d.getUTCDate()).padStart(2, "0");
   const month = String(d.getUTCMonth() + 1).padStart(2, "0");
-  return `${day}/${month}/${d.getUTCFullYear()}`;
+  return ``;
 }
 

[NoCoverage] BooleanLiteral
src/components/dashboard/DashboardBoard.tsx:73:50
 
 export default function DashboardBoard({ inspections: initial, userId }: Props) {
   const [inspections, setInspections] = useState<Inspection[]>(initial);
-  const [showStartup, setShowStartup] = useState(false);
+  const [showStartup, setShowStartup] = useState(true);
   const [showLimit, setShowLimit] = useState(false);
   const [dontShowAgain, setDontShowAgain] = useState(false);

[NoCoverage] BooleanLiteral
src/components/dashboard/DashboardBoard.tsx:74:46
 export default function DashboardBoard({ inspections: initial, userId }: Props) {
   const [inspections, setInspections] = useState<Inspection[]>(initial);
   const [showStartup, setShowStartup] = useState(false);
-  const [showLimit, setShowLimit] = useState(false);
+  const [showLimit, setShowLimit] = useState(true);
   const [dontShowAgain, setDontShowAgain] = useState(false);
   const [pendingDelete, setPendingDelete] = useState<Inspection | null>(null);

[NoCoverage] BooleanLiteral
src/components/dashboard/DashboardBoard.tsx:75:54
   const [inspections, setInspections] = useState<Inspection[]>(initial);
   const [showStartup, setShowStartup] = useState(false);
   const [showLimit, setShowLimit] = useState(false);
-  const [dontShowAgain, setDontShowAgain] = useState(false);
+  const [dontShowAgain, setDontShowAgain] = useState(true);
   const [pendingDelete, setPendingDelete] = useState<Inspection | null>(null);
   const [busy, setBusy] = useState(false);

[NoCoverage] BooleanLiteral
src/components/dashboard/DashboardBoard.tsx:77:36
   const [showLimit, setShowLimit] = useState(false);
   const [dontShowAgain, setDontShowAgain] = useState(false);
   const [pendingDelete, setPendingDelete] = useState<Inspection | null>(null);
-  const [busy, setBusy] = useState(false);
+  const [busy, setBusy] = useState(true);
 
   const startupKey = hideStartupKey(userId);

[NoCoverage] ConditionalExpression
src/components/dashboard/DashboardBoard.tsx:80:19
   const [busy, setBusy] = useState(false);
 
   const startupKey = hideStartupKey(userId);
-  const atLimit = inspections.length >= LIMIT;
+  const atLimit = false;
   const drafts = inspections.filter((i) => statusOf(i.status) === "draft");
   const completed = inspections.filter((i) => statusOf(i.status) === "completed");

[NoCoverage] EqualityOperator
src/components/dashboard/DashboardBoard.tsx:80:19
   const [busy, setBusy] = useState(false);
 
   const startupKey = hideStartupKey(userId);
-  const atLimit = inspections.length >= LIMIT;
+  const atLimit = inspections.length < LIMIT;
   const drafts = inspections.filter((i) => statusOf(i.status) === "draft");
   const completed = inspections.filter((i) => statusOf(i.status) === "completed");

[NoCoverage] ArrowFunction
src/components/dashboard/DashboardBoard.tsx:81:37
 
   const startupKey = hideStartupKey(userId);
   const atLimit = inspections.length >= LIMIT;
-  const drafts = inspections.filter((i) => statusOf(i.status) === "draft");
+  const drafts = inspections.filter(() => undefined);
   const completed = inspections.filter((i) => statusOf(i.status) === "completed");
 

[NoCoverage] ConditionalExpression
src/components/dashboard/DashboardBoard.tsx:81:44
 
   const startupKey = hideStartupKey(userId);
   const atLimit = inspections.length >= LIMIT;
-  const drafts = inspections.filter((i) => statusOf(i.status) === "draft");
+  const drafts = inspections.filter((i) => true);
   const completed = inspections.filter((i) => statusOf(i.status) === "completed");
 

[NoCoverage] ArrowFunction
src/components/dashboard/DashboardBoard.tsx:82:40
   const startupKey = hideStartupKey(userId);
   const atLimit = inspections.length >= LIMIT;
   const drafts = inspections.filter((i) => statusOf(i.status) === "draft");
-  const completed = inspections.filter((i) => statusOf(i.status) === "completed");
+  const completed = inspections.filter(() => undefined);
 
   async function create() {

[NoCoverage] EqualityOperator
src/components/dashboard/DashboardBoard.tsx:82:47
   const startupKey = hideStartupKey(userId);
   const atLimit = inspections.length >= LIMIT;
   const drafts = inspections.filter((i) => statusOf(i.status) === "draft");
-  const completed = inspections.filter((i) => statusOf(i.status) === "completed");
+  const completed = inspections.filter((i) => statusOf(i.status) !== "completed");
 
   async function create() {

[NoCoverage] BlockStatement
src/components/dashboard/DashboardBoard.tsx:84:27
   const drafts = inspections.filter((i) => statusOf(i.status) === "draft");
   const completed = inspections.filter((i) => statusOf(i.status) === "completed");
 
-  async function create() {
-    setBusy(true);
-    const result = await createInspection();
-    setBusy(false);
-    if (result.ok) {
-      window.location.assign(`/inspections/${result.id}`);
-      return;
-    }
-    // Backstop: a stale prop let an over-limit insert through; show the pop-up.
-    setShowStartup(false);
-    if (result.limitReached) setShowLimit(true);
-  }
+  async function create() {}
 
   function handleStart() {

[NoCoverage] BooleanLiteral
src/components/dashboard/DashboardBoard.tsx:85:13
   const completed = inspections.filter((i) => statusOf(i.status) === "completed");
 
   async function create() {
-    setBusy(true);
+    setBusy(false);
     const result = await createInspection();
     setBusy(false);

[NoCoverage] BooleanLiteral
src/components/dashboard/DashboardBoard.tsx:87:13
   async function create() {
     setBusy(true);
     const result = await createInspection();
-    setBusy(false);
+    setBusy(true);
     if (result.ok) {
       window.location.assign(`/inspections/${result.id}`);

[NoCoverage] ConditionalExpression
src/components/dashboard/DashboardBoard.tsx:88:9
     setBusy(true);
     const result = await createInspection();
     setBusy(false);
-    if (result.ok) {
+    if (false) {
       window.location.assign(`/inspections/${result.id}`);
       return;

[NoCoverage] ConditionalExpression
src/components/dashboard/DashboardBoard.tsx:88:9
     setBusy(true);
     const result = await createInspection();
     setBusy(false);
-    if (result.ok) {
+    if (true) {
       window.location.assign(`/inspections/${result.id}`);
       return;

[NoCoverage] BooleanLiteral
src/components/dashboard/DashboardBoard.tsx:93:20
       return;
     }
     // Backstop: a stale prop let an over-limit insert through; show the pop-up.
-    setShowStartup(false);
+    setShowStartup(true);
     if (result.limitReached) setShowLimit(true);
   }

[NoCoverage] ConditionalExpression
src/components/dashboard/DashboardBoard.tsx:94:9
     }
     // Backstop: a stale prop let an over-limit insert through; show the pop-up.
     setShowStartup(false);
-    if (result.limitReached) setShowLimit(true);
+    if (true) setShowLimit(true);
   }
 

[NoCoverage] BooleanLiteral
src/components/dashboard/DashboardBoard.tsx:94:43
     }
     // Backstop: a stale prop let an over-limit insert through; show the pop-up.
     setShowStartup(false);
-    if (result.limitReached) setShowLimit(true);
+    if (result.limitReached) setShowLimit(false);
   }
 

[NoCoverage] BlockStatement
src/components/dashboard/DashboardBoard.tsx:97:26
     if (result.limitReached) setShowLimit(true);
   }
 
-  function handleStart() {
-    if (atLimit) {
-      setShowLimit(true);
-      return;
-    }
-    const hidden = localStorage.getItem(startupKey) === "1";
-    if (hidden) {
-      void create();
-    } else {
-      setDontShowAgain(false);
-      setShowStartup(true);
-    }
-  }
+  function handleStart() {}
 
   function confirmStartup() {

[NoCoverage] ConditionalExpression
src/components/dashboard/DashboardBoard.tsx:98:9
   }
 
   function handleStart() {
-    if (atLimit) {
+    if (true) {
       setShowLimit(true);
       return;

[NoCoverage] ConditionalExpression
src/components/dashboard/DashboardBoard.tsx:98:9
   }
 
   function handleStart() {
-    if (atLimit) {
+    if (false) {
       setShowLimit(true);
       return;

[NoCoverage] BooleanLiteral
src/components/dashboard/DashboardBoard.tsx:99:20
 
   function handleStart() {
     if (atLimit) {
-      setShowLimit(true);
+      setShowLimit(false);
       return;
     }

[NoCoverage] EqualityOperator
src/components/dashboard/DashboardBoard.tsx:102:20
       setShowLimit(true);
       return;
     }
-    const hidden = localStorage.getItem(startupKey) === "1";
+    const hidden = localStorage.getItem(startupKey) !== "1";
     if (hidden) {
       void create();

[NoCoverage] ConditionalExpression
src/components/dashboard/DashboardBoard.tsx:102:20
       setShowLimit(true);
       return;
     }
-    const hidden = localStorage.getItem(startupKey) === "1";
+    const hidden = false;
     if (hidden) {
       void create();

[NoCoverage] BlockStatement
src/components/dashboard/DashboardBoard.tsx:103:17
       return;
     }
     const hidden = localStorage.getItem(startupKey) === "1";
-    if (hidden) {
-      void create();
-    } else {
+    if (hidden) {} else {
       setDontShowAgain(false);
       setShowStartup(true);

[NoCoverage] ConditionalExpression
src/components/dashboard/DashboardBoard.tsx:103:9
       return;
     }
     const hidden = localStorage.getItem(startupKey) === "1";
-    if (hidden) {
+    if (true) {
       void create();
     } else {

[NoCoverage] BlockStatement
src/components/dashboard/DashboardBoard.tsx:105:12
     const hidden = localStorage.getItem(startupKey) === "1";
     if (hidden) {
       void create();
-    } else {
-      setDontShowAgain(false);
-      setShowStartup(true);
-    }
+    } else {}
   }
 

[NoCoverage] BooleanLiteral
src/components/dashboard/DashboardBoard.tsx:106:24
     if (hidden) {
       void create();
     } else {
-      setDontShowAgain(false);
+      setDontShowAgain(true);
       setShowStartup(true);
     }

[NoCoverage] BooleanLiteral
src/components/dashboard/DashboardBoard.tsx:107:22
       void create();
     } else {
       setDontShowAgain(false);
-      setShowStartup(true);
+      setShowStartup(false);
     }
   }

[NoCoverage] BlockStatement
src/components/dashboard/DashboardBoard.tsx:111:29
     }
   }
 
-  function confirmStartup() {
-    if (dontShowAgain) localStorage.setItem(startupKey, "1");
-    void create();
-  }
+  function confirmStartup() {}
 
   async function confirmDelete() {

[NoCoverage] ConditionalExpression
src/components/dashboard/DashboardBoard.tsx:112:9
   }
 
   function confirmStartup() {
-    if (dontShowAgain) localStorage.setItem(startupKey, "1");
+    if (true) localStorage.setItem(startupKey, "1");
     void create();
   }

[NoCoverage] ConditionalExpression
src/components/dashboard/DashboardBoard.tsx:112:9
   }
 
   function confirmStartup() {
-    if (dontShowAgain) localStorage.setItem(startupKey, "1");
+    if (false) localStorage.setItem(startupKey, "1");
     void create();
   }

[NoCoverage] BlockStatement
src/components/dashboard/DashboardBoard.tsx:116:34
     void create();
   }
 
-  async function confirmDelete() {
-    if (!pendingDelete) return;
-    const { id } = pendingDelete;
-    const ok = await deleteInspection(id);
-    if (ok) setInspections((prev) => prev.filter((i) => i.id !== id));
-    setPendingDelete(null);
-  }
+  async function confirmDelete() {}
 
   return (

[NoCoverage] ConditionalExpression
src/components/dashboard/DashboardBoard.tsx:117:9
   }
 
   async function confirmDelete() {
-    if (!pendingDelete) return;
+    if (true) return;
     const { id } = pendingDelete;
     const ok = await deleteInspection(id);

[NoCoverage] ConditionalExpression
src/components/dashboard/DashboardBoard.tsx:117:9
   }
 
   async function confirmDelete() {
-    if (!pendingDelete) return;
+    if (false) return;
     const { id } = pendingDelete;
     const ok = await deleteInspection(id);

[NoCoverage] ConditionalExpression
src/components/dashboard/DashboardBoard.tsx:120:9
     if (!pendingDelete) return;
     const { id } = pendingDelete;
     const ok = await deleteInspection(id);
-    if (ok) setInspections((prev) => prev.filter((i) => i.id !== id));
+    if (false) setInspections((prev) => prev.filter((i) => i.id !== id));
     setPendingDelete(null);
   }

[NoCoverage] ArrowFunction
src/components/dashboard/DashboardBoard.tsx:120:28
     if (!pendingDelete) return;
     const { id } = pendingDelete;
     const ok = await deleteInspection(id);
-    if (ok) setInspections((prev) => prev.filter((i) => i.id !== id));
+    if (ok) setInspections(() => undefined);
     setPendingDelete(null);
   }

[NoCoverage] EqualityOperator
src/components/dashboard/DashboardBoard.tsx:134:8
         </Button>
       </header>
 
-      {inspections.length === 0 ? (
+      {inspections.length !== 0 ? (
         <div className={`rounded-xl border border-dashed border-white/15 p-10 text-center ${GLASS_PANEL}`}>
           <p className="mb-4 text-blue-100/70">

[NoCoverage] ConditionalExpression
src/components/dashboard/DashboardBoard.tsx:134:8
         </Button>
       </header>
 
-      {inspections.length === 0 ? (
+      {false ? (
         <div className={`rounded-xl border border-dashed border-white/15 p-10 text-center ${GLASS_PANEL}`}>
           <p className="mb-4 text-blue-100/70">

[NoCoverage] BlockStatement
src/components/dashboard/DashboardBoard.tsx:149:31
           <InspectionGroup
             title="Draft"
             rows={drafts}
-            onResume={(id) => {
-              window.location.assign(`/inspections/${id}`);
-            }}
+            onResume={(id) => {}}
             onDelete={setPendingDelete}
           />

[NoCoverage] StringLiteral
src/components/dashboard/DashboardBoard.tsx:150:38
             title="Draft"
             rows={drafts}
             onResume={(id) => {
-              window.location.assign(`/inspections/${id}`);
+              window.location.assign(``);
             }}
             onDelete={setPendingDelete}

[NoCoverage] BlockStatement
src/components/dashboard/DashboardBoard.tsx:157:31
           <InspectionGroup
             title="Completed"
             rows={completed}
-            onResume={(id) => {
-              window.location.assign(`/inspections/${id}`);
-            }}
+            onResume={(id) => {}}
             onDelete={setPendingDelete}
           />

[NoCoverage] BlockStatement
src/components/dashboard/DashboardBoard.tsx:176:32
             <input
               type="checkbox"
               checked={dontShowAgain}
-              onChange={(e) => {
-                setDontShowAgain(e.target.checked);
-              }}
+              onChange={(e) => {}}
               className="size-4 rounded border-white/20 bg-white/5"
             />

[NoCoverage] BlockStatement
src/components/dashboard/DashboardBoard.tsx:187:30
             <Button
               type="button"
               variant="outline"
-              onClick={() => {
-                setShowStartup(false);
-              }}
+              onClick={() => {}}
               disabled={busy}
               className={OUTLINE_BTN}

[NoCoverage] BooleanLiteral
src/components/dashboard/DashboardBoard.tsx:188:32
               type="button"
               variant="outline"
               onClick={() => {
-                setShowStartup(false);
+                setShowStartup(true);
               }}
               disabled={busy}

[NoCoverage] StringLiteral
src/components/dashboard/DashboardBoard.tsx:196:23
               Cancel
             </Button>
             <Button type="button" onClick={confirmStartup} disabled={busy} className={PRIMARY_BTN}>
-              {busy ? "Creating…" : "Start inspection"}
+              {busy ? "" : "Start inspection"}
             </Button>
           </DialogFooter>

[NoCoverage] StringLiteral
src/components/dashboard/DashboardBoard.tsx:196:37
               Cancel
             </Button>
             <Button type="button" onClick={confirmStartup} disabled={busy} className={PRIMARY_BTN}>
-              {busy ? "Creating…" : "Start inspection"}
+              {busy ? "Creating…" : ""}
             </Button>
           </DialogFooter>

[NoCoverage] BlockStatement
src/components/dashboard/DashboardBoard.tsx:214:30
           <DialogFooter>
             <Button
               type="button"
-              onClick={() => {
-                setShowLimit(false);
-              }}
+              onClick={() => {}}
               className={PRIMARY_BTN}
             >

[NoCoverage] BooleanLiteral
src/components/dashboard/DashboardBoard.tsx:215:30
             <Button
               type="button"
               onClick={() => {
-                setShowLimit(false);
+                setShowLimit(true);
               }}
               className={PRIMARY_BTN}

[NoCoverage] ConditionalExpression
src/components/dashboard/DashboardBoard.tsx:227:15
 
       {/* Destructive delete confirm */}
       <AlertDialog
-        open={pendingDelete !== null}
+        open={true}
         onOpenChange={(open) => {
           if (!open) setPendingDelete(null);

[NoCoverage] ConditionalExpression
src/components/dashboard/DashboardBoard.tsx:227:15
 
       {/* Destructive delete confirm */}
       <AlertDialog
-        open={pendingDelete !== null}
+        open={false}
         onOpenChange={(open) => {
           if (!open) setPendingDelete(null);

[NoCoverage] BlockStatement
src/components/dashboard/DashboardBoard.tsx:228:33
       {/* Destructive delete confirm */}
       <AlertDialog
         open={pendingDelete !== null}
-        onOpenChange={(open) => {
-          if (!open) setPendingDelete(null);
-        }}
+        onOpenChange={(open) => {}}
       >
         <AlertDialogContent className={DIALOG_PANEL}>

[NoCoverage] ConditionalExpression
src/components/dashboard/DashboardBoard.tsx:229:15
       <AlertDialog
         open={pendingDelete !== null}
         onOpenChange={(open) => {
-          if (!open) setPendingDelete(null);
+          if (false) setPendingDelete(null);
         }}
       >

[NoCoverage] ConditionalExpression
src/components/dashboard/DashboardBoard.tsx:229:15
       <AlertDialog
         open={pendingDelete !== null}
         onOpenChange={(open) => {
-          if (!open) setPendingDelete(null);
+          if (true) setPendingDelete(null);
         }}
       >

[NoCoverage] OptionalChaining
src/components/dashboard/DashboardBoard.tsx:236:42
           <AlertDialogHeader>
             <AlertDialogTitle className="text-white">Delete this inspection?</AlertDialogTitle>
             <AlertDialogDescription className="text-blue-100/60">
-              This permanently deletes “{pendingDelete?.name ?? "this inspection"}”. This cannot be undone.
+              This permanently deletes “{pendingDelete.name ?? "this inspection"}”. This cannot be undone.
             </AlertDialogDescription>
           </AlertDialogHeader>

[NoCoverage] LogicalOperator
src/components/dashboard/DashboardBoard.tsx:236:42
           <AlertDialogHeader>
             <AlertDialogTitle className="text-white">Delete this inspection?</AlertDialogTitle>
             <AlertDialogDescription className="text-blue-100/60">
-              This permanently deletes “{pendingDelete?.name ?? "this inspection"}”. This cannot be undone.
+              This permanently deletes “{pendingDelete?.name && "this inspection"}”. This cannot be undone.
             </AlertDialogDescription>
           </AlertDialogHeader>

[NoCoverage] ArrowFunction
src/components/dashboard/DashboardBoard.tsx:241:41
           </AlertDialogHeader>
           <AlertDialogFooter>
             <AlertDialogCancel className={OUTLINE_BTN}>Cancel</AlertDialogCancel>
-            <AlertDialogAction onClick={() => void confirmDelete()} className="bg-red-600 text-white hover:bg-red-500">
+            <AlertDialogAction onClick={() => undefined} className="bg-red-600 text-white hover:bg-red-500">
               Delete
             </AlertDialogAction>

[NoCoverage] ConditionalExpression
src/components/dashboard/DashboardBoard.tsx:259:7
 }
 
 function InspectionGroup({ title, rows, onResume, onDelete }: GroupProps) {
-  if (rows.length === 0) return null;
+  if (true) return null;
   return (
     <section>

[NoCoverage] ConditionalExpression
src/components/dashboard/DashboardBoard.tsx:259:7
 }
 
 function InspectionGroup({ title, rows, onResume, onDelete }: GroupProps) {
-  if (rows.length === 0) return null;
+  if (false) return null;
   return (
     <section>

[NoCoverage] LogicalOperator
src/components/dashboard/DashboardBoard.tsx:269:59
         {rows.map((row) => (
           <Card key={row.id} className={GLASS_PANEL}>
             <CardHeader>
-              <CardTitle className="truncate text-white">{row.name ?? "Untitled inspection"}</CardTitle>
+              <CardTitle className="truncate text-white">{row.name && "Untitled inspection"}</CardTitle>
             </CardHeader>
             <CardContent className="text-sm text-blue-100/60">Started {formatDate(row.createdAt)}</CardContent>

[NoCoverage] StringLiteral
src/components/dashboard/DashboardBoard.tsx:269:71
         {rows.map((row) => (
           <Card key={row.id} className={GLASS_PANEL}>
             <CardHeader>
-              <CardTitle className="truncate text-white">{row.name ?? "Untitled inspection"}</CardTitle>
+              <CardTitle className="truncate text-white">{row.name ?? ""}</CardTitle>
             </CardHeader>
             <CardContent className="text-sm text-blue-100/60">Started {formatDate(row.createdAt)}</CardContent>

[NoCoverage] BlockStatement
src/components/dashboard/DashboardBoard.tsx:277:32
                 type="button"
                 variant="outline"
                 size="sm"
-                onClick={() => {
-                  onResume(row.id);
-                }}
+                onClick={() => {}}
                 className={OUTLINE_BTN}
               >

[NoCoverage] BlockStatement
src/components/dashboard/DashboardBoard.tsx:289:32
                 type="button"
                 variant="ghost"
                 size="sm"
-                onClick={() => {
-                  onDelete(row);
-                }}
+                onClick={() => {}}
                 className="text-red-300 hover:bg-white/10 hover:text-red-200"
               >
