[NoCoverage] BlockStatement
src/components/auth/PasswordToggle.tsx:8:76
   onToggle: () => void;
 }
 
-export function PasswordToggle({ visible, onToggle }: PasswordToggleProps) {
-  return (
-    <button
-      type="button"
-      onClick={onToggle}
-      className="absolute top-1/2 right-3 -translate-y-1/2 text-white/40 transition-colors hover:text-white/70"
-      aria-label={visible ? "Hide password" : "Show password"}
-    >
-      {visible ? <EyeOff className="size-4" /> : <Eye className="size-4" />}
-    </button>
-  );
-}
+export function PasswordToggle({ visible, onToggle }: PasswordToggleProps) {}
 
