[NoCoverage] BooleanLiteral
src/components/dashboard/SignOutButton.tsx:14:36
 
 export default function SignOutButton() {
   const formRef = useRef<HTMLFormElement>(null);
-  const [busy, setBusy] = useState(false);
+  const [busy, setBusy] = useState(true);
 
   function handleSignOut() {

[NoCoverage] BlockStatement
src/components/dashboard/SignOutButton.tsx:16:28
   const formRef = useRef<HTMLFormElement>(null);
   const [busy, setBusy] = useState(false);
 
-  function handleSignOut() {
-    setBusy(true);
-    void (async () => {
-      try {
-        await db.delete(); // drop the whole local IndexedDB store
-      } catch {
-        // Best-effort wipe — never block signout on a Dexie hiccup.
-      }
-      // NB: the per-user "don't show again" preference (hideStartupKey) is left
-      // in place on purpose — it is user-scoped, so it must survive logout.
-      formRef.current?.submit(); // native submit -> server clears session, redirects to /
-    })();
-  }
+  function handleSignOut() {}
 
   return (

[NoCoverage] BooleanLiteral
src/components/dashboard/SignOutButton.tsx:17:13
   const [busy, setBusy] = useState(false);
 
   function handleSignOut() {
-    setBusy(true);
+    setBusy(false);
     void (async () => {
       try {

[NoCoverage] BlockStatement
src/components/dashboard/SignOutButton.tsx:18:23
 
   function handleSignOut() {
     setBusy(true);
-    void (async () => {
-      try {
-        await db.delete(); // drop the whole local IndexedDB store
-      } catch {
-        // Best-effort wipe — never block signout on a Dexie hiccup.
-      }
-      // NB: the per-user "don't show again" preference (hideStartupKey) is left
-      // in place on purpose — it is user-scoped, so it must survive logout.
-      formRef.current?.submit(); // native submit -> server clears session, redirects to /
-    })();
+    void (async () => {})();
   }
 

[NoCoverage] BlockStatement
src/components/dashboard/SignOutButton.tsx:19:11
   function handleSignOut() {
     setBusy(true);
     void (async () => {
-      try {
-        await db.delete(); // drop the whole local IndexedDB store
-      } catch {
+      try {} catch {
         // Best-effort wipe — never block signout on a Dexie hiccup.
       }

[NoCoverage] OptionalChaining
src/components/dashboard/SignOutButton.tsx:26:7
       }
       // NB: the per-user "don't show again" preference (hideStartupKey) is left
       // in place on purpose — it is user-scoped, so it must survive logout.
-      formRef.current?.submit(); // native submit -> server clears session, redirects to /
+      formRef.current.submit(); // native submit -> server clears session, redirects to /
     })();
   }
