[NoCoverage] StringLiteral
src/components/dashboard/StartupInstructions.tsx:17:19
         <strong>
           This list is only an auxiliary tool. It does not guarantee that the car you are buying is in good technical
           condition
-        </strong>{" "}
+        </strong>{""}
         — but it is a good starting point for assessing the car and can save you money at a service station.
       </p>

[NoCoverage] StringLiteral
src/components/dashboard/StartupInstructions.tsx:37:113
 
       <p>
         In Section 1 the car&rsquo;s elements and reactions are listed one by one, in the order you should pay attention
-        to them during the inspection. Under each element, choose <strong>Yes</strong>, <strong>No</strong>, or{" "}
+        to them during the inspection. Under each element, choose <strong>Yes</strong>, <strong>No</strong>, or{""}
         <strong>I can&rsquo;t check</strong> after evaluating it:
       </p>
