[NoCoverage] BlockStatement
src/components/auth/ServerError.tsx:7:60
   message?: string | null;
 }
 
-export function ServerError({ message }: ServerErrorProps) {
-  if (!message) return null;
-
-  return (
-    <p className="flex items-center gap-2 rounded-lg border border-red-500/30 bg-red-900/30 px-3 py-2 text-sm text-red-300">
-      <CircleAlert className="size-4 shrink-0" />
-      {message}
-    </p>
-  );
-}
+export function ServerError({ message }: ServerErrorProps) {}
 

[NoCoverage] BooleanLiteral
src/components/auth/ServerError.tsx:8:7
 }
 
 export function ServerError({ message }: ServerErrorProps) {
-  if (!message) return null;
+  if (message) return null;
 
   return (

[NoCoverage] ConditionalExpression
src/components/auth/ServerError.tsx:8:7
 }
 
 export function ServerError({ message }: ServerErrorProps) {
-  if (!message) return null;
+  if (true) return null;
 
   return (
