[NoCoverage] ObjectLiteral
src/components/inspections/EquipmentToggles.tsx:9:49
 import type { FlagColumn, RelevantToggle, RuntimeFlag } from "@/lib/questions";
 
 // UI copy keyed by DB column (the stable identity the toggle carries through to persistence).
-const FLAG_LABELS: Record<FlagColumn, string> = {
-  chargingPortEquipped: "Charging port present",
-  evBatteryDocsAvailable: "EV battery documentation available",
-  turboEquipped: "Turbocharger fitted",
-  mechanicalCompressorEquipped: "Mechanical supercharger fitted",
-  importedFromEu: "Imported from the EU",
-};
+const FLAG_LABELS: Record<FlagColumn, string> = {};
 
 interface Props {

[NoCoverage] StringLiteral
src/components/inspections/EquipmentToggles.tsx:13:33
   chargingPortEquipped: "Charging port present",
   evBatteryDocsAvailable: "EV battery documentation available",
   turboEquipped: "Turbocharger fitted",
-  mechanicalCompressorEquipped: "Mechanical supercharger fitted",
+  mechanicalCompressorEquipped: "",
   importedFromEu: "Imported from the EU",
 };

[NoCoverage] StringLiteral
src/components/inspections/EquipmentToggles.tsx:14:19
   evBatteryDocsAvailable: "EV battery documentation available",
   turboEquipped: "Turbocharger fitted",
   mechanicalCompressorEquipped: "Mechanical supercharger fitted",
-  importedFromEu: "Imported from the EU",
+  importedFromEu: "",
 };
 

[NoCoverage] ConditionalExpression
src/components/inspections/EquipmentToggles.tsx:24:7
 }
 
 export default function EquipmentToggles({ toggles, active, onToggle }: Props) {
-  if (toggles.length === 0) return null;
+  if (false) return null;
 
   return (

[NoCoverage] ConditionalExpression
src/components/inspections/EquipmentToggles.tsx:24:7
 }
 
 export default function EquipmentToggles({ toggles, active, onToggle }: Props) {
-  if (toggles.length === 0) return null;
+  if (true) return null;
 
   return (

[NoCoverage] BlockStatement
src/components/inspections/EquipmentToggles.tsx:41:32
                 type="button"
                 role="switch"
                 aria-checked={on}
-                onClick={() => {
-                  onToggle(t.column, !on);
-                }}
+                onClick={() => {}}
               >

[NoCoverage] BooleanLiteral
src/components/inspections/EquipmentToggles.tsx:42:38
                 role="switch"
                 aria-checked={on}
                 onClick={() => {
-                  onToggle(t.column, !on);
+                  onToggle(t.column, on);
                 }}

[NoCoverage] StringLiteral
src/components/inspections/EquipmentToggles.tsx:50:26
                 <span
                   aria-hidden
                   className={`relative inline-flex h-6 w-11 shrink-0 rounded-full transition-colors ${
-                    on ? "bg-purple-500" : "bg-white/20"
+                    on ? "" : "bg-white/20"
                   }`}
                 >
