[NoCoverage] StringLiteral
src/components/auth/SignInForm.tsx:13:38
 }
 
 export default function SignInForm({ serverError }: Props) {
-  const [email, setEmail] = useState("");
+  const [email, setEmail] = useState("Stryker was here!");
   const [password, setPassword] = useState("");
   const [showPassword, setShowPassword] = useState(false);

[NoCoverage] BooleanLiteral
src/components/auth/SignInForm.tsx:15:52
 export default function SignInForm({ serverError }: Props) {
   const [email, setEmail] = useState("");
   const [password, setPassword] = useState("");
-  const [showPassword, setShowPassword] = useState(false);
+  const [showPassword, setShowPassword] = useState(true);
   const [errors, setErrors] = useState<{ email?: string; password?: string }>({});
 

[NoCoverage] BlockStatement
src/components/auth/SignInForm.tsx:18:23
   const [showPassword, setShowPassword] = useState(false);
   const [errors, setErrors] = useState<{ email?: string; password?: string }>({});
 
-  function validate() {
-    const next: typeof errors = {};
-    if (!email.trim()) {
-      next.email = "Email is required";
-    } else if (!/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(email)) {
-      next.email = "Enter a valid email address";
-    }
-    if (!password) {
-      next.password = "Password is required";
-    }
-    setErrors(next);
-    return Object.keys(next).length === 0;
-  }
+  function validate() {}
 
   function clearError(field: keyof typeof errors) {

[NoCoverage] ConditionalExpression
src/components/auth/SignInForm.tsx:20:9
 
   function validate() {
     const next: typeof errors = {};
-    if (!email.trim()) {
+    if (true) {
       next.email = "Email is required";
     } else if (!/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(email)) {

[NoCoverage] MethodExpression
src/components/auth/SignInForm.tsx:20:10
 
   function validate() {
     const next: typeof errors = {};
-    if (!email.trim()) {
+    if (!email) {
       next.email = "Email is required";
     } else if (!/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(email)) {

[NoCoverage] StringLiteral
src/components/auth/SignInForm.tsx:21:20
   function validate() {
     const next: typeof errors = {};
     if (!email.trim()) {
-      next.email = "Email is required";
+      next.email = "";
     } else if (!/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(email)) {
       next.email = "Enter a valid email address";

[NoCoverage] BlockStatement
src/components/auth/SignInForm.tsx:22:59
     const next: typeof errors = {};
     if (!email.trim()) {
       next.email = "Email is required";
-    } else if (!/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(email)) {
-      next.email = "Enter a valid email address";
-    }
+    } else if (!/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(email)) {}
     if (!password) {
       next.password = "Password is required";

[NoCoverage] ConditionalExpression
src/components/auth/SignInForm.tsx:22:16
     const next: typeof errors = {};
     if (!email.trim()) {
       next.email = "Email is required";
-    } else if (!/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(email)) {
+    } else if (true) {
       next.email = "Enter a valid email address";
     }

[NoCoverage] BooleanLiteral
src/components/auth/SignInForm.tsx:25:9
     } else if (!/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(email)) {
       next.email = "Enter a valid email address";
     }
-    if (!password) {
+    if (password) {
       next.password = "Password is required";
     }

[NoCoverage] BlockStatement
src/components/auth/SignInForm.tsx:25:20
     } else if (!/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(email)) {
       next.email = "Enter a valid email address";
     }
-    if (!password) {
-      next.password = "Password is required";
-    }
+    if (!password) {}
     setErrors(next);
     return Object.keys(next).length === 0;

[NoCoverage] EqualityOperator
src/components/auth/SignInForm.tsx:29:12
       next.password = "Password is required";
     }
     setErrors(next);
-    return Object.keys(next).length === 0;
+    return Object.keys(next).length !== 0;
   }
 

[NoCoverage] ConditionalExpression
src/components/auth/SignInForm.tsx:29:12
       next.password = "Password is required";
     }
     setErrors(next);
-    return Object.keys(next).length === 0;
+    return true;
   }
 

[NoCoverage] BlockStatement
src/components/auth/SignInForm.tsx:32:51
     return Object.keys(next).length === 0;
   }
 
-  function clearError(field: keyof typeof errors) {
-    if (errors[field]) setErrors((prev) => ({ ...prev, [field]: undefined }));
-  }
+  function clearError(field: keyof typeof errors) {}
 
   function handleSubmit(e: React.SubmitEvent<HTMLFormElement>) {

[NoCoverage] ConditionalExpression
src/components/auth/SignInForm.tsx:33:9
   }
 
   function clearError(field: keyof typeof errors) {
-    if (errors[field]) setErrors((prev) => ({ ...prev, [field]: undefined }));
+    if (false) setErrors((prev) => ({ ...prev, [field]: undefined }));
   }
 

[NoCoverage] ConditionalExpression
src/components/auth/SignInForm.tsx:33:9
   }
 
   function clearError(field: keyof typeof errors) {
-    if (errors[field]) setErrors((prev) => ({ ...prev, [field]: undefined }));
+    if (true) setErrors((prev) => ({ ...prev, [field]: undefined }));
   }
 

[NoCoverage] BlockStatement
src/components/auth/SignInForm.tsx:36:64
     if (errors[field]) setErrors((prev) => ({ ...prev, [field]: undefined }));
   }
 
-  function handleSubmit(e: React.SubmitEvent<HTMLFormElement>) {
-    if (!validate()) {
-      e.preventDefault();
-    }
-  }
+  function handleSubmit(e: React.SubmitEvent<HTMLFormElement>) {}
 
   return (

[NoCoverage] ConditionalExpression
src/components/auth/SignInForm.tsx:37:9
   }
 
   function handleSubmit(e: React.SubmitEvent<HTMLFormElement>) {
-    if (!validate()) {
+    if (false) {
       e.preventDefault();
     }

[NoCoverage] BooleanLiteral
src/components/auth/SignInForm.tsx:37:9
   }
 
   function handleSubmit(e: React.SubmitEvent<HTMLFormElement>) {
-    if (!validate()) {
+    if (validate()) {
       e.preventDefault();
     }

[NoCoverage] BlockStatement
src/components/auth/SignInForm.tsx:49:26
         type="email"
         label="Email"
         value={email}
-        onChange={(v) => {
-          setEmail(v);
-          clearError("email");
-        }}
+        onChange={(v) => {}}
         placeholder="you@example.com"
         error={errors.email}

[NoCoverage] StringLiteral
src/components/auth/SignInForm.tsx:61:39
       <FormField
         id="password"
         label="Password"
-        type={showPassword ? "text" : "password"}
+        type={showPassword ? "text" : ""}
         value={password}
         onChange={(v) => {

[NoCoverage] StringLiteral
src/components/auth/SignInForm.tsx:61:30
       <FormField
         id="password"
         label="Password"
-        type={showPassword ? "text" : "password"}
+        type={showPassword ? "" : "password"}
         value={password}
         onChange={(v) => {

[NoCoverage] BlockStatement
src/components/auth/SignInForm.tsx:63:26
         label="Password"
         type={showPassword ? "text" : "password"}
         value={password}
-        onChange={(v) => {
-          setPassword(v);
-          clearError("password");
-        }}
+        onChange={(v) => {}}
         placeholder="Your password"
         error={errors.password}

[NoCoverage] BlockStatement
src/components/auth/SignInForm.tsx:73:29
         endContent={
           <PasswordToggle
             visible={showPassword}
-            onToggle={() => {
-              setShowPassword(!showPassword);
-            }}
+            onToggle={() => {}}
           />
         }

[NoCoverage] BooleanLiteral
src/components/auth/SignInForm.tsx:74:31
           <PasswordToggle
             visible={showPassword}
             onToggle={() => {
-              setShowPassword(!showPassword);
+              setShowPassword(showPassword);
             }}
           />
