[NoCoverage] StringLiteral
src/components/auth/SignUpForm.tsx:15:38
 }
 
 export default function SignUpForm({ serverError }: Props) {
-  const [email, setEmail] = useState("");
+  const [email, setEmail] = useState("Stryker was here!");
   const [password, setPassword] = useState("");
   const [confirmPassword, setConfirmPassword] = useState("");

[NoCoverage] BooleanLiteral
src/components/auth/SignUpForm.tsx:18:52
   const [email, setEmail] = useState("");
   const [password, setPassword] = useState("");
   const [confirmPassword, setConfirmPassword] = useState("");
-  const [showPassword, setShowPassword] = useState(false);
+  const [showPassword, setShowPassword] = useState(true);
   const [showConfirmPassword, setShowConfirmPassword] = useState(false);
   const [errors, setErrors] = useState<{ email?: string; password?: string; confirmPassword?: string }>({});

[NoCoverage] BlockStatement
src/components/auth/SignUpForm.tsx:22:23
   const [showConfirmPassword, setShowConfirmPassword] = useState(false);
   const [errors, setErrors] = useState<{ email?: string; password?: string; confirmPassword?: string }>({});
 
-  function validate() {
-    const next: typeof errors = {};
-
-    if (!email.trim()) {
-      next.email = "Email is required";
-    } else if (!/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(email)) {
-      next.email = "Enter a valid email address";
-    }
-
-    if (!password) {
-      next.password = "Password is required";
-    } else if (password.length < MIN_PASSWORD_LENGTH) {
-      next.password = `Password must be at least ${MIN_PASSWORD_LENGTH} characters`;
-    }
-
-    if (!confirmPassword) {
-      next.confirmPassword = "Please confirm your password";
-    } else if (password !== confirmPassword) {
-      next.confirmPassword = "Passwords do not match";
-    }
-
-    setErrors(next);
-    return Object.keys(next).length === 0;
-  }
+  function validate() {}
 
   function clearError(field: keyof typeof errors) {

[NoCoverage] ConditionalExpression
src/components/auth/SignUpForm.tsx:25:9
   function validate() {
     const next: typeof errors = {};
 
-    if (!email.trim()) {
+    if (true) {
       next.email = "Email is required";
     } else if (!/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(email)) {

[NoCoverage] BooleanLiteral
src/components/auth/SignUpForm.tsx:25:9
   function validate() {
     const next: typeof errors = {};
 
-    if (!email.trim()) {
+    if (email.trim()) {
       next.email = "Email is required";
     } else if (!/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(email)) {

[NoCoverage] BooleanLiteral
src/components/auth/SignUpForm.tsx:27:16
 
     if (!email.trim()) {
       next.email = "Email is required";
-    } else if (!/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(email)) {
+    } else if (/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(email)) {
       next.email = "Enter a valid email address";
     }

[NoCoverage] StringLiteral
src/components/auth/SignUpForm.tsx:28:20
     if (!email.trim()) {
       next.email = "Email is required";
     } else if (!/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(email)) {
-      next.email = "Enter a valid email address";
+      next.email = "";
     }
 

[NoCoverage] ConditionalExpression
src/components/auth/SignUpForm.tsx:33:16
 
     if (!password) {
       next.password = "Password is required";
-    } else if (password.length < MIN_PASSWORD_LENGTH) {
+    } else if (false) {
       next.password = `Password must be at least ${MIN_PASSWORD_LENGTH} characters`;
     }

[NoCoverage] BlockStatement
src/components/auth/SignUpForm.tsx:33:55
 
     if (!password) {
       next.password = "Password is required";
-    } else if (password.length < MIN_PASSWORD_LENGTH) {
-      next.password = `Password must be at least ${MIN_PASSWORD_LENGTH} characters`;
-    }
+    } else if (password.length < MIN_PASSWORD_LENGTH) {}
 
     if (!confirmPassword) {

[NoCoverage] BooleanLiteral
src/components/auth/SignUpForm.tsx:37:9
       next.password = `Password must be at least ${MIN_PASSWORD_LENGTH} characters`;
     }
 
-    if (!confirmPassword) {
+    if (confirmPassword) {
       next.confirmPassword = "Please confirm your password";
     } else if (password !== confirmPassword) {

[NoCoverage] BlockStatement
src/components/auth/SignUpForm.tsx:37:27
       next.password = `Password must be at least ${MIN_PASSWORD_LENGTH} characters`;
     }
 
-    if (!confirmPassword) {
-      next.confirmPassword = "Please confirm your password";
-    } else if (password !== confirmPassword) {
+    if (!confirmPassword) {} else if (password !== confirmPassword) {
       next.confirmPassword = "Passwords do not match";
     }

[NoCoverage] EqualityOperator
src/components/auth/SignUpForm.tsx:39:16
 
     if (!confirmPassword) {
       next.confirmPassword = "Please confirm your password";
-    } else if (password !== confirmPassword) {
+    } else if (password === confirmPassword) {
       next.confirmPassword = "Passwords do not match";
     }

[NoCoverage] ConditionalExpression
src/components/auth/SignUpForm.tsx:39:16
 
     if (!confirmPassword) {
       next.confirmPassword = "Please confirm your password";
-    } else if (password !== confirmPassword) {
+    } else if (true) {
       next.confirmPassword = "Passwords do not match";
     }

[NoCoverage] ConditionalExpression
src/components/auth/SignUpForm.tsx:44:12
     }
 
     setErrors(next);
-    return Object.keys(next).length === 0;
+    return false;
   }
 

[NoCoverage] ConditionalExpression
src/components/auth/SignUpForm.tsx:52:9
   }
 
   function handleSubmit(e: React.SubmitEvent<HTMLFormElement>) {
-    if (!validate()) {
+    if (true) {
       e.preventDefault();
     }

[NoCoverage] ConditionalExpression
src/components/auth/SignUpForm.tsx:58:25
   }
 
   const passwordHint =
-    !errors.password && password.length > 0 && password.length < MIN_PASSWORD_LENGTH ? (
+    !errors.password && true && password.length < MIN_PASSWORD_LENGTH ? (
       <p className="mt-1 text-xs text-blue-100/50">
         {MIN_PASSWORD_LENGTH - password.length} more character

[NoCoverage] BooleanLiteral
src/components/auth/SignUpForm.tsx:58:5
   }
 
   const passwordHint =
-    !errors.password && password.length > 0 && password.length < MIN_PASSWORD_LENGTH ? (
+    errors.password && password.length > 0 && password.length < MIN_PASSWORD_LENGTH ? (
       <p className="mt-1 text-xs text-blue-100/50">
         {MIN_PASSWORD_LENGTH - password.length} more character

[NoCoverage] ArithmeticOperator
src/components/auth/SignUpForm.tsx:60:10
   const passwordHint =
     !errors.password && password.length > 0 && password.length < MIN_PASSWORD_LENGTH ? (
       <p className="mt-1 text-xs text-blue-100/50">
-        {MIN_PASSWORD_LENGTH - password.length} more character
+        {MIN_PASSWORD_LENGTH + password.length} more character
         {MIN_PASSWORD_LENGTH - password.length !== 1 ? "s" : ""} needed
       </p>

[NoCoverage] EqualityOperator
src/components/auth/SignUpForm.tsx:61:10
     !errors.password && password.length > 0 && password.length < MIN_PASSWORD_LENGTH ? (
       <p className="mt-1 text-xs text-blue-100/50">
         {MIN_PASSWORD_LENGTH - password.length} more character
-        {MIN_PASSWORD_LENGTH - password.length !== 1 ? "s" : ""} needed
+        {MIN_PASSWORD_LENGTH - password.length === 1 ? "s" : ""} needed
       </p>
     ) : undefined;

[NoCoverage] ConditionalExpression
src/components/auth/SignUpForm.tsx:61:10
     !errors.password && password.length > 0 && password.length < MIN_PASSWORD_LENGTH ? (
       <p className="mt-1 text-xs text-blue-100/50">
         {MIN_PASSWORD_LENGTH - password.length} more character
-        {MIN_PASSWORD_LENGTH - password.length !== 1 ? "s" : ""} needed
+        {true ? "s" : ""} needed
       </p>
     ) : undefined;

[NoCoverage] StringLiteral
src/components/auth/SignUpForm.tsx:88:22
         value={password}
         onChange={(v) => {
           setPassword(v);
-          clearError("password");
+          clearError("");
         }}
         placeholder="Min. 6 characters"

[NoCoverage] BlockStatement
src/components/auth/SignUpForm.tsx:110:26
         label="Confirm password"
         type={showConfirmPassword ? "text" : "password"}
         value={confirmPassword}
-        onChange={(v) => {
-          setConfirmPassword(v);
-          clearError("confirmPassword");
-        }}
+        onChange={(v) => {}}
         placeholder="Re-enter your password"
         error={errors.confirmPassword}

[NoCoverage] BlockStatement
src/components/auth/SignUpForm.tsx:120:29
         endContent={
           <PasswordToggle
             visible={showConfirmPassword}
-            onToggle={() => {
-              setShowConfirmPassword(!showConfirmPassword);
-            }}
+            onToggle={() => {}}
           />
         }

[NoCoverage] BooleanLiteral
src/components/auth/SignUpForm.tsx:121:38
           <PasswordToggle
             visible={showConfirmPassword}
             onToggle={() => {
-              setShowConfirmPassword(!showConfirmPassword);
+              setShowConfirmPassword(showConfirmPassword);
             }}
           />
