[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:31:21
 // are light-themed by default; these className overrides recolor them for the dark
 // shell (tailwind-merge lets the later utilities win).
 const PANEL = "border-white/10 bg-white/5 text-white backdrop-blur-xl";
-const FIELD_INPUT = "border-white/20 bg-white/10 text-white placeholder:text-white/40";
+const FIELD_INPUT = "";
 const PRIMARY_BTN = "bg-purple-600 text-white hover:bg-purple-500";
 

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:38:3
 // order. Matches the rules doc §4 table.
 const FIELD_ORDER: Part1Field[] = [
   "price",
-  "make",
+  "",
   "model",
   "year",

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:39:3
 const FIELD_ORDER: Part1Field[] = [
   "price",
   "make",
-  "model",
+  "",
   "year",
   "registrationNumber",

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:41:3
   "make",
   "model",
   "year",
-  "registrationNumber",
+  "",
   "vin",
   "mileage",

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:43:3
   "year",
   "registrationNumber",
   "vin",
-  "mileage",
+  "",
   "fuelType",
   "transmission",

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:45:3
   "vin",
   "mileage",
   "fuelType",
-  "transmission",
+  "",
   "drive",
   "color",

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:46:3
   "mileage",
   "fuelType",
   "transmission",
-  "drive",
+  "",
   "color",
   "bodyType",

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:48:3
   "transmission",
   "drive",
   "color",
-  "bodyType",
+  "",
   "doorCount",
   "address",

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:50:3
   "color",
   "bodyType",
   "doorCount",
-  "address",
+  "",
   "notes",
 ];

[NoCoverage] ArrayDeclaration
src/components/inspections/Part1Form.tsx:57:63
 // The six PRD-required fields (FR-013). Drives the "*" affordance only; the actual
 // gate is the full-schema parse in `isConfigUnlocked`. Year + Registration are
 // optional (FR-006 — tile title only), so they are NOT here.
-const REQUIRED: ReadonlySet<Part1Field> = new Set<Part1Field>([
-  "make",
-  "model",
-  "fuelType",
-  "transmission",
-  "drive",
-  "bodyType",
-]);
+const REQUIRED: ReadonlySet<Part1Field> = new Set<Part1Field>([]);
 
 const LABELS: Record<Part1Field, string> = {

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:60:3
 const REQUIRED: ReadonlySet<Part1Field> = new Set<Part1Field>([
   "make",
   "model",
-  "fuelType",
+  "",
   "transmission",
   "drive",

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:71:23
   make: "Make",
   model: "Model",
   year: "Year of production",
-  registrationNumber: "Registration number",
+  registrationNumber: "",
   vin: "VIN number",
   mileage: "Mileage",

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:73:12
   year: "Year of production",
   registrationNumber: "Registration number",
   vin: "VIN number",
-  mileage: "Mileage",
+  mileage: "",
   fuelType: "Fuel type",
   transmission: "Transmission",

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:75:17
   vin: "VIN number",
   mileage: "Mileage",
   fuelType: "Fuel type",
-  transmission: "Transmission",
+  transmission: "",
   drive: "Drive",
   color: "Color",

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:76:10
   mileage: "Mileage",
   fuelType: "Fuel type",
   transmission: "Transmission",
-  drive: "Drive",
+  drive: "",
   color: "Color",
   bodyType: "Body type",

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:80:12
   color: "Color",
   bodyType: "Body type",
   doorCount: "No of doors",
-  address: "Address",
+  address: "",
   notes: "Notes",
 };

[NoCoverage] ArithmeticOperator
src/components/inspections/Part1Form.tsx:86:63
 
 // Year: dropdown from the current year down to 1886 (mirrors the schema bounds).
 const YEAR_MAX = new Date().getFullYear();
-const YEAR_OPTIONS: [string, string][] = Array.from({ length: YEAR_MAX - 1886 + 1 }, (_, i) => {
+const YEAR_OPTIONS: [string, string][] = Array.from({ length: YEAR_MAX + 1886 + 1 }, (_, i) => {
   const y = String(YEAR_MAX - i);
   return [y, y];

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:86:96
 
 // Year: dropdown from the current year down to 1886 (mirrors the schema bounds).
 const YEAR_MAX = new Date().getFullYear();
-const YEAR_OPTIONS: [string, string][] = Array.from({ length: YEAR_MAX - 1886 + 1 }, (_, i) => {
-  const y = String(YEAR_MAX - i);
-  return [y, y];
-});
+const YEAR_OPTIONS: [string, string][] = Array.from({ length: YEAR_MAX - 1886 + 1 }, (_, i) => {});
 
 // No. of doors: dropdown 0–7 (mirrors the schema bounds).

[NoCoverage] ArithmeticOperator
src/components/inspections/Part1Form.tsx:87:20
 // Year: dropdown from the current year down to 1886 (mirrors the schema bounds).
 const YEAR_MAX = new Date().getFullYear();
 const YEAR_OPTIONS: [string, string][] = Array.from({ length: YEAR_MAX - 1886 + 1 }, (_, i) => {
-  const y = String(YEAR_MAX - i);
+  const y = String(YEAR_MAX + i);
   return [y, y];
 });

[NoCoverage] ArrayDeclaration
src/components/inspections/Part1Form.tsx:88:10
 const YEAR_MAX = new Date().getFullYear();
 const YEAR_OPTIONS: [string, string][] = Array.from({ length: YEAR_MAX - 1886 + 1 }, (_, i) => {
   const y = String(YEAR_MAX - i);
-  return [y, y];
+  return [];
 });
 

[NoCoverage] ArrowFunction
src/components/inspections/Part1Form.tsx:92:68
 });
 
 // No. of doors: dropdown 0–7 (mirrors the schema bounds).
-const DOOR_OPTIONS: [string, string][] = Array.from({ length: 8 }, (_, i) => [String(i), String(i)]);
+const DOOR_OPTIONS: [string, string][] = Array.from({ length: 8 }, () => undefined);
 
 // Fields rendered as a <Select>. Enum keys are the lowercase stored values (mirror

[NoCoverage] ObjectLiteral
src/components/inspections/Part1Form.tsx:92:53
 });
 
 // No. of doors: dropdown 0–7 (mirrors the schema bounds).
-const DOOR_OPTIONS: [string, string][] = Array.from({ length: 8 }, (_, i) => [String(i), String(i)]);
+const DOOR_OPTIONS: [string, string][] = Array.from({}, (_, i) => [String(i), String(i)]);
 
 // Fields rendered as a <Select>. Enum keys are the lowercase stored values (mirror

[NoCoverage] ArrayDeclaration
src/components/inspections/Part1Form.tsx:99:5
 const ENUM_OPTIONS: Partial<Record<Part1Field, [string, string][]>> = {
   year: YEAR_OPTIONS,
   fuelType: [
-    ["petrol", "Petrol"],
+    [],
     ["diesel", "Diesel"],
     ["hybrid", "Hybrid"],

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:100:16
   year: YEAR_OPTIONS,
   fuelType: [
     ["petrol", "Petrol"],
-    ["diesel", "Diesel"],
+    ["diesel", ""],
     ["hybrid", "Hybrid"],
     ["electric", "Electric"],

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:100:6
   year: YEAR_OPTIONS,
   fuelType: [
     ["petrol", "Petrol"],
-    ["diesel", "Diesel"],
+    ["", "Diesel"],
     ["hybrid", "Hybrid"],
     ["electric", "Electric"],

[NoCoverage] ArrayDeclaration
src/components/inspections/Part1Form.tsx:101:5
   fuelType: [
     ["petrol", "Petrol"],
     ["diesel", "Diesel"],
-    ["hybrid", "Hybrid"],
+    [],
     ["electric", "Electric"],
   ],

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:102:18
     ["petrol", "Petrol"],
     ["diesel", "Diesel"],
     ["hybrid", "Hybrid"],
-    ["electric", "Electric"],
+    ["electric", ""],
   ],
   transmission: [

[NoCoverage] ArrayDeclaration
src/components/inspections/Part1Form.tsx:104:17
     ["hybrid", "Hybrid"],
     ["electric", "Electric"],
   ],
-  transmission: [
-    ["manual", "Manual"],
-    ["automatic", "Automatic"],
-  ],
+  transmission: [],
   drive: [
     ["2wd", "2WD"],

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:105:6
     ["electric", "Electric"],
   ],
   transmission: [
-    ["manual", "Manual"],
+    ["", "Manual"],
     ["automatic", "Automatic"],
   ],

[NoCoverage] ArrayDeclaration
src/components/inspections/Part1Form.tsx:106:5
   ],
   transmission: [
     ["manual", "Manual"],
-    ["automatic", "Automatic"],
+    [],
   ],
   drive: [

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:106:6
   ],
   transmission: [
     ["manual", "Manual"],
-    ["automatic", "Automatic"],
+    ["", "Automatic"],
   ],
   drive: [

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:110:6
   ],
   drive: [
     ["2wd", "2WD"],
-    ["4wd", "4WD"],
+    ["", "4WD"],
   ],
   bodyType: [

[NoCoverage] ArrayDeclaration
src/components/inspections/Part1Form.tsx:114:5
   ],
   bodyType: [
     ["sedan", "Sedan"],
-    ["hatchback", "Hatchback"],
+    [],
     ["suv", "SUV"],
     ["coupe", "Coupe"],

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:115:6
   bodyType: [
     ["sedan", "Sedan"],
     ["hatchback", "Hatchback"],
-    ["suv", "SUV"],
+    ["", "SUV"],
     ["coupe", "Coupe"],
     ["convertible", "Convertible"],

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:115:13
   bodyType: [
     ["sedan", "Sedan"],
     ["hatchback", "Hatchback"],
-    ["suv", "SUV"],
+    ["suv", ""],
     ["coupe", "Coupe"],
     ["convertible", "Convertible"],

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:116:6
     ["sedan", "Sedan"],
     ["hatchback", "Hatchback"],
     ["suv", "SUV"],
-    ["coupe", "Coupe"],
+    ["", "Coupe"],
     ["convertible", "Convertible"],
     ["van", "Van"],

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:117:6
     ["hatchback", "Hatchback"],
     ["suv", "SUV"],
     ["coupe", "Coupe"],
-    ["convertible", "Convertible"],
+    ["", "Convertible"],
     ["van", "Van"],
     ["pickup", "Pickup"],

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:118:13
     ["suv", "SUV"],
     ["coupe", "Coupe"],
     ["convertible", "Convertible"],
-    ["van", "Van"],
+    ["van", ""],
     ["pickup", "Pickup"],
     ["other", "Other"],

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:119:16
     ["coupe", "Coupe"],
     ["convertible", "Convertible"],
     ["van", "Van"],
-    ["pickup", "Pickup"],
+    ["pickup", ""],
     ["other", "Other"],
   ],

[NoCoverage] ArrayDeclaration
src/components/inspections/Part1Form.tsx:119:5
     ["coupe", "Coupe"],
     ["convertible", "Convertible"],
     ["van", "Van"],
-    ["pickup", "Pickup"],
+    [],
     ["other", "Other"],
   ],

[NoCoverage] ArrayDeclaration
src/components/inspections/Part1Form.tsx:120:5
     ["convertible", "Convertible"],
     ["van", "Van"],
     ["pickup", "Pickup"],
-    ["other", "Other"],
+    [],
   ],
   doorCount: DOOR_OPTIONS,

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:120:15
     ["convertible", "Convertible"],
     ["van", "Van"],
     ["pickup", "Pickup"],
-    ["other", "Other"],
+    ["other", ""],
   ],
   doorCount: DOOR_OPTIONS,

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:165:73
 }
 
 // Seed the equipment-flag state from the loaded inspection (null/false → off).
-function seedFlags(i: Part1FormInspection): Record<FlagColumn, boolean> {
-  return {
-    chargingPortEquipped: i.chargingPortEquipped ?? false,
-    evBatteryDocsAvailable: i.evBatteryDocsAvailable ?? false,
-    turboEquipped: i.turboEquipped ?? false,
-    mechanicalCompressorEquipped: i.mechanicalCompressorEquipped ?? false,
-    importedFromEu: i.importedFromEu ?? false,
-  };
-}
+function seedFlags(i: Part1FormInspection): Record<FlagColumn, boolean> {}
 
 // Form values are all strings (the schema INPUT is raw form text). Seed each field

[NoCoverage] LogicalOperator
src/components/inspections/Part1Form.tsx:167:27
 // Seed the equipment-flag state from the loaded inspection (null/false → off).
 function seedFlags(i: Part1FormInspection): Record<FlagColumn, boolean> {
   return {
-    chargingPortEquipped: i.chargingPortEquipped ?? false,
+    chargingPortEquipped: i.chargingPortEquipped && false,
     evBatteryDocsAvailable: i.evBatteryDocsAvailable ?? false,
     turboEquipped: i.turboEquipped ?? false,

[NoCoverage] BooleanLiteral
src/components/inspections/Part1Form.tsx:167:53
 // Seed the equipment-flag state from the loaded inspection (null/false → off).
 function seedFlags(i: Part1FormInspection): Record<FlagColumn, boolean> {
   return {
-    chargingPortEquipped: i.chargingPortEquipped ?? false,
+    chargingPortEquipped: i.chargingPortEquipped ?? true,
     evBatteryDocsAvailable: i.evBatteryDocsAvailable ?? false,
     turboEquipped: i.turboEquipped ?? false,

[NoCoverage] LogicalOperator
src/components/inspections/Part1Form.tsx:168:29
 function seedFlags(i: Part1FormInspection): Record<FlagColumn, boolean> {
   return {
     chargingPortEquipped: i.chargingPortEquipped ?? false,
-    evBatteryDocsAvailable: i.evBatteryDocsAvailable ?? false,
+    evBatteryDocsAvailable: i.evBatteryDocsAvailable && false,
     turboEquipped: i.turboEquipped ?? false,
     mechanicalCompressorEquipped: i.mechanicalCompressorEquipped ?? false,

[NoCoverage] BooleanLiteral
src/components/inspections/Part1Form.tsx:168:57
 function seedFlags(i: Part1FormInspection): Record<FlagColumn, boolean> {
   return {
     chargingPortEquipped: i.chargingPortEquipped ?? false,
-    evBatteryDocsAvailable: i.evBatteryDocsAvailable ?? false,
+    evBatteryDocsAvailable: i.evBatteryDocsAvailable ?? true,
     turboEquipped: i.turboEquipped ?? false,
     mechanicalCompressorEquipped: i.mechanicalCompressorEquipped ?? false,

[NoCoverage] BooleanLiteral
src/components/inspections/Part1Form.tsx:169:39
   return {
     chargingPortEquipped: i.chargingPortEquipped ?? false,
     evBatteryDocsAvailable: i.evBatteryDocsAvailable ?? false,
-    turboEquipped: i.turboEquipped ?? false,
+    turboEquipped: i.turboEquipped ?? true,
     mechanicalCompressorEquipped: i.mechanicalCompressorEquipped ?? false,
     importedFromEu: i.importedFromEu ?? false,

[NoCoverage] LogicalOperator
src/components/inspections/Part1Form.tsx:169:20
   return {
     chargingPortEquipped: i.chargingPortEquipped ?? false,
     evBatteryDocsAvailable: i.evBatteryDocsAvailable ?? false,
-    turboEquipped: i.turboEquipped ?? false,
+    turboEquipped: i.turboEquipped && false,
     mechanicalCompressorEquipped: i.mechanicalCompressorEquipped ?? false,
     importedFromEu: i.importedFromEu ?? false,

[NoCoverage] LogicalOperator
src/components/inspections/Part1Form.tsx:170:35
     chargingPortEquipped: i.chargingPortEquipped ?? false,
     evBatteryDocsAvailable: i.evBatteryDocsAvailable ?? false,
     turboEquipped: i.turboEquipped ?? false,
-    mechanicalCompressorEquipped: i.mechanicalCompressorEquipped ?? false,
+    mechanicalCompressorEquipped: i.mechanicalCompressorEquipped && false,
     importedFromEu: i.importedFromEu ?? false,
   };

[NoCoverage] BooleanLiteral
src/components/inspections/Part1Form.tsx:170:69
     chargingPortEquipped: i.chargingPortEquipped ?? false,
     evBatteryDocsAvailable: i.evBatteryDocsAvailable ?? false,
     turboEquipped: i.turboEquipped ?? false,
-    mechanicalCompressorEquipped: i.mechanicalCompressorEquipped ?? false,
+    mechanicalCompressorEquipped: i.mechanicalCompressorEquipped ?? true,
     importedFromEu: i.importedFromEu ?? false,
   };

[NoCoverage] BooleanLiteral
src/components/inspections/Part1Form.tsx:171:41
     evBatteryDocsAvailable: i.evBatteryDocsAvailable ?? false,
     turboEquipped: i.turboEquipped ?? false,
     mechanicalCompressorEquipped: i.mechanicalCompressorEquipped ?? false,
-    importedFromEu: i.importedFromEu ?? false,
+    importedFromEu: i.importedFromEu ?? true,
   };
 }

[NoCoverage] LogicalOperator
src/components/inspections/Part1Form.tsx:171:21
     evBatteryDocsAvailable: i.evBatteryDocsAvailable ?? false,
     turboEquipped: i.turboEquipped ?? false,
     mechanicalCompressorEquipped: i.mechanicalCompressorEquipped ?? false,
-    importedFromEu: i.importedFromEu ?? false,
+    importedFromEu: i.importedFromEu && false,
   };
 }

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:177:57
 
 // Form values are all strings (the schema INPUT is raw form text). Seed each field
 // from the loaded config: null → "", numbers → their string form.
-function toFormValue(v: string | number | null): string {
-  return v === null ? "" : String(v);
-}
+function toFormValue(v: string | number | null): string {}
 
 // Drop one key without a dynamic `delete` (lint: no-dynamic-delete).

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:178:10
 // Form values are all strings (the schema INPUT is raw form text). Seed each field
 // from the loaded config: null → "", numbers → their string form.
 function toFormValue(v: string | number | null): string {
-  return v === null ? "" : String(v);
+  return false ? "" : String(v);
 }
 

[NoCoverage] EqualityOperator
src/components/inspections/Part1Form.tsx:178:10
 // Form values are all strings (the schema INPUT is raw form text). Seed each field
 // from the loaded config: null → "", numbers → their string form.
 function toFormValue(v: string | number | null): string {
-  return v === null ? "" : String(v);
+  return v !== null ? "" : String(v);
 }
 

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:185:40
 function omitError(
   errors: Partial<Record<Part1Field, string>>,
   field: Part1Field,
-): Partial<Record<Part1Field, string>> {
-  const { [field]: _removed, ...rest } = errors;
-  return rest;
-}
+): Partial<Record<Part1Field, string>> {}
 
 function seedValues(i: Part1FormInspection): Record<Part1Field, string> {

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:190:73
   return rest;
 }
 
-function seedValues(i: Part1FormInspection): Record<Part1Field, string> {
-  return {
-    price: toFormValue(i.price),
-    make: toFormValue(i.make),
-    model: toFormValue(i.model),
-    year: toFormValue(i.year),
-    registrationNumber: toFormValue(i.registrationNumber),
-    vin: toFormValue(i.vin),
-    mileage: toFormValue(i.mileage),
-    fuelType: toFormValue(i.fuelType),
-    transmission: toFormValue(i.transmission),
-    drive: toFormValue(i.drive),
-    color: toFormValue(i.color),
-    bodyType: toFormValue(i.bodyType),
-    doorCount: toFormValue(i.doorCount),
-    address: toFormValue(i.address),
-    notes: toFormValue(i.notes),
-  };
-}
+function seedValues(i: Part1FormInspection): Record<Part1Field, string> {}
 
 export default function Part1Form({ inspection, relevantTogglesByFuel }: Props) {

[NoCoverage] ArrowFunction
src/components/inspections/Part1Form.tsx:211:68
 }
 
 export default function Part1Form({ inspection, relevantTogglesByFuel }: Props) {
-  const [values, setValues] = useState<Record<Part1Field, string>>(() => seedValues(inspection));
+  const [values, setValues] = useState<Record<Part1Field, string>>(() => undefined);
   const [errors, setErrors] = useState<Partial<Record<Part1Field, string>>>({});
   const [name, setName] = useState<string | null>(inspection.name);

[NoCoverage] ArrowFunction
src/components/inspections/Part1Form.tsx:214:67
   const [values, setValues] = useState<Record<Part1Field, string>>(() => seedValues(inspection));
   const [errors, setErrors] = useState<Partial<Record<Part1Field, string>>>({});
   const [name, setName] = useState<string | null>(inspection.name);
-  const [flags, setFlags] = useState<Record<FlagColumn, boolean>>(() => seedFlags(inspection));
+  const [flags, setFlags] = useState<Record<FlagColumn, boolean>>(() => undefined);
   const [saving, setSaving] = useState(false);
   const [justSaved, setJustSaved] = useState(false);

[NoCoverage] BooleanLiteral
src/components/inspections/Part1Form.tsx:215:40
   const [errors, setErrors] = useState<Partial<Record<Part1Field, string>>>({});
   const [name, setName] = useState<string | null>(inspection.name);
   const [flags, setFlags] = useState<Record<FlagColumn, boolean>>(() => seedFlags(inspection));
-  const [saving, setSaving] = useState(false);
+  const [saving, setSaving] = useState(true);
   const [justSaved, setJustSaved] = useState(false);
   const [saveError, setSaveError] = useState<string | null>(null);

[NoCoverage] BooleanLiteral
src/components/inspections/Part1Form.tsx:216:46
   const [name, setName] = useState<string | null>(inspection.name);
   const [flags, setFlags] = useState<Record<FlagColumn, boolean>>(() => seedFlags(inspection));
   const [saving, setSaving] = useState(false);
-  const [justSaved, setJustSaved] = useState(false);
+  const [justSaved, setJustSaved] = useState(true);
   const [saveError, setSaveError] = useState<string | null>(null);
 

[NoCoverage] LogicalOperator
src/components/inspections/Part1Form.tsx:221:41
 
   // Which equipment toggles to show, driven by the live fuelType selection (the only axis
   // any flag-gated group depends on). Catalogue-derived map, so no fuel rules live here.
-  const toggles = relevantTogglesByFuel[values.fuelType || "none"] ?? relevantTogglesByFuel.none;
+  const toggles = relevantTogglesByFuel[values.fuelType && "none"] ?? relevantTogglesByFuel.none;
   const activeFlags = new Set<RuntimeFlag>();
   for (const t of toggles) if (flags[t.column]) activeFlags.add(t.flag);

[NoCoverage] LogicalOperator
src/components/inspections/Part1Form.tsx:221:19
 
   // Which equipment toggles to show, driven by the live fuelType selection (the only axis
   // any flag-gated group depends on). Catalogue-derived map, so no fuel rules live here.
-  const toggles = relevantTogglesByFuel[values.fuelType || "none"] ?? relevantTogglesByFuel.none;
+  const toggles = relevantTogglesByFuel[values.fuelType || "none"] && relevantTogglesByFuel.none;
   const activeFlags = new Set<RuntimeFlag>();
   for (const t of toggles) if (flags[t.column]) activeFlags.add(t.flag);

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:223:32
   // any flag-gated group depends on). Catalogue-derived map, so no fuel rules live here.
   const toggles = relevantTogglesByFuel[values.fuelType || "none"] ?? relevantTogglesByFuel.none;
   const activeFlags = new Set<RuntimeFlag>();
-  for (const t of toggles) if (flags[t.column]) activeFlags.add(t.flag);
+  for (const t of toggles) if (true) activeFlags.add(t.flag);
 
   // Focus targets for UX-3. Inputs register their <input>; selects register their

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:223:32
   // any flag-gated group depends on). Catalogue-derived map, so no fuel rules live here.
   const toggles = relevantTogglesByFuel[values.fuelType || "none"] ?? relevantTogglesByFuel.none;
   const activeFlags = new Set<RuntimeFlag>();
-  for (const t of toggles) if (flags[t.column]) activeFlags.add(t.flag);
+  for (const t of toggles) if (false) activeFlags.add(t.flag);
 
   // Focus targets for UX-3. Inputs register their <input>; selects register their

[NoCoverage] ArrowFunction
src/components/inspections/Part1Form.tsx:231:13
 
   // Drain the outbox for this session: a Save enqueues, and these redundant
   // triggers (online/visibility/timer/initial) guarantee it reaches the server.
-  useEffect(() => startAutoSync(), []);
+  useEffect(() => undefined, []);
 
   // Re-run full validation but only (un)set the one field's error, so blurring a

[NoCoverage] ArrayDeclaration
src/components/inspections/Part1Form.tsx:231:36
 
   // Drain the outbox for this session: a Save enqueues, and these redundant
   // triggers (online/visibility/timer/initial) guarantee it reaches the server.
-  useEffect(() => startAutoSync(), []);
+  useEffect(() => startAutoSync(), ["Stryker was here"]);
 
   // Re-run full validation but only (un)set the one field's error, so blurring a

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:235:79
 
   // Re-run full validation but only (un)set the one field's error, so blurring a
   // field never lights up untouched fields.
-  function validateField(field: Part1Field, vals: Record<Part1Field, string>) {
-    const result = validatePart1(vals);
-    setErrors((prev) => {
-      if (result.ok || !result.errors[field]) return omitError(prev, field);
-      return { ...prev, [field]: result.errors[field] };
-    });
-  }
+  function validateField(field: Part1Field, vals: Record<Part1Field, string>) {}
 
   function handleInput(field: Part1Field, value: string) {

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:237:25
   // field never lights up untouched fields.
   function validateField(field: Part1Field, vals: Record<Part1Field, string>) {
     const result = validatePart1(vals);
-    setErrors((prev) => {
-      if (result.ok || !result.errors[field]) return omitError(prev, field);
-      return { ...prev, [field]: result.errors[field] };
-    });
+    setErrors((prev) => {});
   }
 

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:238:11
   function validateField(field: Part1Field, vals: Record<Part1Field, string>) {
     const result = validatePart1(vals);
     setErrors((prev) => {
-      if (result.ok || !result.errors[field]) return omitError(prev, field);
+      if (true) return omitError(prev, field);
       return { ...prev, [field]: result.errors[field] };
     });

[NoCoverage] LogicalOperator
src/components/inspections/Part1Form.tsx:238:11
   function validateField(field: Part1Field, vals: Record<Part1Field, string>) {
     const result = validatePart1(vals);
     setErrors((prev) => {
-      if (result.ok || !result.errors[field]) return omitError(prev, field);
+      if (result.ok && !result.errors[field]) return omitError(prev, field);
       return { ...prev, [field]: result.errors[field] };
     });

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:243:58
     });
   }
 
-  function handleInput(field: Part1Field, value: string) {
-    // Numeric fields reject letters as the user types: mileage is digits only;
-    // price also allows the decimal separators (. ,). The schema still does the
-    // authoritative parse — this is just a soft guard so the field never shows
-    // letters (rules doc §2 "soft on input").
-    let next = value;
-    if (field === "mileage") next = value.replace(/\D/g, "");
-    else if (field === "price") next = value.replace(/[^\d.,]/g, "");
-    setValues((prev) => ({ ...prev, [field]: next }));
-    // Soft on-input: clear a showing error as the user types, but don't add new
-    // ones until blur (rules doc §2).
-    if (errors[field]) {
-      setErrors((prev) => omitError(prev, field));
-    }
-    setJustSaved(false);
-  }
+  function handleInput(field: Part1Field, value: string) {}
 
   function handleEnumChange(field: Part1Field, value: string) {

[NoCoverage] EqualityOperator
src/components/inspections/Part1Form.tsx:249:9
     // authoritative parse — this is just a soft guard so the field never shows
     // letters (rules doc §2 "soft on input").
     let next = value;
-    if (field === "mileage") next = value.replace(/\D/g, "");
+    if (field !== "mileage") next = value.replace(/\D/g, "");
     else if (field === "price") next = value.replace(/[^\d.,]/g, "");
     setValues((prev) => ({ ...prev, [field]: next }));

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:249:9
     // authoritative parse — this is just a soft guard so the field never shows
     // letters (rules doc §2 "soft on input").
     let next = value;
-    if (field === "mileage") next = value.replace(/\D/g, "");
+    if (true) next = value.replace(/\D/g, "");
     else if (field === "price") next = value.replace(/[^\d.,]/g, "");
     setValues((prev) => ({ ...prev, [field]: next }));

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:250:14
     // letters (rules doc §2 "soft on input").
     let next = value;
     if (field === "mileage") next = value.replace(/\D/g, "");
-    else if (field === "price") next = value.replace(/[^\d.,]/g, "");
+    else if (true) next = value.replace(/[^\d.,]/g, "");
     setValues((prev) => ({ ...prev, [field]: next }));
     // Soft on-input: clear a showing error as the user types, but don't add new

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:250:14
     // letters (rules doc §2 "soft on input").
     let next = value;
     if (field === "mileage") next = value.replace(/\D/g, "");
-    else if (field === "price") next = value.replace(/[^\d.,]/g, "");
+    else if (false) next = value.replace(/[^\d.,]/g, "");
     setValues((prev) => ({ ...prev, [field]: next }));
     // Soft on-input: clear a showing error as the user types, but don't add new

[NoCoverage] ArrowFunction
src/components/inspections/Part1Form.tsx:251:15
     let next = value;
     if (field === "mileage") next = value.replace(/\D/g, "");
     else if (field === "price") next = value.replace(/[^\d.,]/g, "");
-    setValues((prev) => ({ ...prev, [field]: next }));
+    setValues(() => undefined);
     // Soft on-input: clear a showing error as the user types, but don't add new
     // ones until blur (rules doc §2).

[NoCoverage] ObjectLiteral
src/components/inspections/Part1Form.tsx:251:26
     let next = value;
     if (field === "mileage") next = value.replace(/\D/g, "");
     else if (field === "price") next = value.replace(/[^\d.,]/g, "");
-    setValues((prev) => ({ ...prev, [field]: next }));
+    setValues((prev) => ({}));
     // Soft on-input: clear a showing error as the user types, but don't add new
     // ones until blur (rules doc §2).
