[NoCoverage] BlockStatement
src/components/auth/SubmitButton.tsx:11:82
   children: ReactNode;
 }
 
-export function SubmitButton({ pendingText, icon, children }: SubmitButtonProps) {
-  const { pending } = useFormStatus();
-
-  return (
-    <Button
-      type="submit"
-      disabled={pending}
-      className="w-full rounded-lg bg-purple-600 px-4 py-2 font-medium text-white transition-colors hover:bg-purple-500"
-    >
-      {pending ? (
-        <span className="flex items-center gap-2">
-          <span className="size-4 animate-spin rounded-full border-2 border-white/30 border-t-white" />
-          {pendingText}
-        </span>
-      ) : (
-        <span className="flex items-center gap-2">
-          {icon}
-          {children}
-        </span>
-      )}
-    </Button>
-  );
-}
+export function SubmitButton({ pendingText, icon, children }: SubmitButtonProps) {}
 
