[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:254:24
     setValues((prev) => ({ ...prev, [field]: next }));
     // Soft on-input: clear a showing error as the user types, but don't add new
     // ones until blur (rules doc §2).
-    if (errors[field]) {
-      setErrors((prev) => omitError(prev, field));
-    }
+    if (errors[field]) {}
     setJustSaved(false);
   }

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:254:9
     setValues((prev) => ({ ...prev, [field]: next }));
     // Soft on-input: clear a showing error as the user types, but don't add new
     // ones until blur (rules doc §2).
-    if (errors[field]) {
+    if (true) {
       setErrors((prev) => omitError(prev, field));
     }

[NoCoverage] ArrowFunction
src/components/inspections/Part1Form.tsx:255:17
     // Soft on-input: clear a showing error as the user types, but don't add new
     // ones until blur (rules doc §2).
     if (errors[field]) {
-      setErrors((prev) => omitError(prev, field));
+      setErrors(() => undefined);
     }
     setJustSaved(false);

[NoCoverage] BooleanLiteral
src/components/inspections/Part1Form.tsx:257:18
     if (errors[field]) {
       setErrors((prev) => omitError(prev, field));
     }
-    setJustSaved(false);
+    setJustSaved(true);
   }
 

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:260:63
     setJustSaved(false);
   }
 
-  function handleEnumChange(field: Part1Field, value: string) {
-    const next = { ...values, [field]: value };
-    // CF-1 guard at the UI: picking Electric clears a now-impossible Manual
-    // selection so the transmission dropdown (which hides Manual for Electric)
-    // never shows a stale, invalid value.
-    if (field === "fuelType" && value === "electric" && next.transmission === "manual") {
-      next.transmission = "";
-    }
-    setValues(next);
-    validateField(field, next);
-    setJustSaved(false);
-  }
+  function handleEnumChange(field: Part1Field, value: string) {}
 
   function handleBlur(field: Part1Field) {

[NoCoverage] ObjectLiteral
src/components/inspections/Part1Form.tsx:261:18
   }
 
   function handleEnumChange(field: Part1Field, value: string) {
-    const next = { ...values, [field]: value };
+    const next = {};
     // CF-1 guard at the UI: picking Electric clears a now-impossible Manual
     // selection so the transmission dropdown (which hides Manual for Electric)

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:265:89
     // CF-1 guard at the UI: picking Electric clears a now-impossible Manual
     // selection so the transmission dropdown (which hides Manual for Electric)
     // never shows a stale, invalid value.
-    if (field === "fuelType" && value === "electric" && next.transmission === "manual") {
-      next.transmission = "";
-    }
+    if (field === "fuelType" && value === "electric" && next.transmission === "manual") {}
     setValues(next);
     validateField(field, next);

[NoCoverage] EqualityOperator
src/components/inspections/Part1Form.tsx:265:33
     // CF-1 guard at the UI: picking Electric clears a now-impossible Manual
     // selection so the transmission dropdown (which hides Manual for Electric)
     // never shows a stale, invalid value.
-    if (field === "fuelType" && value === "electric" && next.transmission === "manual") {
+    if (field === "fuelType" && value !== "electric" && next.transmission === "manual") {
       next.transmission = "";
     }

[NoCoverage] BooleanLiteral
src/components/inspections/Part1Form.tsx:270:18
     }
     setValues(next);
     validateField(field, next);
-    setJustSaved(false);
+    setJustSaved(true);
   }
 

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:273:42
     setJustSaved(false);
   }
 
-  function handleBlur(field: Part1Field) {
-    // Text fields with a blur normalizer (make, model, registration, color,
-    // address, notes) update live so the input reflects exactly what will be saved.
-    const normalized = normalizeFieldOnBlur(field, values[field]);
-    if (normalized !== values[field]) {
-      const next = { ...values, [field]: normalized };
-      setValues(next);
-      validateField(field, next);
-      return;
-    }
-    validateField(field, values);
-  }
+  function handleBlur(field: Part1Field) {}
 
   async function handleSave() {

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:277:39
     // Text fields with a blur normalizer (make, model, registration, color,
     // address, notes) update live so the input reflects exactly what will be saved.
     const normalized = normalizeFieldOnBlur(field, values[field]);
-    if (normalized !== values[field]) {
-      const next = { ...values, [field]: normalized };
-      setValues(next);
-      validateField(field, next);
-      return;
-    }
+    if (normalized !== values[field]) {}
     validateField(field, values);
   }

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:277:9
     // Text fields with a blur normalizer (make, model, registration, color,
     // address, notes) update live so the input reflects exactly what will be saved.
     const normalized = normalizeFieldOnBlur(field, values[field]);
-    if (normalized !== values[field]) {
+    if (true) {
       const next = { ...values, [field]: normalized };
       setValues(next);

[NoCoverage] BooleanLiteral
src/components/inspections/Part1Form.tsx:288:9
 
   async function handleSave() {
     const result = validatePart1(values);
-    if (!result.ok) {
+    if (result.ok) {
       setErrors(result.errors);
       const firstInvalid = FIELD_ORDER.find((f) => result.errors[f]);

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:288:9
 
   async function handleSave() {
     const result = validatePart1(values);
-    if (!result.ok) {
+    if (true) {
       setErrors(result.errors);
       const firstInvalid = FIELD_ORDER.find((f) => result.errors[f]);

[NoCoverage] ArrowFunction
src/components/inspections/Part1Form.tsx:290:45
     const result = validatePart1(values);
     if (!result.ok) {
       setErrors(result.errors);
-      const firstInvalid = FIELD_ORDER.find((f) => result.errors[f]);
+      const firstInvalid = FIELD_ORDER.find(() => undefined);
       if (firstInvalid) {
         const el = refs.current[firstInvalid];

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:291:11
     if (!result.ok) {
       setErrors(result.errors);
       const firstInvalid = FIELD_ORDER.find((f) => result.errors[f]);
-      if (firstInvalid) {
+      if (false) {
         const el = refs.current[firstInvalid];
         el?.scrollIntoView({ behavior: "smooth", block: "center" });

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:291:11
     if (!result.ok) {
       setErrors(result.errors);
       const firstInvalid = FIELD_ORDER.find((f) => result.errors[f]);
-      if (firstInvalid) {
+      if (true) {
         const el = refs.current[firstInvalid];
         el?.scrollIntoView({ behavior: "smooth", block: "center" });

[NoCoverage] OptionalChaining
src/components/inspections/Part1Form.tsx:293:9
       const firstInvalid = FIELD_ORDER.find((f) => result.errors[f]);
       if (firstInvalid) {
         const el = refs.current[firstInvalid];
-        el?.scrollIntoView({ behavior: "smooth", block: "center" });
+        el.scrollIntoView({ behavior: "smooth", block: "center" });
         // `preventScroll` so the default focus jump doesn't cancel the smooth scroll.
         el?.focus({ preventScroll: true });

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:293:40
       const firstInvalid = FIELD_ORDER.find((f) => result.errors[f]);
       if (firstInvalid) {
         const el = refs.current[firstInvalid];
-        el?.scrollIntoView({ behavior: "smooth", block: "center" });
+        el?.scrollIntoView({ behavior: "", block: "center" });
         // `preventScroll` so the default focus jump doesn't cancel the smooth scroll.
         el?.focus({ preventScroll: true });

[NoCoverage] BooleanLiteral
src/components/inspections/Part1Form.tsx:295:36
         const el = refs.current[firstInvalid];
         el?.scrollIntoView({ behavior: "smooth", block: "center" });
         // `preventScroll` so the default focus jump doesn't cancel the smooth scroll.
-        el?.focus({ preventScroll: true });
+        el?.focus({ preventScroll: false });
       }
       return;

[NoCoverage] OptionalChaining
src/components/inspections/Part1Form.tsx:295:9
         const el = refs.current[firstInvalid];
         el?.scrollIntoView({ behavior: "smooth", block: "center" });
         // `preventScroll` so the default focus jump doesn't cancel the smooth scroll.
-        el?.focus({ preventScroll: true });
+        el.focus({ preventScroll: true });
       }
       return;

[NoCoverage] BooleanLiteral
src/components/inspections/Part1Form.tsx:300:15
       return;
     }
 
-    setSaving(true);
+    setSaving(false);
     setErrors({});
     setSaveError(null);

[NoCoverage] MethodExpression
src/components/inspections/Part1Form.tsx:305:22
     setSaveError(null);
     const config = result.config;
     // Tile title (FR-006): Make + Model, plus Year + Registration when present.
-    const autoName = [config.make, config.model, config.year, config.registrationNumber]
-      .filter((part) => part !== null && part !== "")
+    const autoName = [config.make, config.model, config.year, config.registrationNumber]
       .join(" ");
     try {

[NoCoverage] EqualityOperator
src/components/inspections/Part1Form.tsx:306:42
     const config = result.config;
     // Tile title (FR-006): Make + Model, plus Year + Registration when present.
     const autoName = [config.make, config.model, config.year, config.registrationNumber]
-      .filter((part) => part !== null && part !== "")
+      .filter((part) => part !== null && part === "")
       .join(" ");
     try {

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:306:42
     const config = result.config;
     // Tile title (FR-006): Make + Model, plus Year + Registration when present.
     const autoName = [config.make, config.model, config.year, config.registrationNumber]
-      .filter((part) => part !== null && part !== "")
+      .filter((part) => part !== null && true)
       .join(" ");
     try {

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:307:13
     // Tile title (FR-006): Make + Model, plus Year + Registration when present.
     const autoName = [config.make, config.model, config.year, config.registrationNumber]
       .filter((part) => part !== null && part !== "")
-      .join(" ");
+      .join("");
     try {
       // Preserve the original createdAt + status — the sync endpoint upserts both

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:308:9
     const autoName = [config.make, config.model, config.year, config.registrationNumber]
       .filter((part) => part !== null && part !== "")
       .join(" ");
-    try {
-      // Preserve the original createdAt + status — the sync endpoint upserts both
-      // explicitly with no protective trigger, so omitting them would clobber the
-      // creation timestamp and reset status to "draft".
-      await saveInspection({
-        id: inspection.id,
-        status: inspection.status,
-        createdAt: inspection.createdAt,
-        name: autoName,
-        ...config,
-        ...flags, // equipment flags commit together with the config (FR-014)
-      });
-      setName(autoName);
-      // Push the save to the server before navigating, so the session page's SSR load
-      // sees the saved config and unlocks. `flushQueue` is best-effort (a no-op when
-      // offline) and never throws, so we always continue to the hub afterwards.
-      await flushQueue();
-      window.location.assign(`/inspections/${inspection.id}/session`);
-      return; // navigating away — keep the button disabled (no `finally` reset needed)
-    } catch {
+    try {} catch {
       // The optimistic Dexie write failed (e.g. IndexedDB quota/blocked,
       // private browsing). Nothing was persisted — surface it so the user

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:327:13
       await flushQueue();
       window.location.assign(`/inspections/${inspection.id}/session`);
       return; // navigating away — keep the button disabled (no `finally` reset needed)
-    } catch {
-      // The optimistic Dexie write failed (e.g. IndexedDB quota/blocked,
-      // private browsing). Nothing was persisted — surface it so the user
-      // knows the save did not take, rather than silently resetting.
-      setSaveError("Could not save on this device. Please try again.");
-    } finally {
+    } catch {} finally {
       setSaving(false);
     }

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:332:15
       // private browsing). Nothing was persisted — surface it so the user
       // knows the save did not take, rather than silently resetting.
       setSaveError("Could not save on this device. Please try again.");
-    } finally {
-      setSaving(false);
-    }
+    } finally {}
   }
 

[NoCoverage] BooleanLiteral
src/components/inspections/Part1Form.tsx:333:17
       // knows the save did not take, rather than silently resetting.
       setSaveError("Could not save on this device. Please try again.");
     } finally {
-      setSaving(false);
+      setSaving(true);
     }
   }

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:339:64
 
   // A toggle only updates local form state — the equipment flags persist together with the
   // rest of Part 1 on Save (handleSave), consistent with every other field on this form.
-  function handleToggleFlag(column: FlagColumn, next: boolean) {
-    setFlags((prev) => ({ ...prev, [column]: next }));
-    setJustSaved(false);
-  }
+  function handleToggleFlag(column: FlagColumn, next: boolean) {}
 
   return (

[NoCoverage] ArrowFunction
src/components/inspections/Part1Form.tsx:340:14
   // A toggle only updates local form state — the equipment flags persist together with the
   // rest of Part 1 on Save (handleSave), consistent with every other field on this form.
   function handleToggleFlag(column: FlagColumn, next: boolean) {
-    setFlags((prev) => ({ ...prev, [column]: next }));
+    setFlags(() => undefined);
     setJustSaved(false);
   }

[NoCoverage] BooleanLiteral
src/components/inspections/Part1Form.tsx:341:18
   // rest of Part 1 on Save (handleSave), consistent with every other field on this form.
   function handleToggleFlag(column: FlagColumn, next: boolean) {
     setFlags((prev) => ({ ...prev, [column]: next }));
-    setJustSaved(false);
+    setJustSaved(true);
   }
 

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:348:17
     <div className="space-y-8">
       <header>
         <a
-          href={`/inspections/${inspection.id}/session`}
+          href={``}
           className="text-sm text-purple-300 transition-colors hover:text-purple-100 hover:underline"
         >

[NoCoverage] LogicalOperator
src/components/inspections/Part1Form.tsx:353:61
         >
           &larr; Back to session
         </a>
-        <h1 className="mt-4 text-2xl font-bold text-white">{name ?? "Inspection"}</h1>
+        <h1 className="mt-4 text-2xl font-bold text-white">{name && "Inspection"}</h1>
         <p className="mt-1 text-blue-100/60">
           Info about the car — fill in the required fields, then save to continue.

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:353:69
         >
           &larr; Back to session
         </a>
-        <h1 className="mt-4 text-2xl font-bold text-white">{name ?? "Inspection"}</h1>
+        <h1 className="mt-4 text-2xl font-bold text-white">{name ?? ""}</h1>
         <p className="mt-1 text-blue-100/60">
           Info about the car — fill in the required fields, then save to continue.

[NoCoverage] ArrowFunction
src/components/inspections/Part1Form.tsx:366:33
         <CardContent>
           <div className="grid gap-5 sm:grid-cols-2">
             {/* Notes is pulled out of the grid so the Equipment section can sit above it. */}
-            {FIELD_ORDER.filter((field) => field !== "notes").map((field) => {
+            {FIELD_ORDER.filter(() => undefined).map((field) => {
               const enumOptions = ENUM_OPTIONS[field];
               if (enumOptions) {

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:366:44
         <CardContent>
           <div className="grid gap-5 sm:grid-cols-2">
             {/* Notes is pulled out of the grid so the Equipment section can sit above it. */}
-            {FIELD_ORDER.filter((field) => field !== "notes").map((field) => {
+            {FIELD_ORDER.filter((field) => true).map((field) => {
               const enumOptions = ENUM_OPTIONS[field];
               if (enumOptions) {

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:368:19
             {/* Notes is pulled out of the grid so the Equipment section can sit above it. */}
             {FIELD_ORDER.filter((field) => field !== "notes").map((field) => {
               const enumOptions = ENUM_OPTIONS[field];
-              if (enumOptions) {
+              if (true) {
                 // Hide Manual when Electric is selected (CF-1 made unreachable in the UI).
                 const options =

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:368:19
             {/* Notes is pulled out of the grid so the Equipment section can sit above it. */}
             {FIELD_ORDER.filter((field) => field !== "notes").map((field) => {
               const enumOptions = ENUM_OPTIONS[field];
-              if (enumOptions) {
+              if (false) {
                 // Hide Manual when Electric is selected (CF-1 made unreachable in the UI).
                 const options =

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:371:47
               if (enumOptions) {
                 // Hide Manual when Electric is selected (CF-1 made unreachable in the UI).
                 const options =
-                  field === "transmission" && values.fuelType === "electric"
+                  field === "transmission" && true
                     ? enumOptions.filter(([key]) => key !== "manual")
                     : enumOptions;

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:371:19
               if (enumOptions) {
                 // Hide Manual when Electric is selected (CF-1 made unreachable in the UI).
                 const options =
-                  field === "transmission" && values.fuelType === "electric"
+                  true
                     ? enumOptions.filter(([key]) => key !== "manual")
                     : enumOptions;

[NoCoverage] MethodExpression
src/components/inspections/Part1Form.tsx:372:23
                 // Hide Manual when Electric is selected (CF-1 made unreachable in the UI).
                 const options =
                   field === "transmission" && values.fuelType === "electric"
-                    ? enumOptions.filter(([key]) => key !== "manual")
+                    ? enumOptions
                     : enumOptions;
                 return (

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:372:53
                 // Hide Manual when Electric is selected (CF-1 made unreachable in the UI).
                 const options =
                   field === "transmission" && values.fuelType === "electric"
-                    ? enumOptions.filter(([key]) => key !== "manual")
+                    ? enumOptions.filter(([key]) => false)
                     : enumOptions;
                 return (

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:382:38
                     error={errors[field]}
                     required={REQUIRED.has(field)}
                     options={options}
-                    onChange={(v) => {
-                      handleEnumChange(field, v);
-                    }}
+                    onChange={(v) => {}}
                     registerRef={(el) => {
                       refs.current[field] = el;

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:385:42
                     onChange={(v) => {
                       handleEnumChange(field, v);
                     }}
-                    registerRef={(el) => {
-                      refs.current[field] = el;
-                    }}
+                    registerRef={(el) => {}}
                   />
                 );

[NoCoverage] EqualityOperator
src/components/inspections/Part1Form.tsx:398:30
                   value={values[field]}
                   error={errors[field]}
                   required={REQUIRED.has(field)}
-                  multiline={field === "notes"}
+                  multiline={field !== "notes"}
                   inputModeHint={field === "mileage" ? "numeric" : field === "price" ? "decimal" : undefined}
                   onInput={(v) => {

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:398:30
                   value={values[field]}
                   error={errors[field]}
                   required={REQUIRED.has(field)}
-                  multiline={field === "notes"}
+                  multiline={false}
                   inputModeHint={field === "mileage" ? "numeric" : field === "price" ? "decimal" : undefined}
                   onInput={(v) => {

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:399:68
                   error={errors[field]}
                   required={REQUIRED.has(field)}
                   multiline={field === "notes"}
-                  inputModeHint={field === "mileage" ? "numeric" : field === "price" ? "decimal" : undefined}
+                  inputModeHint={field === "mileage" ? "numeric" : true ? "decimal" : undefined}
                   onInput={(v) => {
                     handleInput(field, v);

[NoCoverage] EqualityOperator
src/components/inspections/Part1Form.tsx:399:68
                   error={errors[field]}
                   required={REQUIRED.has(field)}
                   multiline={field === "notes"}
-                  inputModeHint={field === "mileage" ? "numeric" : field === "price" ? "decimal" : undefined}
+                  inputModeHint={field === "mileage" ? "numeric" : field !== "price" ? "decimal" : undefined}
                   onInput={(v) => {
                     handleInput(field, v);

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:400:35
                   required={REQUIRED.has(field)}
                   multiline={field === "notes"}
                   inputModeHint={field === "mileage" ? "numeric" : field === "price" ? "decimal" : undefined}
-                  onInput={(v) => {
-                    handleInput(field, v);
-                  }}
+                  onInput={(v) => {}}
                   onBlur={() => {
                     handleBlur(field);

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:403:33
                   onInput={(v) => {
                     handleInput(field, v);
                   }}
-                  onBlur={() => {
-                    handleBlur(field);
-                  }}
+                  onBlur={() => {}}
                   registerRef={(el) => {
                     refs.current[field] = el;

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:426:31
               error={errors.notes}
               required={REQUIRED.has("notes")}
               multiline
-              onInput={(v) => {
-                handleInput("notes", v);
-              }}
+              onInput={(v) => {}}
               onBlur={() => {
                 handleBlur("notes");

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:429:29
               onInput={(v) => {
                 handleInput("notes", v);
               }}
-              onBlur={() => {
-                handleBlur("notes");
-              }}
+              onBlur={() => {}}
               registerRef={(el) => {
                 refs.current.notes = el;

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:432:36
               onBlur={() => {
                 handleBlur("notes");
               }}
-              registerRef={(el) => {
-                refs.current.notes = el;
-              }}
+              registerRef={(el) => {}}
             />
           </div>

[NoCoverage] ArrowFunction
src/components/inspections/Part1Form.tsx:439:44
           </div>
 
           <div className="mt-6 flex items-center gap-3">
-            <Button type="button" onClick={() => void handleSave()} disabled={saving} className={PRIMARY_BTN}>
+            <Button type="button" onClick={() => undefined} disabled={saving} className={PRIMARY_BTN}>
               {saving ? "Saving…" : "Save Part 1"}
             </Button>

[NoCoverage] LogicalOperator
src/components/inspections/Part1Form.tsx:442:14
             <Button type="button" onClick={() => void handleSave()} disabled={saving} className={PRIMARY_BTN}>
               {saving ? "Saving…" : "Save Part 1"}
             </Button>
-            {justSaved && <span className="text-sm text-emerald-300">Saved.</span>}
+            {justSaved || <span className="text-sm text-emerald-300">Saved.</span>}
           </div>
           {saveError && (

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:442:14
             <Button type="button" onClick={() => void handleSave()} disabled={saving} className={PRIMARY_BTN}>
               {saving ? "Saving…" : "Save Part 1"}
             </Button>
-            {justSaved && <span className="text-sm text-emerald-300">Saved.</span>}
+            {true}
           </div>
           {saveError && (

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:444:12
             </Button>
             {justSaved && <span className="text-sm text-emerald-300">Saved.</span>}
           </div>
-          {saveError && (
-            <div className="mt-4">
-              <ServerError message={saveError} />
-            </div>
-          )}
+          {true}
         </CardContent>
       </Card>

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:444:12
             </Button>
             {justSaved && <span className="text-sm text-emerald-300">Saved.</span>}
           </div>
-          {saveError && (
-            <div className="mt-4">
-              <ServerError message={saveError} />
-            </div>
-          )}
+          {false}
         </CardContent>
       </Card>

[NoCoverage] StringLiteral
src/components/inspections/Part1Form.tsx:479:33
   registerRef,
 }: TextRowProps) {
   return (
-    <div className={multiline ? "sm:col-span-2" : undefined}>
+    <div className={multiline ? "" : undefined}>
       <Label htmlFor={field} className="mb-1 text-blue-100/80">
         {LABELS[field]}

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:482:10
     <div className={multiline ? "sm:col-span-2" : undefined}>
       <Label htmlFor={field} className="mb-1 text-blue-100/80">
         {LABELS[field]}
-        {required && <span className="text-red-300"> *</span>}
+        {false}
       </Label>
       {multiline ? (

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:482:10
     <div className={multiline ? "sm:col-span-2" : undefined}>
       <Label htmlFor={field} className="mb-1 text-blue-100/80">
         {LABELS[field]}
-        {required && <span className="text-red-300"> *</span>}
+        {true}
       </Label>
       {multiline ? (

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:487:24
       {multiline ? (
         <textarea
           id={field}
-          ref={(el) => {
-            registerRef(el);
-          }}
+          ref={(el) => {}}
           value={value}
           onChange={(e) => {

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:491:28
             registerRef(el);
           }}
           value={value}
-          onChange={(e) => {
-            onInput(e.target.value);
-          }}
+          onChange={(e) => {}}
           onBlur={onBlur}
           rows={3}

[NoCoverage] BooleanLiteral
src/components/inspections/Part1Form.tsx:496:33
           }}
           onBlur={onBlur}
           rows={3}
-          aria-invalid={error ? true : undefined}
+          aria-invalid={error ? false : undefined}
           className={`flex w-full rounded-md border px-3 py-2 text-sm shadow-xs outline-none focus-visible:ring-[3px] focus-visible:ring-purple-400/50 ${FIELD_INPUT}`}
         />

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:507:28
           }}
           value={value}
           inputMode={inputModeHint}
-          onChange={(e) => {
-            onInput(e.target.value);
-          }}
+          onChange={(e) => {}}
           onBlur={onBlur}
           aria-invalid={error ? true : undefined}

[NoCoverage] BooleanLiteral
src/components/inspections/Part1Form.tsx:511:33
             onInput(e.target.value);
           }}
           onBlur={onBlur}
-          aria-invalid={error ? true : undefined}
+          aria-invalid={error ? false : undefined}
           className={FIELD_INPUT}
         />

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:515:8
           className={FIELD_INPUT}
         />
       )}
-      {error && <FieldError message={error} />}
+      {false}
     </div>
   );
