[NoCoverage] LogicalOperator
src/components/inspections/Part1Form.tsx:515:8
           className={FIELD_INPUT}
         />
       )}
-      {error && <FieldError message={error} />}
+      {error || <FieldError message={error} />}
     </div>
   );

[NoCoverage] BooleanLiteral
src/components/inspections/Part1Form.tsx:543:33
           ref={(el) => {
             registerRef(el);
           }}
-          aria-invalid={error ? true : undefined}
+          aria-invalid={error ? false : undefined}
           className={`w-full ${FIELD_INPUT}`}
         >

[NoCoverage] ArrowFunction
src/components/inspections/Part1Form.tsx:549:24
           <SelectValue placeholder="Select…" />
         </SelectTrigger>
         <SelectContent>
-          {options.map(([key, display]) => (
-            <SelectItem key={key} value={key}>
-              {display}
-            </SelectItem>
-          ))}
+          {options.map(() => undefined)}
         </SelectContent>
       </Select>

[NoCoverage] LogicalOperator
src/components/inspections/Part1Form.tsx:556:8
           ))}
         </SelectContent>
       </Select>
-      {error && <FieldError message={error} />}
+      {error || <FieldError message={error} />}
     </div>
   );

[NoCoverage] ConditionalExpression
src/components/inspections/Part1Form.tsx:556:8
           ))}
         </SelectContent>
       </Select>
-      {error && <FieldError message={error} />}
+      {false}
     </div>
   );

[NoCoverage] BlockStatement
src/components/inspections/Part1Form.tsx:561:55
   );
 }
 
-function FieldError({ message }: { message: string }) {
-  return (
-    <p className="mt-1 flex items-center gap-1 text-xs text-red-300">
-      <CircleAlert className="size-3 shrink-0" />
-      {message}
-    </p>
-  );
-}
+function FieldError({ message }: { message: string }) {}
 
