[NoCoverage] BlockStatement
pages/api/auth/signin.ts:4:50
 import type { APIRoute } from "astro";
 import { createClient } from "@/lib/supabase";
 
-export const POST: APIRoute = async (context) => {
-  const form = await context.request.formData();
-  const email = form.get("email") as string;
-  const password = form.get("password") as string;
-
-  const supabase = createClient(context.request.headers, context.cookies);
-  if (!supabase) {
-    return context.redirect(`/auth/signin?error=${encodeURIComponent("Supabase is not configured")}`);
-  }
-  const { error } = await supabase.auth.signInWithPassword({ email, password });
-
-  if (error) {
-    return context.redirect(`/auth/signin?error=${encodeURIComponent(error.message)}`);
-  }
-
-  return context.redirect("/");
-};
+export const POST: APIRoute = async (context) => {};
 

[NoCoverage] BlockStatement
pages/api/auth/signin.ts:10:18
   const password = form.get("password") as string;
 
   const supabase = createClient(context.request.headers, context.cookies);
-  if (!supabase) {
-    return context.redirect(`/auth/signin?error=${encodeURIComponent("Supabase is not configured")}`);
-  }
+  if (!supabase) {}
   const { error } = await supabase.auth.signInWithPassword({ email, password });
 

[NoCoverage] ConditionalExpression
pages/api/auth/signin.ts:10:7
   const password = form.get("password") as string;
 
   const supabase = createClient(context.request.headers, context.cookies);
-  if (!supabase) {
+  if (false) {
     return context.redirect(`/auth/signin?error=${encodeURIComponent("Supabase is not configured")}`);
   }

[NoCoverage] BlockStatement
pages/api/auth/signin.ts:15:14
   }
   const { error } = await supabase.auth.signInWithPassword({ email, password });
 
-  if (error) {
-    return context.redirect(`/auth/signin?error=${encodeURIComponent(error.message)}`);
-  }
+  if (error) {}
 
   return context.redirect("/");

[NoCoverage] StringLiteral
pages/api/auth/signin.ts:19:27
     return context.redirect(`/auth/signin?error=${encodeURIComponent(error.message)}`);
   }
 
-  return context.redirect("/");
+  return context.redirect("");
 };
 
