[NoCoverage] BlockStatement
pages/api/auth/signout.ts:4:50
 import type { APIRoute } from "astro";
 import { createClient } from "@/lib/supabase";
 
-export const POST: APIRoute = async (context) => {
-  const supabase = createClient(context.request.headers, context.cookies);
-  if (supabase) {
-    await supabase.auth.signOut();
-  }
-  return context.redirect("/");
-};
+export const POST: APIRoute = async (context) => {};
 

[NoCoverage] ConditionalExpression
pages/api/auth/signout.ts:6:7
 
 export const POST: APIRoute = async (context) => {
   const supabase = createClient(context.request.headers, context.cookies);
-  if (supabase) {
+  if (false) {
     await supabase.auth.signOut();
   }

[NoCoverage] BlockStatement
pages/api/auth/signout.ts:6:17
 
 export const POST: APIRoute = async (context) => {
   const supabase = createClient(context.request.headers, context.cookies);
-  if (supabase) {
-    await supabase.auth.signOut();
-  }
+  if (supabase) {}
   return context.redirect("/");
 };
