[NoCoverage] StringLiteral
src/components/inspections/SessionScreen.tsx:25:15
 import type { RelevantToggle, RuntimeFlag } from "@/lib/questions";
 
 // Cosmic glass palette — matches Part1Form / the dashboard shell.
-const PANEL = "border-white/10 bg-white/5 text-white backdrop-blur-xl";
+const PANEL = "";
 const FIELD_INPUT = "border-white/20 bg-white/10 text-white placeholder:text-white/40";
 

[NoCoverage] StringLiteral
src/components/inspections/SessionScreen.tsx:31:24
 // FR-010: the global notes document is a distinct 10,000-char inspection-level doc
 // (separate from the 1,000-char Part 1 `notes`). Enforced app-side (mirrors Part 1).
 const MAX_NOTES = 10_000;
-const NOTES_TOO_LONG = "Global notes cannot be longer than 10,000 characters.";
+const NOTES_TOO_LONG = "";
 
 // Debounce window for persisting notes edits through the outbox.

[NoCoverage] ArrowFunction
src/components/inspections/SessionScreen.tsx:74:13
   const [saveStatus, setSaveStatus] = useState<SaveStatus>("idle");
 
   // Drain the outbox for this session (same resilient triggers as Part1Form).
-  useEffect(() => startAutoSync(), []);
+  useEffect(() => undefined, []);
 
   const liveRow = useLiveQuery(() => db.inspections.get(inspection.id), [inspection.id]);

[NoCoverage] ArrayDeclaration
src/components/inspections/SessionScreen.tsx:74:36
   const [saveStatus, setSaveStatus] = useState<SaveStatus>("idle");
 
   // Drain the outbox for this session (same resilient triggers as Part1Form).
-  useEffect(() => startAutoSync(), []);
+  useEffect(() => startAutoSync(), ["Stryker was here"]);
 
   const liveRow = useLiveQuery(() => db.inspections.get(inspection.id), [inspection.id]);

[NoCoverage] ArrowFunction
src/components/inspections/SessionScreen.tsx:76:32
   // Drain the outbox for this session (same resilient triggers as Part1Form).
   useEffect(() => startAutoSync(), []);
 
-  const liveRow = useLiveQuery(() => db.inspections.get(inspection.id), [inspection.id]);
+  const liveRow = useLiveQuery(() => undefined, [inspection.id]);
   const persisted = liveRow?.globalNotes ?? inspection.globalNotes ?? "";
   const notes = draft ?? persisted;

[NoCoverage] ArrayDeclaration
src/components/inspections/SessionScreen.tsx:76:73
   // Drain the outbox for this session (same resilient triggers as Part1Form).
   useEffect(() => startAutoSync(), []);
 
-  const liveRow = useLiveQuery(() => db.inspections.get(inspection.id), [inspection.id]);
+  const liveRow = useLiveQuery(() => db.inspections.get(inspection.id), []);
   const persisted = liveRow?.globalNotes ?? inspection.globalNotes ?? "";
   const notes = draft ?? persisted;

[NoCoverage] OptionalChaining
src/components/inspections/SessionScreen.tsx:77:21
   useEffect(() => startAutoSync(), []);
 
   const liveRow = useLiveQuery(() => db.inspections.get(inspection.id), [inspection.id]);
-  const persisted = liveRow?.globalNotes ?? inspection.globalNotes ?? "";
+  const persisted = liveRow.globalNotes ?? inspection.globalNotes ?? "";
   const notes = draft ?? persisted;
   const overLimit = notes.length > MAX_NOTES;

[NoCoverage] LogicalOperator
src/components/inspections/SessionScreen.tsx:77:21
   useEffect(() => startAutoSync(), []);
 
   const liveRow = useLiveQuery(() => db.inspections.get(inspection.id), [inspection.id]);
-  const persisted = liveRow?.globalNotes ?? inspection.globalNotes ?? "";
+  const persisted = (liveRow?.globalNotes ?? inspection.globalNotes) && "";
   const notes = draft ?? persisted;
   const overLimit = notes.length > MAX_NOTES;

[NoCoverage] LogicalOperator
src/components/inspections/SessionScreen.tsx:78:17
 
   const liveRow = useLiveQuery(() => db.inspections.get(inspection.id), [inspection.id]);
   const persisted = liveRow?.globalNotes ?? inspection.globalNotes ?? "";
-  const notes = draft ?? persisted;
+  const notes = draft && persisted;
   const overLimit = notes.length > MAX_NOTES;
 

[NoCoverage] ConditionalExpression
src/components/inspections/SessionScreen.tsx:79:21
   const liveRow = useLiveQuery(() => db.inspections.get(inspection.id), [inspection.id]);
   const persisted = liveRow?.globalNotes ?? inspection.globalNotes ?? "";
   const notes = draft ?? persisted;
-  const overLimit = notes.length > MAX_NOTES;
+  const overLimit = false;
 
   // Debounced persist via the read-merge `saveInspection` — a sparse `{ id, globalNotes }`

[NoCoverage] EqualityOperator
src/components/inspections/SessionScreen.tsx:79:21
   const liveRow = useLiveQuery(() => db.inspections.get(inspection.id), [inspection.id]);
   const persisted = liveRow?.globalNotes ?? inspection.globalNotes ?? "";
   const notes = draft ?? persisted;
-  const overLimit = notes.length > MAX_NOTES;
+  const overLimit = notes.length >= MAX_NOTES;
 
   // Debounced persist via the read-merge `saveInspection` — a sparse `{ id, globalNotes }`

[NoCoverage] BlockStatement
src/components/inspections/SessionScreen.tsx:85:19
   // update that preserves the Part 1 config it never re-sends (Phase 2 §3). Runs only once
   // the user has edited (`draft !== null`) and the value is within the limit. All setState
   // happens inside the (async) timeout, never synchronously in the effect body.
-  useEffect(() => {
-    if (draft === null || overLimit) return;
-    const timer = setTimeout(() => {
-      setSaveStatus("saving");
-      void saveInspection({ id: inspection.id, globalNotes: draft }).then(
-        () => {
-          setSaveStatus("saved");
-          void flushQueue();
-        },
-        () => {
-          setSaveStatus("error");
-        },
-      );
-    }, SAVE_DEBOUNCE_MS);
-    return () => {
-      clearTimeout(timer);
-    };
-  }, [draft, overLimit, inspection.id]);
+  useEffect(() => {}, [draft, overLimit, inspection.id]);
 
   function handleNotesChange(value: string) {

[NoCoverage] EqualityOperator
src/components/inspections/SessionScreen.tsx:86:9
   // the user has edited (`draft !== null`) and the value is within the limit. All setState
   // happens inside the (async) timeout, never synchronously in the effect body.
   useEffect(() => {
-    if (draft === null || overLimit) return;
+    if (draft !== null || overLimit) return;
     const timer = setTimeout(() => {
       setSaveStatus("saving");

[NoCoverage] LogicalOperator
src/components/inspections/SessionScreen.tsx:86:9
   // the user has edited (`draft !== null`) and the value is within the limit. All setState
   // happens inside the (async) timeout, never synchronously in the effect body.
   useEffect(() => {
-    if (draft === null || overLimit) return;
+    if (draft === null && overLimit) return;
     const timer = setTimeout(() => {
       setSaveStatus("saving");

[NoCoverage] BlockStatement
src/components/inspections/SessionScreen.tsx:87:36
   // happens inside the (async) timeout, never synchronously in the effect body.
   useEffect(() => {
     if (draft === null || overLimit) return;
-    const timer = setTimeout(() => {
-      setSaveStatus("saving");
-      void saveInspection({ id: inspection.id, globalNotes: draft }).then(
-        () => {
-          setSaveStatus("saved");
-          void flushQueue();
-        },
-        () => {
-          setSaveStatus("error");
-        },
-      );
-    }, SAVE_DEBOUNCE_MS);
+    const timer = setTimeout(() => {}, SAVE_DEBOUNCE_MS);
     return () => {
       clearTimeout(timer);

[NoCoverage] ObjectLiteral
src/components/inspections/SessionScreen.tsx:89:27
     if (draft === null || overLimit) return;
     const timer = setTimeout(() => {
       setSaveStatus("saving");
-      void saveInspection({ id: inspection.id, globalNotes: draft }).then(
+      void saveInspection({}).then(
         () => {
           setSaveStatus("saved");

[NoCoverage] BlockStatement
src/components/inspections/SessionScreen.tsx:90:15
     const timer = setTimeout(() => {
       setSaveStatus("saving");
       void saveInspection({ id: inspection.id, globalNotes: draft }).then(
-        () => {
-          setSaveStatus("saved");
-          void flushQueue();
-        },
+        () => {},
         () => {
           setSaveStatus("error");

[NoCoverage] StringLiteral
src/components/inspections/SessionScreen.tsx:91:25
       setSaveStatus("saving");
       void saveInspection({ id: inspection.id, globalNotes: draft }).then(
         () => {
-          setSaveStatus("saved");
+          setSaveStatus("");
           void flushQueue();
         },

[NoCoverage] BlockStatement
src/components/inspections/SessionScreen.tsx:94:15
           setSaveStatus("saved");
           void flushQueue();
         },
-        () => {
-          setSaveStatus("error");
-        },
+        () => {},
       );
     }, SAVE_DEBOUNCE_MS);

[NoCoverage] BlockStatement
src/components/inspections/SessionScreen.tsx:99:18
         },
       );
     }, SAVE_DEBOUNCE_MS);
-    return () => {
-      clearTimeout(timer);
-    };
+    return () => {};
   }, [draft, overLimit, inspection.id]);
 

[NoCoverage] BlockStatement
src/components/inspections/SessionScreen.tsx:104:45
     };
   }, [draft, overLimit, inspection.id]);
 
-  function handleNotesChange(value: string) {
-    setDraft(value);
-  }
+  function handleNotesChange(value: string) {}
 
   // The active-flag set is DERIVED from the persisted flag columns (the live Dexie row,

[NoCoverage] LogicalOperator
src/components/inspections/SessionScreen.tsx:113:19
   // synced — reflects here via `useLiveQuery` without a server round-trip, and a reload
   // re-hydrates the same set. The bindings carry the column↔flag map (e.g. importedFromEu →
   // importedFromEU) since the catalogue itself never reaches this island.
-  const flagRow = liveRow ?? inspection;
+  const flagRow = liveRow && inspection;
   const activeFlags = new Set<RuntimeFlag>();
   for (const t of flagBindings) if (flagRow[t.column]) activeFlags.add(t.flag);

[NoCoverage] ConditionalExpression
src/components/inspections/SessionScreen.tsx:115:37
   // importedFromEU) since the catalogue itself never reaches this island.
   const flagRow = liveRow ?? inspection;
   const activeFlags = new Set<RuntimeFlag>();
-  for (const t of flagBindings) if (flagRow[t.column]) activeFlags.add(t.flag);
+  for (const t of flagBindings) if (true) activeFlags.add(t.flag);
 
   // Live per-Part counts + Total Score / completion denominator, recomputed from the server

[NoCoverage] ConditionalExpression
src/components/inspections/SessionScreen.tsx:115:37
   // importedFromEU) since the catalogue itself never reaches this island.
   const flagRow = liveRow ?? inspection;
   const activeFlags = new Set<RuntimeFlag>();
-  for (const t of flagBindings) if (flagRow[t.column]) activeFlags.add(t.flag);
+  for (const t of flagBindings) if (false) activeFlags.add(t.flag);
 
   // Live per-Part counts + Total Score / completion denominator, recomputed from the server

[NoCoverage] StringLiteral
src/components/inspections/SessionScreen.tsx:125:20
   // Part names + order are the PRD's five parts (prd.md:56) — the real-world physical
   // inspection order (Info → Standstill → Engine → Drive → Documents; prd.md:194).
   const parts = [
-    { n: 1, title: "Info", count: null as number | null },
+    { n: 1, title: "", count: null as number | null },
     { n: 2, title: "Standstill", count: liveCounts.part2 },
     { n: 3, title: "Engine", count: liveCounts.part3 },

[NoCoverage] StringLiteral
src/components/inspections/SessionScreen.tsx:126:20
   // inspection order (Info → Standstill → Engine → Drive → Documents; prd.md:194).
   const parts = [
     { n: 1, title: "Info", count: null as number | null },
-    { n: 2, title: "Standstill", count: liveCounts.part2 },
+    { n: 2, title: "", count: liveCounts.part2 },
     { n: 3, title: "Engine", count: liveCounts.part3 },
     { n: 4, title: "Drive", count: liveCounts.part4 },

[NoCoverage] StringLiteral
src/components/inspections/SessionScreen.tsx:127:20
   const parts = [
     { n: 1, title: "Info", count: null as number | null },
     { n: 2, title: "Standstill", count: liveCounts.part2 },
-    { n: 3, title: "Engine", count: liveCounts.part3 },
+    { n: 3, title: "", count: liveCounts.part3 },
     { n: 4, title: "Drive", count: liveCounts.part4 },
     { n: 5, title: "Documents", count: liveCounts.part5 },

[NoCoverage] ObjectLiteral
src/components/inspections/SessionScreen.tsx:127:5
   const parts = [
     { n: 1, title: "Info", count: null as number | null },
     { n: 2, title: "Standstill", count: liveCounts.part2 },
-    { n: 3, title: "Engine", count: liveCounts.part3 },
+    {},
     { n: 4, title: "Drive", count: liveCounts.part4 },
     { n: 5, title: "Documents", count: liveCounts.part5 },

[NoCoverage] LogicalOperator
src/components/inspections/SessionScreen.tsx:141:61
         >
           &larr; Back to dashboard
         </a>
-        <h1 className="mt-4 text-2xl font-bold text-white">{inspection.name ?? "Inspection"}</h1>
+        <h1 className="mt-4 text-2xl font-bold text-white">{inspection.name && "Inspection"}</h1>
         <p className="mt-1 text-blue-100/60">
           Your inspection session — pick a part to work on, or jot global notes below.

[NoCoverage] StringLiteral
src/components/inspections/SessionScreen.tsx:141:80
         >
           &larr; Back to dashboard
         </a>
-        <h1 className="mt-4 text-2xl font-bold text-white">{inspection.name ?? "Inspection"}</h1>
+        <h1 className="mt-4 text-2xl font-bold text-white">{inspection.name ?? ""}</h1>
         <p className="mt-1 text-blue-100/60">
           Your inspection session — pick a part to work on, or jot global notes below.

[NoCoverage] BooleanLiteral
src/components/inspections/SessionScreen.tsx:152:47
             until Part 1 is valid, with an overlay explaining how to reveal them. */}
         <div
           className={`grid gap-4 sm:grid-cols-2 ${unlocked ? "" : "pointer-events-none blur-sm select-none"}`}
-          aria-hidden={unlocked ? undefined : true}
+          aria-hidden={unlocked ? undefined : false}
         >
           <Card className={PANEL}>

[NoCoverage] LogicalOperator
src/components/inspections/SessionScreen.tsx:180:10
             </CardContent>
           </Card>
         </div>
-        {!unlocked && (
-          <div className="absolute inset-0 flex items-center justify-center p-4">
-            <div className="flex items-center gap-2 rounded-lg border border-white/15 bg-black/40 px-4 py-3 text-center text-sm text-blue-100/80 backdrop-blur-sm">
-              <Lock className="size-4 shrink-0 text-blue-100/60" />
-              Complete Part 1 (Info) to reveal the Total Score and Completion.
-            </div>
-          </div>
-        )}
+        {!unlocked || <div className="absolute inset-0 flex items-center justify-center p-4">
+            <div className="flex items-center gap-2 rounded-lg border border-white/15 bg-black/40 px-4 py-3 text-center text-sm text-blue-100/80 backdrop-blur-sm">
+              <Lock className="size-4 shrink-0 text-blue-100/60" />
+              Complete Part 1 (Info) to reveal the Total Score and Completion.
+            </div>
+          </div>}
       </div>
 

[NoCoverage] BooleanLiteral
src/components/inspections/SessionScreen.tsx:180:10
             </CardContent>
           </Card>
         </div>
-        {!unlocked && (
+        {unlocked && (
           <div className="absolute inset-0 flex items-center justify-center p-4">
             <div className="flex items-center gap-2 rounded-lg border border-white/15 bg-black/40 px-4 py-3 text-center text-sm text-blue-100/80 backdrop-blur-sm">

[NoCoverage] StringLiteral
src/components/inspections/SessionScreen.tsx:190:27
         )}
       </div>
 
-      <section className={`rounded-xl border p-5 ${PANEL}`}>
+      <section className={``}>
         <div className="mb-3 flex items-center gap-2">
           <h2 className="text-lg font-semibold text-white">Parts</h2>

[NoCoverage] BooleanLiteral
src/components/inspections/SessionScreen.tsx:193:12
       <section className={`rounded-xl border p-5 ${PANEL}`}>
         <div className="mb-3 flex items-center gap-2">
           <h2 className="text-lg font-semibold text-white">Parts</h2>
-          {!unlocked && <Lock className="size-4 text-blue-100/50" />}
+          {unlocked && <Lock className="size-4 text-blue-100/50" />}
         </div>
         {!unlocked && (

[NoCoverage] LogicalOperator
src/components/inspections/SessionScreen.tsx:193:12
       <section className={`rounded-xl border p-5 ${PANEL}`}>
         <div className="mb-3 flex items-center gap-2">
           <h2 className="text-lg font-semibold text-white">Parts</h2>
-          {!unlocked && <Lock className="size-4 text-blue-100/50" />}
+          {!unlocked || <Lock className="size-4 text-blue-100/50" />}
         </div>
         {!unlocked && (

[NoCoverage] ConditionalExpression
src/components/inspections/SessionScreen.tsx:195:10
           <h2 className="text-lg font-semibold text-white">Parts</h2>
           {!unlocked && <Lock className="size-4 text-blue-100/50" />}
         </div>
-        {!unlocked && (
-          <p className="mb-4 text-sm text-blue-100/60">Complete Part 1 (Info) to unlock the personalized Parts 2–5.</p>
-        )}
+        {false}
         <div className="grid gap-3 sm:grid-cols-2 lg:grid-cols-3">
           {parts.map((p) => {

[NoCoverage] ConditionalExpression
src/components/inspections/SessionScreen.tsx:195:10
           <h2 className="text-lg font-semibold text-white">Parts</h2>
           {!unlocked && <Lock className="size-4 text-blue-100/50" />}
         </div>
-        {!unlocked && (
-          <p className="mb-4 text-sm text-blue-100/60">Complete Part 1 (Info) to unlock the personalized Parts 2–5.</p>
-        )}
+        {true}
         <div className="grid gap-3 sm:grid-cols-2 lg:grid-cols-3">
           {parts.map((p) => {

[NoCoverage] LogicalOperator
src/components/inspections/SessionScreen.tsx:202:28
           {parts.map((p) => {
             // Part 1 (Info) is always reachable — it's where the config is made valid.
             // Parts 2–5 are locked (non-navigable) until the config is unlocked.
-            const locked = p.n !== 1 && !unlocked;
+            const locked = p.n !== 1 || !unlocked;
             const subtitle =
               p.count === null

[NoCoverage] ConditionalExpression
src/components/inspections/SessionScreen.tsx:202:28
           {parts.map((p) => {
             // Part 1 (Info) is always reachable — it's where the config is made valid.
             // Parts 2–5 are locked (non-navigable) until the config is unlocked.
-            const locked = p.n !== 1 && !unlocked;
+            const locked = true;
             const subtitle =
               p.count === null

[NoCoverage] ConditionalExpression
src/components/inspections/SessionScreen.tsx:204:15
             // Parts 2–5 are locked (non-navigable) until the config is unlocked.
             const locked = p.n !== 1 && !unlocked;
             const subtitle =
-              p.count === null
+              false
                 ? "Edit configuration"
                 : `${String(p.count)} ${p.count === 1 ? "question" : "questions"}`;

[NoCoverage] EqualityOperator
src/components/inspections/SessionScreen.tsx:204:15
             // Parts 2–5 are locked (non-navigable) until the config is unlocked.
             const locked = p.n !== 1 && !unlocked;
             const subtitle =
-              p.count === null
+              p.count !== null
                 ? "Edit configuration"
                 : `${String(p.count)} ${p.count === 1 ? "question" : "questions"}`;

[NoCoverage] EqualityOperator
src/components/inspections/SessionScreen.tsx:206:41
             const subtitle =
               p.count === null
                 ? "Edit configuration"
-                : `${String(p.count)} ${p.count === 1 ? "question" : "questions"}`;
+                : `${String(p.count)} ${p.count !== 1 ? "question" : "questions"}`;
 
             if (locked) {

[NoCoverage] ConditionalExpression
src/components/inspections/SessionScreen.tsx:206:41
             const subtitle =
               p.count === null
                 ? "Edit configuration"
-                : `${String(p.count)} ${p.count === 1 ? "question" : "questions"}`;
+                : `${String(p.count)} ${true ? "question" : "questions"}`;
 
             if (locked) {

[NoCoverage] ConditionalExpression
src/components/inspections/SessionScreen.tsx:208:17
                 ? "Edit configuration"
                 : `${String(p.count)} ${p.count === 1 ? "question" : "questions"}`;
 
-            if (locked) {
+            if (false) {
               return (
                 <div key={p.n} aria-disabled className="rounded-lg border border-white/10 bg-white/5 p-4 opacity-50">

[NoCoverage] BlockStatement
src/components/inspections/SessionScreen.tsx:208:25
                 ? "Edit configuration"
                 : `${String(p.count)} ${p.count === 1 ? "question" : "questions"}`;
 
-            if (locked) {
-              return (
-                <div key={p.n} aria-disabled className="rounded-lg border border-white/10 bg-white/5 p-4 opacity-50">
-                  <p className="text-xs tracking-wider text-blue-100/40 uppercase">Part {p.n}</p>
-                  <p className="mt-1 font-medium text-white">{p.title}</p>
-                  <p className="mt-2 text-sm text-blue-100/60">Locked</p>
-                </div>
-              );
-            }
+            if (locked) {}
             return (
               <a

[NoCoverage] BlockStatement
src/components/inspections/SessionScreen.tsx:240:30
           <textarea
             id="globalNotes"
             value={notes}
-            onChange={(e) => {
-              handleNotesChange(e.target.value);
-            }}
+            onChange={(e) => {}}
             rows={8}
             aria-invalid={overLimit ? true : undefined}

[NoCoverage] BooleanLiteral
src/components/inspections/SessionScreen.tsx:244:39
               handleNotesChange(e.target.value);
             }}
             rows={8}
-            aria-invalid={overLimit ? true : undefined}
+            aria-invalid={overLimit ? false : undefined}
             placeholder="Notes about the whole inspection…"
             className={`flex w-full rounded-md border px-3 py-2 text-sm shadow-xs outline-none focus-visible:ring-[3px] focus-visible:ring-purple-400/50 ${FIELD_INPUT}`}

[NoCoverage] StringLiteral
src/components/inspections/SessionScreen.tsx:246:24
             rows={8}
             aria-invalid={overLimit ? true : undefined}
             placeholder="Notes about the whole inspection…"
-            className={`flex w-full rounded-md border px-3 py-2 text-sm shadow-xs outline-none focus-visible:ring-[3px] focus-visible:ring-purple-400/50 ${FIELD_INPUT}`}
+            className={``}
           />
           <div className="mt-1 flex items-center justify-between text-xs">

[NoCoverage] ConditionalExpression
src/components/inspections/SessionScreen.tsx:256:18
               </span>
             ) : (
               <span className="text-blue-100/40">
-                {saveStatus === "saving" && "Saving…"}
+                {true}
                 {saveStatus === "saved" && "Saved."}
                 {saveStatus === "error" && <span className="text-red-300">Could not save on this device.</span>}

[NoCoverage] ConditionalExpression
src/components/inspections/SessionScreen.tsx:256:18
               </span>
             ) : (
               <span className="text-blue-100/40">
-                {saveStatus === "saving" && "Saving…"}
+                {true && "Saving…"}
                 {saveStatus === "saved" && "Saved."}
                 {saveStatus === "error" && <span className="text-red-300">Could not save on this device.</span>}

[NoCoverage] EqualityOperator
src/components/inspections/SessionScreen.tsx:257:18
             ) : (
               <span className="text-blue-100/40">
                 {saveStatus === "saving" && "Saving…"}
-                {saveStatus === "saved" && "Saved."}
+                {saveStatus !== "saved" && "Saved."}
                 {saveStatus === "error" && <span className="text-red-300">Could not save on this device.</span>}
               </span>

[NoCoverage] LogicalOperator
src/components/inspections/SessionScreen.tsx:257:18
             ) : (
               <span className="text-blue-100/40">
                 {saveStatus === "saving" && "Saving…"}
-                {saveStatus === "saved" && "Saved."}
+                {saveStatus === "saved" || "Saved."}
                 {saveStatus === "error" && <span className="text-red-300">Could not save on this device.</span>}
               </span>

[NoCoverage] LogicalOperator
src/components/inspections/SessionScreen.tsx:258:18
               <span className="text-blue-100/40">
                 {saveStatus === "saving" && "Saving…"}
                 {saveStatus === "saved" && "Saved."}
-                {saveStatus === "error" && <span className="text-red-300">Could not save on this device.</span>}
+                {saveStatus === "error" || <span className="text-red-300">Could not save on this device.</span>}
               </span>
             )}

[NoCoverage] ConditionalExpression
src/components/inspections/SessionScreen.tsx:258:18
               <span className="text-blue-100/40">
                 {saveStatus === "saving" && "Saving…"}
                 {saveStatus === "saved" && "Saved."}
-                {saveStatus === "error" && <span className="text-red-300">Could not save on this device.</span>}
+                {false}
               </span>
             )}

[NoCoverage] StringLiteral
src/components/inspections/SessionScreen.tsx:261:59
                 {saveStatus === "error" && <span className="text-red-300">Could not save on this device.</span>}
               </span>
             )}
-            <span className={overLimit ? "text-red-300" : "text-blue-100/40"}>
+            <span className={overLimit ? "text-red-300" : ""}>
               {notes.length.toLocaleString()} / {MAX_NOTES.toLocaleString()}
             </span>
