[NoCoverage] BlockStatement
src/components/ui/alert-dialog.tsx:9:92
 import { cn } from "@/lib/utils";
 import { Button } from "@/components/ui/button";
 
-function AlertDialog({ ...props }: React.ComponentProps<typeof AlertDialogPrimitive.Root>) {
-  return <AlertDialogPrimitive.Root data-slot="alert-dialog" {...props} />;
-}
+function AlertDialog({ ...props }: React.ComponentProps<typeof AlertDialogPrimitive.Root>) {}
 
 function AlertDialogTrigger({ ...props }: React.ComponentProps<typeof AlertDialogPrimitive.Trigger>) {

[NoCoverage] BlockStatement
src/components/ui/alert-dialog.tsx:13:102
   return <AlertDialogPrimitive.Root data-slot="alert-dialog" {...props} />;
 }
 
-function AlertDialogTrigger({ ...props }: React.ComponentProps<typeof AlertDialogPrimitive.Trigger>) {
-  return <AlertDialogPrimitive.Trigger data-slot="alert-dialog-trigger" {...props} />;
-}
+function AlertDialogTrigger({ ...props }: React.ComponentProps<typeof AlertDialogPrimitive.Trigger>) {}
 
 function AlertDialogPortal({ ...props }: React.ComponentProps<typeof AlertDialogPrimitive.Portal>) {

[NoCoverage] BlockStatement
src/components/ui/alert-dialog.tsx:17:100
   return <AlertDialogPrimitive.Trigger data-slot="alert-dialog-trigger" {...props} />;
 }
 
-function AlertDialogPortal({ ...props }: React.ComponentProps<typeof AlertDialogPrimitive.Portal>) {
-  return <AlertDialogPrimitive.Portal data-slot="alert-dialog-portal" {...props} />;
-}
+function AlertDialogPortal({ ...props }: React.ComponentProps<typeof AlertDialogPrimitive.Portal>) {}
 
 function AlertDialogOverlay({ className, ...props }: React.ComponentProps<typeof AlertDialogPrimitive.Overlay>) {

[NoCoverage] BlockStatement
src/components/ui/alert-dialog.tsx:21:113
   return <AlertDialogPrimitive.Portal data-slot="alert-dialog-portal" {...props} />;
 }
 
-function AlertDialogOverlay({ className, ...props }: React.ComponentProps<typeof AlertDialogPrimitive.Overlay>) {
-  return (
-    <AlertDialogPrimitive.Overlay
-      data-slot="alert-dialog-overlay"
-      className={cn(
-        "data-[state=closed]:animate-out data-[state=closed]:fade-out-0 data-[state=open]:animate-in data-[state=open]:fade-in-0 fixed inset-0 z-50 bg-black/50",
-        className,
-      )}
-      {...props}
-    />
-  );
-}
+function AlertDialogOverlay({ className, ...props }: React.ComponentProps<typeof AlertDialogPrimitive.Overlay>) {}
 
 function AlertDialogContent({

[NoCoverage] StringLiteral
src/components/ui/alert-dialog.tsx:36:10
 
 function AlertDialogContent({
   className,
-  size = "default",
+  size = "",
   ...props
 }: React.ComponentProps<typeof AlertDialogPrimitive.Content> & {

[NoCoverage] BlockStatement
src/components/ui/alert-dialog.tsx:70:82
   );
 }
 
-function AlertDialogFooter({ className, ...props }: React.ComponentProps<"div">) {
-  return (
-    <div
-      data-slot="alert-dialog-footer"
-      className={cn(
-        "flex flex-col-reverse gap-2 group-data-[size=sm]/alert-dialog-content:grid group-data-[size=sm]/alert-dialog-content:grid-cols-2 sm:flex-row sm:justify-end",
-        className,
-      )}
-      {...props}
-    />
-  );
-}
+function AlertDialogFooter({ className, ...props }: React.ComponentProps<"div">) {}
 
 function AlertDialogTitle({ className, ...props }: React.ComponentProps<typeof AlertDialogPrimitive.Title>) {

[NoCoverage] StringLiteral
src/components/ui/alert-dialog.tsx:75:9
     <div
       data-slot="alert-dialog-footer"
       className={cn(
-        "flex flex-col-reverse gap-2 group-data-[size=sm]/alert-dialog-content:grid group-data-[size=sm]/alert-dialog-content:grid-cols-2 sm:flex-row sm:justify-end",
+        "",
         className,
       )}

[NoCoverage] BlockStatement
src/components/ui/alert-dialog.tsx:83:109
   );
 }
 
-function AlertDialogTitle({ className, ...props }: React.ComponentProps<typeof AlertDialogPrimitive.Title>) {
-  return (
-    <AlertDialogPrimitive.Title
-      data-slot="alert-dialog-title"
-      className={cn(
-        "text-lg font-semibold sm:group-data-[size=default]/alert-dialog-content:group-has-data-[slot=alert-dialog-media]/alert-dialog-content:col-start-2",
-        className,
-      )}
-      {...props}
-    />
-  );
-}
+function AlertDialogTitle({ className, ...props }: React.ComponentProps<typeof AlertDialogPrimitive.Title>) {}
 
 function AlertDialogDescription({

[NoCoverage] BlockStatement
src/components/ui/alert-dialog.tsx:99:67
 function AlertDialogDescription({
   className,
   ...props
-}: React.ComponentProps<typeof AlertDialogPrimitive.Description>) {
-  return (
-    <AlertDialogPrimitive.Description
-      data-slot="alert-dialog-description"
-      className={cn("text-muted-foreground text-sm", className)}
-      {...props}
-    />
-  );
-}
+}: React.ComponentProps<typeof AlertDialogPrimitive.Description>) {}
 
 function AlertDialogMedia({ className, ...props }: React.ComponentProps<"div">) {

[NoCoverage] StringLiteral
src/components/ui/alert-dialog.tsx:103:21
   return (
     <AlertDialogPrimitive.Description
       data-slot="alert-dialog-description"
-      className={cn("text-muted-foreground text-sm", className)}
+      className={cn("", className)}
       {...props}
     />

[NoCoverage] BlockStatement
src/components/ui/alert-dialog.tsx:109:81
   );
 }
 
-function AlertDialogMedia({ className, ...props }: React.ComponentProps<"div">) {
-  return (
-    <div
-      data-slot="alert-dialog-media"
-      className={cn(
-        "bg-muted mb-2 inline-flex size-16 items-center justify-center rounded-md sm:group-data-[size=default]/alert-dialog-content:row-span-2 *:[svg:not([class*='size-'])]:size-8",
-        className,
-      )}
-      {...props}
-    />
-  );
-}
+function AlertDialogMedia({ className, ...props }: React.ComponentProps<"div">) {}
 
 function AlertDialogAction({

[NoCoverage] StringLiteral
src/components/ui/alert-dialog.tsx:124:13
 
 function AlertDialogAction({
   className,
-  variant = "default",
+  variant = "",
   size = "default",
   ...props

[NoCoverage] BlockStatement
src/components/ui/alert-dialog.tsx:128:66
   size = "default",
   ...props
 }: React.ComponentProps<typeof AlertDialogPrimitive.Action> &
-  Pick<React.ComponentProps<typeof Button>, "variant" | "size">) {
-  return (
-    <Button variant={variant} size={size} asChild>
-      <AlertDialogPrimitive.Action data-slot="alert-dialog-action" className={cn(className)} {...props} />
-    </Button>
-  );
-}
+  Pick<React.ComponentProps<typeof Button>, "variant" | "size">) {}
 
 function AlertDialogCancel({

[NoCoverage] StringLiteral
src/components/ui/alert-dialog.tsx:139:10
 function AlertDialogCancel({
   className,
   variant = "outline",
-  size = "default",
+  size = "",
   ...props
 }: React.ComponentProps<typeof AlertDialogPrimitive.Cancel> &

[NoCoverage] BlockStatement
src/components/ui/alert-dialog.tsx:142:66
   size = "default",
   ...props
 }: React.ComponentProps<typeof AlertDialogPrimitive.Cancel> &
-  Pick<React.ComponentProps<typeof Button>, "variant" | "size">) {
-  return (
-    <Button variant={variant} size={size} asChild>
-      <AlertDialogPrimitive.Cancel data-slot="alert-dialog-cancel" className={cn(className)} {...props} />
-    </Button>
-  );
-}
+  Pick<React.ComponentProps<typeof Button>, "variant" | "size">) {}
 
 export {
