[NoCoverage] BlockStatement
pages/api/auth/signup.ts:4:50
 import type { APIRoute } from "astro";
 import { createClient } from "@/lib/supabase";
 
-export const POST: APIRoute = async (context) => {
-  const form = await context.request.formData();
-  const email = form.get("email") as string;
-  const password = form.get("password") as string;
-
-  const supabase = createClient(context.request.headers, context.cookies);
-  if (!supabase) {
-    return context.redirect(`/auth/signup?error=${encodeURIComponent("Supabase is not configured")}`);
-  }
-  const { error } = await supabase.auth.signUp({ email, password });
-
-  if (error) {
-    return context.redirect(`/auth/signup?error=${encodeURIComponent(error.message)}`);
-  }
-
-  return context.redirect("/auth/confirm-email");
-};
+export const POST: APIRoute = async (context) => {};
 

[NoCoverage] BooleanLiteral
pages/api/auth/signup.ts:10:7
   const password = form.get("password") as string;
 
   const supabase = createClient(context.request.headers, context.cookies);
-  if (!supabase) {
+  if (supabase) {
     return context.redirect(`/auth/signup?error=${encodeURIComponent("Supabase is not configured")}`);
   }

[NoCoverage] StringLiteral
pages/api/auth/signup.ts:11:70
 
   const supabase = createClient(context.request.headers, context.cookies);
   if (!supabase) {
-    return context.redirect(`/auth/signup?error=${encodeURIComponent("Supabase is not configured")}`);
+    return context.redirect(`/auth/signup?error=${encodeURIComponent("")}`);
   }
   const { error } = await supabase.auth.signUp({ email, password });

[NoCoverage] ObjectLiteral
pages/api/auth/signup.ts:13:48
   if (!supabase) {
     return context.redirect(`/auth/signup?error=${encodeURIComponent("Supabase is not configured")}`);
   }
-  const { error } = await supabase.auth.signUp({ email, password });
+  const { error } = await supabase.auth.signUp({});
 
   if (error) {

[NoCoverage] BlockStatement
pages/api/auth/signup.ts:15:14
   }
   const { error } = await supabase.auth.signUp({ email, password });
 
-  if (error) {
-    return context.redirect(`/auth/signup?error=${encodeURIComponent(error.message)}`);
-  }
+  if (error) {}
 
   return context.redirect("/auth/confirm-email");

[NoCoverage] StringLiteral
pages/api/auth/signup.ts:19:27
     return context.redirect(`/auth/signup?error=${encodeURIComponent(error.message)}`);
   }
 
-  return context.redirect("/auth/confirm-email");
+  return context.redirect("");
 };
 
