[NoCoverage] BlockStatement
src/components/ui/card.tsx:5:69
 
 import { cn } from "@/lib/utils";
 
-function Card({ className, ...props }: React.ComponentProps<"div">) {
-  return (
-    <div
-      data-slot="card"
-      className={cn("bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm", className)}
-      {...props}
-    />
-  );
-}
+function Card({ className, ...props }: React.ComponentProps<"div">) {}
 
 function CardHeader({ className, ...props }: React.ComponentProps<"div">) {

[NoCoverage] BlockStatement
src/components/ui/card.tsx:15:75
   );
 }
 
-function CardHeader({ className, ...props }: React.ComponentProps<"div">) {
-  return (
-    <div
-      data-slot="card-header"
-      className={cn(
-        "@container/card-header grid auto-rows-min grid-rows-[auto_auto] items-start gap-2 px-6 has-data-[slot=card-action]:grid-cols-[1fr_auto] [.border-b]:pb-6",
-        className,
-      )}
-      {...props}
-    />
-  );
-}
+function CardHeader({ className, ...props }: React.ComponentProps<"div">) {}
 
 function CardTitle({ className, ...props }: React.ComponentProps<"div">) {

[NoCoverage] BlockStatement
src/components/ui/card.tsx:28:74
   );
 }
 
-function CardTitle({ className, ...props }: React.ComponentProps<"div">) {
-  return <div data-slot="card-title" className={cn("leading-none font-semibold", className)} {...props} />;
-}
+function CardTitle({ className, ...props }: React.ComponentProps<"div">) {}
 
 function CardDescription({ className, ...props }: React.ComponentProps<"div">) {

[NoCoverage] BlockStatement
src/components/ui/card.tsx:32:80
   return <div data-slot="card-title" className={cn("leading-none font-semibold", className)} {...props} />;
 }
 
-function CardDescription({ className, ...props }: React.ComponentProps<"div">) {
-  return <div data-slot="card-description" className={cn("text-muted-foreground text-sm", className)} {...props} />;
-}
+function CardDescription({ className, ...props }: React.ComponentProps<"div">) {}
 
 function CardAction({ className, ...props }: React.ComponentProps<"div">) {

[NoCoverage] BlockStatement
src/components/ui/card.tsx:36:75
   return <div data-slot="card-description" className={cn("text-muted-foreground text-sm", className)} {...props} />;
 }
 
-function CardAction({ className, ...props }: React.ComponentProps<"div">) {
-  return (
-    <div
-      data-slot="card-action"
-      className={cn("col-start-2 row-span-2 row-start-1 self-start justify-self-end", className)}
-      {...props}
-    />
-  );
-}
+function CardAction({ className, ...props }: React.ComponentProps<"div">) {}
 
 function CardContent({ className, ...props }: React.ComponentProps<"div">) {

[NoCoverage] StringLiteral
src/components/ui/card.tsx:40:21
   return (
     <div
       data-slot="card-action"
-      className={cn("col-start-2 row-span-2 row-start-1 self-start justify-self-end", className)}
+      className={cn("", className)}
       {...props}
     />

[NoCoverage] BlockStatement
src/components/ui/card.tsx:46:76
   );
 }
 
-function CardContent({ className, ...props }: React.ComponentProps<"div">) {
-  return <div data-slot="card-content" className={cn("px-6", className)} {...props} />;
-}
+function CardContent({ className, ...props }: React.ComponentProps<"div">) {}
 
 function CardFooter({ className, ...props }: React.ComponentProps<"div">) {

[NoCoverage] BlockStatement
src/components/ui/card.tsx:50:75
   return <div data-slot="card-content" className={cn("px-6", className)} {...props} />;
 }
 
-function CardFooter({ className, ...props }: React.ComponentProps<"div">) {
-  return (
-    <div data-slot="card-footer" className={cn("flex items-center px-6 [.border-t]:pt-6", className)} {...props} />
-  );
-}
+function CardFooter({ className, ...props }: React.ComponentProps<"div">) {}
 
 export { Card, CardHeader, CardFooter, CardTitle, CardAction, CardDescription, CardContent };

[NoCoverage] StringLiteral
src/components/ui/card.tsx:52:48
 
 function CardFooter({ className, ...props }: React.ComponentProps<"div">) {
   return (
-    <div data-slot="card-footer" className={cn("flex items-center px-6 [.border-t]:pt-6", className)} {...props} />
+    <div data-slot="card-footer" className={cn("", className)} {...props} />
   );
 }
