[NoCoverage] BlockStatement
src/components/ui/dialog.tsx:8:82
 import { cn } from "@/lib/utils";
 import { Button } from "@/components/ui/button";
 
-function Dialog({ ...props }: React.ComponentProps<typeof DialogPrimitive.Root>) {
-  return <DialogPrimitive.Root data-slot="dialog" {...props} />;
-}
+function Dialog({ ...props }: React.ComponentProps<typeof DialogPrimitive.Root>) {}
 
 function DialogTrigger({ ...props }: React.ComponentProps<typeof DialogPrimitive.Trigger>) {

[NoCoverage] BlockStatement
src/components/ui/dialog.tsx:12:92
   return <DialogPrimitive.Root data-slot="dialog" {...props} />;
 }
 
-function DialogTrigger({ ...props }: React.ComponentProps<typeof DialogPrimitive.Trigger>) {
-  return <DialogPrimitive.Trigger data-slot="dialog-trigger" {...props} />;
-}
+function DialogTrigger({ ...props }: React.ComponentProps<typeof DialogPrimitive.Trigger>) {}
 
 function DialogPortal({ ...props }: React.ComponentProps<typeof DialogPrimitive.Portal>) {

[NoCoverage] BlockStatement
src/components/ui/dialog.tsx:16:90
   return <DialogPrimitive.Trigger data-slot="dialog-trigger" {...props} />;
 }
 
-function DialogPortal({ ...props }: React.ComponentProps<typeof DialogPrimitive.Portal>) {
-  return <DialogPrimitive.Portal data-slot="dialog-portal" {...props} />;
-}
+function DialogPortal({ ...props }: React.ComponentProps<typeof DialogPrimitive.Portal>) {}
 
 function DialogClose({ ...props }: React.ComponentProps<typeof DialogPrimitive.Close>) {

[NoCoverage] BlockStatement
src/components/ui/dialog.tsx:20:88
   return <DialogPrimitive.Portal data-slot="dialog-portal" {...props} />;
 }
 
-function DialogClose({ ...props }: React.ComponentProps<typeof DialogPrimitive.Close>) {
-  return <DialogPrimitive.Close data-slot="dialog-close" {...props} />;
-}
+function DialogClose({ ...props }: React.ComponentProps<typeof DialogPrimitive.Close>) {}
 
 function DialogOverlay({ className, ...props }: React.ComponentProps<typeof DialogPrimitive.Overlay>) {

[NoCoverage] BlockStatement
src/components/ui/dialog.tsx:24:103
   return <DialogPrimitive.Close data-slot="dialog-close" {...props} />;
 }
 
-function DialogOverlay({ className, ...props }: React.ComponentProps<typeof DialogPrimitive.Overlay>) {
-  return (
-    <DialogPrimitive.Overlay
-      data-slot="dialog-overlay"
-      className={cn(
-        "data-[state=closed]:animate-out data-[state=closed]:fade-out-0 data-[state=open]:animate-in data-[state=open]:fade-in-0 fixed inset-0 z-50 bg-black/50",
-        className,
-      )}
-      {...props}
-    />
-  );
-}
+function DialogOverlay({ className, ...props }: React.ComponentProps<typeof DialogPrimitive.Overlay>) {}
 
 function DialogContent({

[NoCoverage] StringLiteral
src/components/ui/dialog.tsx:29:9
     <DialogPrimitive.Overlay
       data-slot="dialog-overlay"
       className={cn(
-        "data-[state=closed]:animate-out data-[state=closed]:fade-out-0 data-[state=open]:animate-in data-[state=open]:fade-in-0 fixed inset-0 z-50 bg-black/50",
+        "",
         className,
       )}

[NoCoverage] BooleanLiteral
src/components/ui/dialog.tsx:40:21
 function DialogContent({
   className,
   children,
-  showCloseButton = true,
+  showCloseButton = false,
   ...props
 }: React.ComponentProps<typeof DialogPrimitive.Content> & {

[NoCoverage] BlockStatement
src/components/ui/dialog.tsx:71:77
   );
 }
 
-function DialogHeader({ className, ...props }: React.ComponentProps<"div">) {
-  return (
-    <div
-      data-slot="dialog-header"
-      className={cn("flex flex-col gap-2 text-center sm:text-left", className)}
-      {...props}
-    />
-  );
-}
+function DialogHeader({ className, ...props }: React.ComponentProps<"div">) {}
 
 function DialogFooter({

[NoCoverage] BooleanLiteral
src/components/ui/dialog.tsx:83:21
 
 function DialogFooter({
   className,
-  showCloseButton = false,
+  showCloseButton = true,
   children,
   ...props

[NoCoverage] BlockStatement
src/components/ui/dialog.tsx:88:4
   ...props
 }: React.ComponentProps<"div"> & {
   showCloseButton?: boolean;
-}) {
-  return (
-    <div
-      data-slot="dialog-footer"
-      className={cn("flex flex-col-reverse gap-2 sm:flex-row sm:justify-end", className)}
-      {...props}
-    >
-      {children}
-      {showCloseButton && (
-        <DialogPrimitive.Close asChild>
-          <Button variant="outline">Close</Button>
-        </DialogPrimitive.Close>
-      )}
-    </div>
-  );
-}
+}) {}
 
 function DialogTitle({ className, ...props }: React.ComponentProps<typeof DialogPrimitive.Title>) {

[NoCoverage] ConditionalExpression
src/components/ui/dialog.tsx:96:8
       {...props}
     >
       {children}
-      {showCloseButton && (
-        <DialogPrimitive.Close asChild>
-          <Button variant="outline">Close</Button>
-        </DialogPrimitive.Close>
-      )}
+      {false}
     </div>
   );

[NoCoverage] LogicalOperator
src/components/ui/dialog.tsx:96:8
       {...props}
     >
       {children}
-      {showCloseButton && (
-        <DialogPrimitive.Close asChild>
-          <Button variant="outline">Close</Button>
-        </DialogPrimitive.Close>
-      )}
+      {showCloseButton || <DialogPrimitive.Close asChild>
+          <Button variant="outline">Close</Button>
+        </DialogPrimitive.Close>}
     </div>
   );

[NoCoverage] BlockStatement
src/components/ui/dialog.tsx:105:99
   );
 }
 
-function DialogTitle({ className, ...props }: React.ComponentProps<typeof DialogPrimitive.Title>) {
-  return (
-    <DialogPrimitive.Title
-      data-slot="dialog-title"
-      className={cn("text-lg leading-none font-semibold", className)}
-      {...props}
-    />
-  );
-}
+function DialogTitle({ className, ...props }: React.ComponentProps<typeof DialogPrimitive.Title>) {}
 
 function DialogDescription({ className, ...props }: React.ComponentProps<typeof DialogPrimitive.Description>) {

[NoCoverage] BlockStatement
src/components/ui/dialog.tsx:115:111
   );
 }
 
-function DialogDescription({ className, ...props }: React.ComponentProps<typeof DialogPrimitive.Description>) {
-  return (
-    <DialogPrimitive.Description
-      data-slot="dialog-description"
-      className={cn("text-muted-foreground text-sm", className)}
-      {...props}
-    />
-  );
-}
+function DialogDescription({ className, ...props }: React.ComponentProps<typeof DialogPrimitive.Description>) {}
 
 export {
