[NoCoverage] BlockStatement
src/components/ui/select.tsx:9:82
 
 import { cn } from "@/lib/utils";
 
-function Select({ ...props }: React.ComponentProps<typeof SelectPrimitive.Root>) {
-  return <SelectPrimitive.Root data-slot="select" {...props} />;
-}
+function Select({ ...props }: React.ComponentProps<typeof SelectPrimitive.Root>) {}
 
 function SelectGroup({ ...props }: React.ComponentProps<typeof SelectPrimitive.Group>) {

[NoCoverage] BlockStatement
src/components/ui/select.tsx:13:88
   return <SelectPrimitive.Root data-slot="select" {...props} />;
 }
 
-function SelectGroup({ ...props }: React.ComponentProps<typeof SelectPrimitive.Group>) {
-  return <SelectPrimitive.Group data-slot="select-group" {...props} />;
-}
+function SelectGroup({ ...props }: React.ComponentProps<typeof SelectPrimitive.Group>) {}
 
 function SelectValue({ ...props }: React.ComponentProps<typeof SelectPrimitive.Value>) {

[NoCoverage] BlockStatement
src/components/ui/select.tsx:17:88
   return <SelectPrimitive.Group data-slot="select-group" {...props} />;
 }
 
-function SelectValue({ ...props }: React.ComponentProps<typeof SelectPrimitive.Value>) {
-  return <SelectPrimitive.Value data-slot="select-value" {...props} />;
-}
+function SelectValue({ ...props }: React.ComponentProps<typeof SelectPrimitive.Value>) {}
 
 function SelectTrigger({

[NoCoverage] ConditionalExpression
src/components/ui/select.tsx:60:11
         data-slot="select-content"
         className={cn(
-          position === "popper" &&
-            "data-[side=bottom]:translate-y-1 data-[side=left]:-translate-x-1 data-[side=right]:translate-x-1 data-[side=top]:-translate-y-1",
+          true,
           className,
         )}

[NoCoverage] ConditionalExpression
src/components/ui/select.tsx:60:11
         data-slot="select-content"
         className={cn(
-          position === "popper" &&
+          true &&
             "data-[side=bottom]:translate-y-1 data-[side=left]:-translate-x-1 data-[side=right]:translate-x-1 data-[side=top]:-translate-y-1",
           className,

[NoCoverage] StringLiteral
src/components/ui/select.tsx:61:13
         className={cn(
           position === "popper" &&
-            "data-[side=bottom]:translate-y-1 data-[side=left]:-translate-x-1 data-[side=right]:translate-x-1 data-[side=top]:-translate-y-1",
+            "",
           className,
         )}

[NoCoverage] StringLiteral
src/components/ui/select.tsx:71:13
         <SelectScrollUpButton />
         <SelectPrimitive.Viewport
           className={cn(
-            "p-1",
+            "",
             position === "popper" &&
               "h-[var(--radix-select-trigger-height)] w-full min-w-[var(--radix-select-trigger-width)] scroll-my-1",

[NoCoverage] EqualityOperator
src/components/ui/select.tsx:72:13
         <SelectPrimitive.Viewport
           className={cn(
             "p-1",
-            position === "popper" &&
+            position !== "popper" &&
               "h-[var(--radix-select-trigger-height)] w-full min-w-[var(--radix-select-trigger-width)] scroll-my-1",
           )}

[NoCoverage] ConditionalExpression
src/components/ui/select.tsx:72:13
         <SelectPrimitive.Viewport
           className={cn(
             "p-1",
-            position === "popper" &&
-              "h-[var(--radix-select-trigger-height)] w-full min-w-[var(--radix-select-trigger-width)] scroll-my-1",
+            false,
           )}
         >

[NoCoverage] BlockStatement
src/components/ui/select.tsx:84:99
   );
 }
 
-function SelectLabel({ className, ...props }: React.ComponentProps<typeof SelectPrimitive.Label>) {
-  return (
-    <SelectPrimitive.Label
-      data-slot="select-label"
-      className={cn("text-muted-foreground px-2 py-1.5 text-xs", className)}
-      {...props}
-    />
-  );
-}
+function SelectLabel({ className, ...props }: React.ComponentProps<typeof SelectPrimitive.Label>) {}
 
 function SelectItem({ className, children, ...props }: React.ComponentProps<typeof SelectPrimitive.Item>) {

[NoCoverage] StringLiteral
src/components/ui/select.tsx:88:21
   return (
     <SelectPrimitive.Label
       data-slot="select-label"
-      className={cn("text-muted-foreground px-2 py-1.5 text-xs", className)}
+      className={cn("", className)}
       {...props}
     />

[NoCoverage] BlockStatement
src/components/ui/select.tsx:114:107
   );
 }
 
-function SelectSeparator({ className, ...props }: React.ComponentProps<typeof SelectPrimitive.Separator>) {
-  return (
-    <SelectPrimitive.Separator
-      data-slot="select-separator"
-      className={cn("bg-border pointer-events-none -mx-1 my-1 h-px", className)}
-      {...props}
-    />
-  );
-}
+function SelectSeparator({ className, ...props }: React.ComponentProps<typeof SelectPrimitive.Separator>) {}
 
 function SelectScrollUpButton({ className, ...props }: React.ComponentProps<typeof SelectPrimitive.ScrollUpButton>) {

[NoCoverage] StringLiteral
src/components/ui/select.tsx:118:21
   return (
     <SelectPrimitive.Separator
       data-slot="select-separator"
-      className={cn("bg-border pointer-events-none -mx-1 my-1 h-px", className)}
+      className={cn("", className)}
       {...props}
     />

[NoCoverage] BlockStatement
src/components/ui/select.tsx:124:117
   );
 }
 
-function SelectScrollUpButton({ className, ...props }: React.ComponentProps<typeof SelectPrimitive.ScrollUpButton>) {
-  return (
-    <SelectPrimitive.ScrollUpButton
-      data-slot="select-scroll-up-button"
-      className={cn("flex cursor-default items-center justify-center py-1", className)}
-      {...props}
-    >
-      <ChevronUpIcon className="size-4" />
-    </SelectPrimitive.ScrollUpButton>
-  );
-}
+function SelectScrollUpButton({ className, ...props }: React.ComponentProps<typeof SelectPrimitive.ScrollUpButton>) {}
 
 function SelectScrollDownButton({

[NoCoverage] BlockStatement
src/components/ui/select.tsx:139:67
 function SelectScrollDownButton({
   className,
   ...props
-}: React.ComponentProps<typeof SelectPrimitive.ScrollDownButton>) {
-  return (
-    <SelectPrimitive.ScrollDownButton
-      data-slot="select-scroll-down-button"
-      className={cn("flex cursor-default items-center justify-center py-1", className)}
-      {...props}
-    >
-      <ChevronDownIcon className="size-4" />
-    </SelectPrimitive.ScrollDownButton>
-  );
-}
+}: React.ComponentProps<typeof SelectPrimitive.ScrollDownButton>) {}
 
 export {

[NoCoverage] StringLiteral
src/components/ui/select.tsx:143:21
   return (
     <SelectPrimitive.ScrollDownButton
       data-slot="select-scroll-down-button"
-      className={cn("flex cursor-default items-center justify-center py-1", className)}
+      className={cn("", className)}
       {...props}
     >
