[NoCoverage] ConditionalExpression
src/lib/config-status.ts:14:25
 export const configStatuses: ConfigStatus[] = [
   {
     name: "Supabase",
-    configured: Boolean(SUPABASE_URL && SUPABASE_KEY),
+    configured: Boolean(true),
     message: "Supabase is not configured — authentication features are disabled.",
     docsUrl: "https://github.com/OziOcb/VerifficaNew#supabase-configuration",

[NoCoverage] LogicalOperator
src/lib/config-status.ts:14:25
 export const configStatuses: ConfigStatus[] = [
   {
     name: "Supabase",
-    configured: Boolean(SUPABASE_URL && SUPABASE_KEY),
+    configured: Boolean(SUPABASE_URL || SUPABASE_KEY),
     message: "Supabase is not configured — authentication features are disabled.",
     docsUrl: "https://github.com/OziOcb/VerifficaNew#supabase-configuration",

[NoCoverage] ArrowFunction
src/lib/config-status.ts:21:53
   },
 ];
 
-export const missingConfigs = configStatuses.filter((s) => !s.configured);
+export const missingConfigs = configStatuses.filter(() => undefined);
 

[NoCoverage] MethodExpression
src/lib/config-status.ts:21:31
   },
 ];
 
-export const missingConfigs = configStatuses.filter((s) => !s.configured);
+export const missingConfigs = configStatuses;
 
