[NoCoverage] BlockStatement
src/lib/inspections.ts:28:56
 // preference (FR-009). Scoped by user id so the choice (a) PERSISTS across
 // logout/login for the same user on this browser, and (b) never leaks to a
 // different account. Because it is user-scoped, signout must NOT clear it.
-export function hideStartupKey(userId: string): string {
-  return `veriffica:hideStartupInstructions:${userId}`;
-}
+export function hideStartupKey(userId: string): string {}
 
 // Distinctive, stable message the `enforce_inspection_limit` trigger RAISEs when

[NoCoverage] StringLiteral
src/lib/inspections.ts:29:10
 // logout/login for the same user on this browser, and (b) never leaks to a
 // different account. Because it is user-scoped, signout must NOT clear it.
 export function hideStartupKey(userId: string): string {
-  return `veriffica:hideStartupInstructions:${userId}`;
+  return ``;
 }
 

[NoCoverage] BlockStatement
src/lib/inspections.ts:43:116
 // Create one draft inspection. The server stamps every field; we only need to
 // know the outcome. 201 -> the new id; 409 -> the 2-per-owner limit was hit (the
 // dashboard shows the limit pop-up); anything else -> a generic failure.
-export async function createInspection(): Promise<{ ok: true; id: string } | { ok: false; limitReached: boolean }> {
-  const res = await fetch("/api/inspections/create", { method: "POST" });
-  if (res.status === 201) {
-    const { id } = (await res.json()) as { id: string };
-    return { ok: true, id };
-  }
-  return { ok: false, limitReached: res.status === 409 };
-}
+export async function createInspection(): Promise<{ ok: true; id: string } | { ok: false; limitReached: boolean }> {}
 
 // Hard-delete one inspection by reusing the existing sync endpoint's delete branch

[NoCoverage] ObjectLiteral
src/lib/inspections.ts:44:54
 // know the outcome. 201 -> the new id; 409 -> the 2-per-owner limit was hit (the
 // dashboard shows the limit pop-up); anything else -> a generic failure.
 export async function createInspection(): Promise<{ ok: true; id: string } | { ok: false; limitReached: boolean }> {
-  const res = await fetch("/api/inspections/create", { method: "POST" });
+  const res = await fetch("/api/inspections/create", {});
   if (res.status === 201) {
     const { id } = (await res.json()) as { id: string };

[NoCoverage] BlockStatement
src/lib/inspections.ts:45:27
 // dashboard shows the limit pop-up); anything else -> a generic failure.
 export async function createInspection(): Promise<{ ok: true; id: string } | { ok: false; limitReached: boolean }> {
   const res = await fetch("/api/inspections/create", { method: "POST" });
-  if (res.status === 201) {
-    const { id } = (await res.json()) as { id: string };
-    return { ok: true, id };
-  }
+  if (res.status === 201) {}
   return { ok: false, limitReached: res.status === 409 };
 }

[NoCoverage] EqualityOperator
src/lib/inspections.ts:45:7
 // dashboard shows the limit pop-up); anything else -> a generic failure.
 export async function createInspection(): Promise<{ ok: true; id: string } | { ok: false; limitReached: boolean }> {
   const res = await fetch("/api/inspections/create", { method: "POST" });
-  if (res.status === 201) {
+  if (res.status !== 201) {
     const { id } = (await res.json()) as { id: string };
     return { ok: true, id };

[NoCoverage] BooleanLiteral
src/lib/inspections.ts:47:18
   const res = await fetch("/api/inspections/create", { method: "POST" });
   if (res.status === 201) {
     const { id } = (await res.json()) as { id: string };
-    return { ok: true, id };
+    return { ok: false, id };
   }
   return { ok: false, limitReached: res.status === 409 };

[NoCoverage] BooleanLiteral
src/lib/inspections.ts:49:16
     const { id } = (await res.json()) as { id: string };
     return { ok: true, id };
   }
-  return { ok: false, limitReached: res.status === 409 };
+  return { ok: true, limitReached: res.status === 409 };
 }
 

[NoCoverage] EqualityOperator
src/lib/inspections.ts:49:37
     const { id } = (await res.json()) as { id: string };
     return { ok: true, id };
   }
-  return { ok: false, limitReached: res.status === 409 };
+  return { ok: false, limitReached: res.status !== 409 };
 }
 

[NoCoverage] BlockStatement
src/lib/inspections.ts:54:70
 
 // Hard-delete one inspection by reusing the existing sync endpoint's delete branch
 // (RLS-scoped delete -> 204). Called synchronously inline, NOT via the outbox.
-export async function deleteInspection(id: string): Promise<boolean> {
-  const res = await fetch("/api/inspections/sync", {
-    method: "POST",
-    headers: { "Content-Type": "application/json" },
-    body: JSON.stringify({ op: "delete", entityId: id }),
-  });
-  return res.ok;
-}
+export async function deleteInspection(id: string): Promise<boolean> {}
 

[NoCoverage] StringLiteral
src/lib/inspections.ts:55:27
 // Hard-delete one inspection by reusing the existing sync endpoint's delete branch
 // (RLS-scoped delete -> 204). Called synchronously inline, NOT via the outbox.
 export async function deleteInspection(id: string): Promise<boolean> {
-  const res = await fetch("/api/inspections/sync", {
+  const res = await fetch("", {
     method: "POST",
     headers: { "Content-Type": "application/json" },

[NoCoverage] ObjectLiteral
src/lib/inspections.ts:55:52
 // Hard-delete one inspection by reusing the existing sync endpoint's delete branch
 // (RLS-scoped delete -> 204). Called synchronously inline, NOT via the outbox.
 export async function deleteInspection(id: string): Promise<boolean> {
-  const res = await fetch("/api/inspections/sync", {
-    method: "POST",
-    headers: { "Content-Type": "application/json" },
-    body: JSON.stringify({ op: "delete", entityId: id }),
-  });
+  const res = await fetch("/api/inspections/sync", {});
   return res.ok;
 }
