[Killed] Regex
src/lib/part1-config.ts:44:16
 const BODY_TYPES = ["sedan", "hatchback", "suv", "coupe", "convertible", "van", "pickup", "other"] as const;
 
 // VIN: exactly 17 chars from a restricted alphabet that EXCLUDES I, O, Q.
-const VIN_RE = /^[A-HJ-NPR-Z0-9]{17}$/;
+const VIN_RE = /^[^A-HJ-NPR-Z0-9]{17}$/;
 // Registration: letters, digits, spaces, hyphen; 2-15 chars (after uppercasing).
 const REGISTRATION_RE = /^[A-Z0-9 -]{2,15}$/;
killedBy: normalization (rules §8 payload shape) trims + collapses spaces in text, uppercases registration/VIN, lowercases enums
statusReason: expected false to be true // Object.is equality

[Killed] Regex
src/lib/part1-config.ts:46:25
 // VIN: exactly 17 chars from a restricted alphabet that EXCLUDES I, O, Q.
 const VIN_RE = /^[A-HJ-NPR-Z0-9]{17}$/;
 // Registration: letters, digits, spaces, hyphen; 2-15 chars (after uppercasing).
-const REGISTRATION_RE = /^[A-Z0-9 -]{2,15}$/;
+const REGISTRATION_RE = /[A-Z0-9 -]{2,15}$/;
 // Year upper bound is dynamic — the current year (no future years); lower bound 1886.
 // IMPORTANT: the upper bound MUST be read lazily (per-validation), never cached at
killedBy: field boundaries rejects 'registration illegal char'
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/lib/part1-config.ts:56:21
 // gate in session.astro). Computed inside the refine, it runs per request where the
 // clock is live. Browser-side (the client:only form) was unaffected; this keeps both correct.
 const MIN_YEAR = 1886;
-const currentYear = (): number => new Date().getFullYear();
+const currentYear = () => undefined;
 
 // Trim + collapse runs of whitespace to a single space (rules "collapse repeated spaces").
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/lib/part1-config.ts:59:41
 const currentYear = (): number => new Date().getFullYear();
 
 // Trim + collapse runs of whitespace to a single space (rules "collapse repeated spaces").
-const collapse = (s: string): string => s.trim().replace(/\s+/g, " ");
+const collapse = (s: string): string => s.replace(/\s+/g, " ");
 
 // --- Field builders -------------------------------------------------------
killedBy: normalization (rules §8 payload shape) trims + collapses spaces in text, uppercases registration/VIN, lowercases enums
statusReason: expected ' Toyota Motors ' to be 'Toyota Motors' // Object.is equality

[Killed] ArrowFunction
src/lib/part1-config.ts:59:18
 const currentYear = (): number => new Date().getFullYear();
 
 // Trim + collapse runs of whitespace to a single space (rules "collapse repeated spaces").
-const collapse = (s: string): string => s.trim().replace(/\s+/g, " ");
+const collapse = () => undefined;
 
 // --- Field builders -------------------------------------------------------
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
src/lib/part1-config.ts:69:25
 // mismatch (a plain string is not assignable to a z.enum's literal-union input).
 
 // Capitalize the first character, leave the rest untouched ("toyota" → "Toyota").
-const capitalizeFirst = (s: string): string => (s.length > 0 ? s.charAt(0).toUpperCase() + s.slice(1) : s);
+const capitalizeFirst = () => undefined;
 
 const requiredText = (message: string, opts: { min: number; max: number; capitalize?: boolean }) =>
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/lib/part1-config.ts:69:49
 // mismatch (a plain string is not assignable to a z.enum's literal-union input).
 
 // Capitalize the first character, leave the rest untouched ("toyota" → "Toyota").
-const capitalizeFirst = (s: string): string => (s.length > 0 ? s.charAt(0).toUpperCase() + s.slice(1) : s);
+const capitalizeFirst = (s: string): string => (false ? s.charAt(0).toUpperCase() + s.slice(1) : s);
 
 const requiredText = (message: string, opts: { min: number; max: number; capitalize?: boolean }) =>
killedBy: normalization (rules §8 payload shape) trims + collapses spaces in text, uppercases registration/VIN, lowercases enums
statusReason: expected 'line1\nline2' to be 'Line1\nline2' // Object.is equality

[Killed] ArrowFunction
src/lib/part1-config.ts:71:22
 // Capitalize the first character, leave the rest untouched ("toyota" → "Toyota").
 const capitalizeFirst = (s: string): string => (s.length > 0 ? s.charAt(0).toUpperCase() + s.slice(1) : s);
 
-const requiredText = (message: string, opts: { min: number; max: number; capitalize?: boolean }) =>
-  z
-    .string()
-    .transform((s) => {
-      const v = collapse(s);
-      return opts.capitalize ? capitalizeFirst(v) : v;
-    })
-    .refine((s) => s.length >= opts.min && s.length <= opts.max, { message });
+const requiredText = () => undefined;
 
 const optionalText = (
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: Invalid element at key "make": expected a Zod schema

[Killed] BlockStatement
src/lib/part1-config.ts:74:23
 const requiredText = (message: string, opts: { min: number; max: number; capitalize?: boolean }) =>
   z
     .string()
-    .transform((s) => {
-      const v = collapse(s);
-      return opts.capitalize ? capitalizeFirst(v) : v;
-    })
+    .transform((s) => {})
     .refine((s) => s.length >= opts.min && s.length <= opts.max, { message });
 
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/lib/part1-config.ts:78:44
       const v = collapse(s);
       return opts.capitalize ? capitalizeFirst(v) : v;
     })
-    .refine((s) => s.length >= opts.min && s.length <= opts.max, { message });
+    .refine((s) => s.length >= opts.min && s.length < opts.max, { message });
 
 const optionalText = (
killedBy: field boundaries accepts 'make 50 chars'
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/part1-config.ts:78:20
       const v = collapse(s);
       return opts.capitalize ? capitalizeFirst(v) : v;
     })
-    .refine((s) => s.length >= opts.min && s.length <= opts.max, { message });
+    .refine((s) => true && s.length <= opts.max, { message });
 
 const optionalText = (
killedBy: required fields reject when empty (exact §9 copy) 'make' empty → 'Enter the car make.'
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/lib/part1-config.ts:93:23
 ) =>
   z
     .string()
-    .transform((s) => {
-      let v = opts.collapseSpaces === false ? s.trim() : collapse(s);
-      if (opts.uppercase) v = v.toUpperCase();
-      if (opts.capitalize) v = capitalizeFirst(v);
-      return v;
-    })
+    .transform((s) => {})
     .refine(
       (s) => s === "" || ((opts.regex ? opts.regex.test(s) : true) && s.length >= opts.min && s.length <= opts.max),
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/lib/part1-config.ts:94:15
   z
     .string()
     .transform((s) => {
-      let v = opts.collapseSpaces === false ? s.trim() : collapse(s);
+      let v = opts.collapseSpaces !== false ? s.trim() : collapse(s);
       if (opts.uppercase) v = v.toUpperCase();
       if (opts.capitalize) v = capitalizeFirst(v);
killedBy: normalization (rules §8 payload shape) trims + collapses spaces in text, uppercases registration/VIN, lowercases enums
statusReason: expected 'Warsaw,   Poland' to be 'Warsaw, Poland' // Object.is equality

[Killed] ConditionalExpression
src/lib/part1-config.ts:94:15
   z
     .string()
     .transform((s) => {
-      let v = opts.collapseSpaces === false ? s.trim() : collapse(s);
+      let v = true ? s.trim() : collapse(s);
       if (opts.uppercase) v = v.toUpperCase();
       if (opts.capitalize) v = capitalizeFirst(v);
killedBy: normalization (rules §8 payload shape) trims + collapses spaces in text, uppercases registration/VIN, lowercases enums
statusReason: expected 'Warsaw,   Poland' to be 'Warsaw, Poland' // Object.is equality

[Killed] ConditionalExpression
src/lib/part1-config.ts:95:11
     .string()
     .transform((s) => {
       let v = opts.collapseSpaces === false ? s.trim() : collapse(s);
-      if (opts.uppercase) v = v.toUpperCase();
+      if (true) v = v.toUpperCase();
       if (opts.capitalize) v = capitalizeFirst(v);
       return v;
killedBy: normalization (rules §8 payload shape) trims + collapses spaces in text, uppercases registration/VIN, lowercases enums
statusReason: expected 'SILVER' to be 'Silver' // Object.is equality

[Killed] ConditionalExpression
src/lib/part1-config.ts:95:11
     .string()
     .transform((s) => {
       let v = opts.collapseSpaces === false ? s.trim() : collapse(s);
-      if (opts.uppercase) v = v.toUpperCase();
+      if (false) v = v.toUpperCase();
       if (opts.capitalize) v = capitalizeFirst(v);
       return v;
killedBy: normalization (rules §8 payload shape) trims + collapses spaces in text, uppercases registration/VIN, lowercases enums
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/part1-config.ts:96:11
     .transform((s) => {
       let v = opts.collapseSpaces === false ? s.trim() : collapse(s);
       if (opts.uppercase) v = v.toUpperCase();
-      if (opts.capitalize) v = capitalizeFirst(v);
+      if (false) v = capitalizeFirst(v);
       return v;
     })
killedBy: normalization (rules §8 payload shape) capitalizes the first letter of make, model, color, address and notes
statusReason: expected 'silver' to be 'Silver' // Object.is equality

[Survived] ConditionalExpression
src/lib/part1-config.ts:96:11
     .transform((s) => {
       let v = opts.collapseSpaces === false ? s.trim() : collapse(s);
       if (opts.uppercase) v = v.toUpperCase();
-      if (opts.capitalize) v = capitalizeFirst(v);
+      if (true) v = capitalizeFirst(v);
       return v;
     })

[Killed] EqualityOperator
src/lib/part1-config.ts:100:14
       return v;
     })
     .refine(
-      (s) => s === "" || ((opts.regex ? opts.regex.test(s) : true) && s.length >= opts.min && s.length <= opts.max),
+      (s) => s !== "" || ((opts.regex ? opts.regex.test(s) : true) && s.length >= opts.min && s.length <= opts.max),
       {
         message,
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/lib/part1-config.ts:100:7
       return v;
     })
     .refine(
-      (s) => s === "" || ((opts.regex ? opts.regex.test(s) : true) && s.length >= opts.min && s.length <= opts.max),
+      () => undefined,
       {
         message,
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/lib/part1-config.ts:101:7
     })
     .refine(
       (s) => s === "" || ((opts.regex ? opts.regex.test(s) : true) && s.length >= opts.min && s.length <= opts.max),
-      {
-        message,
-      },
+      {},
     )
     .transform((s) => (s === "" ? null : s));
killedBy: optional fields persist null when empty, validate when present invalid optional VIN (contains I/O/Q) blocks save with its message
statusReason: expected 'Invalid input' to be 'VIN must contain exactly 17 letters a…' // Object.is equality

[Killed] EqualityOperator
src/lib/part1-config.ts:105:24
         message,
       },
     )
-    .transform((s) => (s === "" ? null : s));
+    .transform((s) => (s !== "" ? null : s));
 
 // `max` may be a function so date-derived bounds (the year) are read per-validation,
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: expected { price: null, make: 'Toyota', …(13) } to deeply equal { price: null, make: 'Toyota', …(13) }

[Killed] ConditionalExpression
src/lib/part1-config.ts:105:24
         message,
       },
     )
-    .transform((s) => (s === "" ? null : s));
+    .transform((s) => (false ? null : s));
 
 // `max` may be a function so date-derived bounds (the year) are read per-validation,
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: expected { price: null, make: 'Toyota', …(13) } to deeply equal { price: null, make: 'Toyota', …(13) }

[Killed] ArrowFunction
src/lib/part1-config.ts:109:21
 
 // `max` may be a function so date-derived bounds (the year) are read per-validation,
 // not captured at schema-build time — see the Cloudflare frozen-clock note above.
-const optionalInt = (message: string, opts: { min: number; max: number | (() => number); stripSpaces?: boolean }) =>
-  z
-    .string()
-    .transform((s) => (opts.stripSpaces ? s.replace(/\s+/g, "") : s.trim()))
-    .refine(
-      (s) => {
-        if (s === "") return true;
-        const max = typeof opts.max === "function" ? opts.max() : opts.max;
-        return /^\d+$/.test(s) && Number(s) >= opts.min && Number(s) <= max;
-      },
-      { message },
-    )
-    .transform((s) => (s === "" ? null : Number(s)));
+const optionalInt = () => undefined;
 
 const enumField = <const T extends readonly [string, ...string[]]>(values: T, message: string) => {
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: Invalid element at key "year": expected a Zod schema

[Killed] ArrowFunction
src/lib/part1-config.ts:112:16
 const optionalInt = (message: string, opts: { min: number; max: number | (() => number); stripSpaces?: boolean }) =>
   z
     .string()
-    .transform((s) => (opts.stripSpaces ? s.replace(/\s+/g, "") : s.trim()))
+    .transform(() => undefined)
     .refine(
       (s) => {
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
src/lib/part1-config.ts:112:67
 const optionalInt = (message: string, opts: { min: number; max: number | (() => number); stripSpaces?: boolean }) =>
   z
     .string()
-    .transform((s) => (opts.stripSpaces ? s.replace(/\s+/g, "") : s.trim()))
+    .transform((s) => (opts.stripSpaces ? s.replace(/\s+/g, "") : s))
     .refine(
       (s) => {

[Killed] BlockStatement
src/lib/part1-config.ts:114:14
     .string()
     .transform((s) => (opts.stripSpaces ? s.replace(/\s+/g, "") : s.trim()))
     .refine(
-      (s) => {
-        if (s === "") return true;
-        const max = typeof opts.max === "function" ? opts.max() : opts.max;
-        return /^\d+$/.test(s) && Number(s) >= opts.min && Number(s) <= max;
-      },
+      (s) => {},
       { message },
     )
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/part1-config.ts:115:13
     .transform((s) => (opts.stripSpaces ? s.replace(/\s+/g, "") : s.trim()))
     .refine(
       (s) => {
-        if (s === "") return true;
+        if (s !== "") return true;
         const max = typeof opts.max === "function" ? opts.max() : opts.max;
         return /^\d+$/.test(s) && Number(s) >= opts.min && Number(s) <= max;
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/part1-config.ts:115:30
     .transform((s) => (opts.stripSpaces ? s.replace(/\s+/g, "") : s.trim()))
     .refine(
       (s) => {
-        if (s === "") return true;
+        if (s === "") return false;
         const max = typeof opts.max === "function" ? opts.max() : opts.max;
         return /^\d+$/.test(s) && Number(s) >= opts.min && Number(s) <= max;
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/part1-config.ts:116:21
     .refine(
       (s) => {
         if (s === "") return true;
-        const max = typeof opts.max === "function" ? opts.max() : opts.max;
+        const max = false ? opts.max() : opts.max;
         return /^\d+$/.test(s) && Number(s) >= opts.min && Number(s) <= max;
       },
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/part1-config.ts:116:21
     .refine(
       (s) => {
         if (s === "") return true;
-        const max = typeof opts.max === "function" ? opts.max() : opts.max;
+        const max = typeof opts.max !== "function" ? opts.max() : opts.max;
         return /^\d+$/.test(s) && Number(s) >= opts.min && Number(s) <= max;
       },
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/part1-config.ts:117:60
       (s) => {
         if (s === "") return true;
         const max = typeof opts.max === "function" ? opts.max() : opts.max;
-        return /^\d+$/.test(s) && Number(s) >= opts.min && Number(s) <= max;
+        return /^\d+$/.test(s) && Number(s) >= opts.min && true;
       },
       { message },
killedBy: field boundaries rejects 'year above current'
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/lib/part1-config.ts:117:35
       (s) => {
         if (s === "") return true;
         const max = typeof opts.max === "function" ? opts.max() : opts.max;
-        return /^\d+$/.test(s) && Number(s) >= opts.min && Number(s) <= max;
+        return /^\d+$/.test(s) && Number(s) < opts.min && Number(s) <= max;
       },
       { message },
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: expected false to be true // Object.is equality

[Survived] ObjectLiteral
src/lib/part1-config.ts:119:7
         const max = typeof opts.max === "function" ? opts.max() : opts.max;
         return /^\d+$/.test(s) && Number(s) >= opts.min && Number(s) <= max;
       },
-      { message },
+      {},
     )
     .transform((s) => (s === "" ? null : Number(s)));

[Killed] EqualityOperator
src/lib/part1-config.ts:121:24
       },
       { message },
     )
-    .transform((s) => (s === "" ? null : Number(s)));
+    .transform((s) => (s !== "" ? null : Number(s)));
 
 const enumField = <const T extends readonly [string, ...string[]]>(values: T, message: string) => {
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: expected { price: null, make: 'Toyota', …(13) } to deeply equal { price: null, make: 'Toyota', …(13) }

[Killed] ConditionalExpression
src/lib/part1-config.ts:121:24
       },
       { message },
     )
-    .transform((s) => (s === "" ? null : Number(s)));
+    .transform((s) => (false ? null : Number(s)));
 
 const enumField = <const T extends readonly [string, ...string[]]>(values: T, message: string) => {
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: expected { price: null, make: 'Toyota', …(13) } to deeply equal { price: null, make: 'Toyota', …(13) }

[Killed] BlockStatement
src/lib/part1-config.ts:123:99
     )
     .transform((s) => (s === "" ? null : Number(s)));
 
-const enumField = <const T extends readonly [string, ...string[]]>(values: T, message: string) => {
-  const allowed = new Set<string>(values);
-  return z
-    .string()
-    .transform((s) => s.trim().toLowerCase())
-    .refine((s) => allowed.has(s), { message })
-    .transform((s) => s as T[number]);
-};
+const enumField = <const T extends readonly [string, ...string[]]>(values: T, message: string) => {};
 
 // --- The schema -----------------------------------------------------------
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: Invalid element at key "fuelType": expected a Zod schema

[Killed] MethodExpression
src/lib/part1-config.ts:127:23
   const allowed = new Set<string>(values);
   return z
     .string()
-    .transform((s) => s.trim().toLowerCase())
+    .transform((s) => s.trim().toUpperCase())
     .refine((s) => allowed.has(s), { message })
     .transform((s) => s as T[number]);
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/lib/part1-config.ts:127:16
   const allowed = new Set<string>(values);
   return z
     .string()
-    .transform((s) => s.trim().toLowerCase())
+    .transform(() => undefined)
     .refine((s) => allowed.has(s), { message })
     .transform((s) => s as T[number]);
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/lib/part1-config.ts:128:13
   return z
     .string()
     .transform((s) => s.trim().toLowerCase())
-    .refine((s) => allowed.has(s), { message })
+    .refine(() => undefined, { message })
     .transform((s) => s as T[number]);
 };
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/lib/part1-config.ts:128:36
   return z
     .string()
     .transform((s) => s.trim().toLowerCase())
-    .refine((s) => allowed.has(s), { message })
+    .refine((s) => allowed.has(s), {})
     .transform((s) => s as T[number]);
 };
killedBy: required fields reject when empty (exact §9 copy) 'fuelType' empty → 'Select the fuel type.'
statusReason: expected 'Invalid input' to be 'Select the fuel type.' // Object.is equality

[Killed] ArrowFunction
src/lib/part1-config.ts:129:16
     .string()
     .transform((s) => s.trim().toLowerCase())
     .refine((s) => allowed.has(s), { message })
-    .transform((s) => s as T[number]);
+    .transform(() => undefined);
 };
 
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: expected { price: null, make: 'Toyota', …(13) } to deeply equal { price: null, make: 'Toyota', …(13) }

[Killed] ArrowFunction
src/lib/part1-config.ts:140:18
     // (upper bound matches the DB column `price numeric(10,2)` — keep them in sync).
     price: z
       .string()
-      .transform((s) => s.trim().replace(",", "."))
+      .transform(() => undefined)
       .refine((s) => s === "" || (/^\d+(\.\d{1,2})?$/.test(s) && Number(s) >= 0 && Number(s) <= 99_999_999.99), {
         message: M.price,
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
src/lib/part1-config.ts:140:25
     // (upper bound matches the DB column `price numeric(10,2)` — keep them in sync).
     price: z
       .string()
-      .transform((s) => s.trim().replace(",", "."))
+      .transform((s) => s.replace(",", "."))
       .refine((s) => s === "" || (/^\d+(\.\d{1,2})?$/.test(s) && Number(s) >= 0 && Number(s) <= 99_999_999.99), {
         message: M.price,

[Killed] ConditionalExpression
src/lib/part1-config.ts:141:35
     price: z
       .string()
       .transform((s) => s.trim().replace(",", "."))
-      .refine((s) => s === "" || (/^\d+(\.\d{1,2})?$/.test(s) && Number(s) >= 0 && Number(s) <= 99_999_999.99), {
+      .refine((s) => s === "" || (true && Number(s) <= 99_999_999.99), {
         message: M.price,
       })
killedBy: field boundaries rejects 'price 3 decimals'
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/lib/part1-config.ts:141:22
     price: z
       .string()
       .transform((s) => s.trim().replace(",", "."))
-      .refine((s) => s === "" || (/^\d+(\.\d{1,2})?$/.test(s) && Number(s) >= 0 && Number(s) <= 99_999_999.99), {
+      .refine((s) => s !== "" || (/^\d+(\.\d{1,2})?$/.test(s) && Number(s) >= 0 && Number(s) <= 99_999_999.99), {
         message: M.price,
       })
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/lib/part1-config.ts:144:18
       .refine((s) => s === "" || (/^\d+(\.\d{1,2})?$/.test(s) && Number(s) >= 0 && Number(s) <= 99_999_999.99), {
         message: M.price,
       })
-      .transform((s) => (s === "" ? null : Number(s))),
+      .transform(() => undefined),
     make: requiredText(M.make, { min: 1, max: 50, capitalize: true }),
     model: requiredText(M.model, { min: 1, max: 60, capitalize: true }),
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: expected { price: undefined, …(14) } to deeply equal { price: null, make: 'Toyota', …(13) }

[Killed] ConditionalExpression
src/lib/part1-config.ts:144:26
       .refine((s) => s === "" || (/^\d+(\.\d{1,2})?$/.test(s) && Number(s) >= 0 && Number(s) <= 99_999_999.99), {
         message: M.price,
       })
-      .transform((s) => (s === "" ? null : Number(s))),
+      .transform((s) => (true ? null : Number(s))),
     make: requiredText(M.make, { min: 1, max: 50, capitalize: true }),
     model: requiredText(M.model, { min: 1, max: 60, capitalize: true }),
killedBy: normalization (rules §8 payload shape) trims + collapses spaces in text, uppercases registration/VIN, lowercases enums
statusReason: expected null to be 24999.99 // Object.is equality

[Killed] BooleanLiteral
src/lib/part1-config.ts:145:63
         message: M.price,
       })
       .transform((s) => (s === "" ? null : Number(s))),
-    make: requiredText(M.make, { min: 1, max: 50, capitalize: true }),
+    make: requiredText(M.make, { min: 1, max: 50, capitalize: false }),
     model: requiredText(M.model, { min: 1, max: 60, capitalize: true }),
     // Year + Registration are OPTIONAL (PRD FR-013 lists only six required fields;
killedBy: normalization (rules §8 payload shape) capitalizes the first letter of make, model, color, address and notes
statusReason: expected 'toyota' to be 'Toyota' // Object.is equality

[Killed] BooleanLiteral
src/lib/part1-config.ts:146:65
       })
       .transform((s) => (s === "" ? null : Number(s))),
     make: requiredText(M.make, { min: 1, max: 50, capitalize: true }),
-    model: requiredText(M.model, { min: 1, max: 60, capitalize: true }),
+    model: requiredText(M.model, { min: 1, max: 60, capitalize: false }),
     // Year + Registration are OPTIONAL (PRD FR-013 lists only six required fields;
     // FR-006 uses them for the tile title only, not the question logic). They still
killedBy: normalization (rules §8 payload shape) capitalizes the first letter of make, model, color, address and notes
statusReason: expected 'corolla cross' to be 'Corolla cross' // Object.is equality

[Killed] BooleanLiteral
src/lib/part1-config.ts:155:18
     registrationNumber: optionalText(M.registrationNumber, {
       min: 2,
       max: 15,
-      uppercase: true,
+      uppercase: false,
       regex: REGISTRATION_RE,
     }),
killedBy: normalization (rules §8 payload shape) trims + collapses spaces in text, uppercases registration/VIN, lowercases enums
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/part1-config.ts:158:84
       uppercase: true,
       regex: REGISTRATION_RE,
     }),
-    vin: optionalText(M.vin, { min: 17, max: 17, collapseSpaces: false, uppercase: true, regex: VIN_RE }),
+    vin: optionalText(M.vin, { min: 17, max: 17, collapseSpaces: false, uppercase: false, regex: VIN_RE }),
     mileage: optionalInt(M.mileage, { min: 0, max: 9_999_999, stripSpaces: true }),
     fuelType: enumField(FUEL_TYPES, M.fuelType),
killedBy: normalization (rules §8 payload shape) trims + collapses spaces in text, uppercases registration/VIN, lowercases enums
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
src/lib/part1-config.ts:158:66
       uppercase: true,
       regex: REGISTRATION_RE,
     }),
-    vin: optionalText(M.vin, { min: 17, max: 17, collapseSpaces: false, uppercase: true, regex: VIN_RE }),
+    vin: optionalText(M.vin, { min: 17, max: 17, collapseSpaces: true, uppercase: true, regex: VIN_RE }),
     mileage: optionalInt(M.mileage, { min: 0, max: 9_999_999, stripSpaces: true }),
     fuelType: enumField(FUEL_TYPES, M.fuelType),

[Killed] BooleanLiteral
src/lib/part1-config.ts:159:76
       regex: REGISTRATION_RE,
     }),
     vin: optionalText(M.vin, { min: 17, max: 17, collapseSpaces: false, uppercase: true, regex: VIN_RE }),
-    mileage: optionalInt(M.mileage, { min: 0, max: 9_999_999, stripSpaces: true }),
+    mileage: optionalInt(M.mileage, { min: 0, max: 9_999_999, stripSpaces: false }),
     fuelType: enumField(FUEL_TYPES, M.fuelType),
     transmission: enumField(TRANSMISSIONS, M.transmission),
killedBy: normalization (rules §8 payload shape) trims + collapses spaces in text, uppercases registration/VIN, lowercases enums
statusReason: expected false to be true // Object.is equality
