[Killed] ObjectLiteral
src/lib/part1-config.ts:159:37
       regex: REGISTRATION_RE,
     }),
     vin: optionalText(M.vin, { min: 17, max: 17, collapseSpaces: false, uppercase: true, regex: VIN_RE }),
-    mileage: optionalInt(M.mileage, { min: 0, max: 9_999_999, stripSpaces: true }),
+    mileage: optionalInt(M.mileage, {}),
     fuelType: enumField(FUEL_TYPES, M.fuelType),
     transmission: enumField(TRANSMISSIONS, M.transmission),
killedBy: normalization (rules §8 payload shape) trims + collapses spaces in text, uppercases registration/VIN, lowercases enums
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/part1-config.ts:163:65
     fuelType: enumField(FUEL_TYPES, M.fuelType),
     transmission: enumField(TRANSMISSIONS, M.transmission),
     drive: enumField(DRIVES, M.drive),
-    color: optionalText(M.color, { min: 1, max: 40, capitalize: true }),
+    color: optionalText(M.color, { min: 1, max: 40, capitalize: false }),
     bodyType: enumField(BODY_TYPES, M.bodyType),
     doorCount: optionalInt(M.doorCount, { min: 0, max: 7 }),
killedBy: normalization (rules §8 payload shape) capitalizes the first letter of make, model, color, address and notes
statusReason: expected 'silver' to be 'Silver' // Object.is equality

[Killed] ObjectLiteral
src/lib/part1-config.ts:163:34
     fuelType: enumField(FUEL_TYPES, M.fuelType),
     transmission: enumField(TRANSMISSIONS, M.transmission),
     drive: enumField(DRIVES, M.drive),
-    color: optionalText(M.color, { min: 1, max: 40, capitalize: true }),
+    color: optionalText(M.color, {}),
     bodyType: enumField(BODY_TYPES, M.bodyType),
     doorCount: optionalInt(M.doorCount, { min: 0, max: 7 }),
killedBy: normalization (rules §8 payload shape) trims + collapses spaces in text, uppercases registration/VIN, lowercases enums
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/lib/part1-config.ts:165:41
     drive: enumField(DRIVES, M.drive),
     color: optionalText(M.color, { min: 1, max: 40, capitalize: true }),
     bodyType: enumField(BODY_TYPES, M.bodyType),
-    doorCount: optionalInt(M.doorCount, { min: 0, max: 7 }),
+    doorCount: optionalInt(M.doorCount, {}),
     address: optionalText(M.address, { min: 5, max: 150, capitalize: true }),
     // Notes preserve internal line breaks; only leading/trailing whitespace is
killedBy: normalization (rules §8 payload shape) trims + collapses spaces in text, uppercases registration/VIN, lowercases enums
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/part1-config.ts:166:70
     color: optionalText(M.color, { min: 1, max: 40, capitalize: true }),
     bodyType: enumField(BODY_TYPES, M.bodyType),
     doorCount: optionalInt(M.doorCount, { min: 0, max: 7 }),
-    address: optionalText(M.address, { min: 5, max: 150, capitalize: true }),
+    address: optionalText(M.address, { min: 5, max: 150, capitalize: false }),
     // Notes preserve internal line breaks; only leading/trailing whitespace is
     // trimmed, then the first letter is capitalized.
killedBy: normalization (rules §8 payload shape) capitalizes the first letter of make, model, color, address and notes
statusReason: expected 'warsaw, poland' to be 'Warsaw, poland' // Object.is equality

[Killed] ObjectLiteral
src/lib/part1-config.ts:166:38
     color: optionalText(M.color, { min: 1, max: 40, capitalize: true }),
     bodyType: enumField(BODY_TYPES, M.bodyType),
     doorCount: optionalInt(M.doorCount, { min: 0, max: 7 }),
-    address: optionalText(M.address, { min: 5, max: 150, capitalize: true }),
+    address: optionalText(M.address, {}),
     // Notes preserve internal line breaks; only leading/trailing whitespace is
     // trimmed, then the first letter is capitalized.
killedBy: normalization (rules §8 payload shape) trims + collapses spaces in text, uppercases registration/VIN, lowercases enums
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/lib/part1-config.ts:171:41
     // trimmed, then the first letter is capitalized.
     notes: z
       .string()
-      .transform((s) => capitalizeFirst(s.trim()))
+      .transform((s) => capitalizeFirst(s))
       .refine((s) => s.length <= 1000, { message: M.notes })
       .transform((s) => (s === "" ? null : s)),
killedBy: normalization (rules §8 payload shape) trims + collapses spaces in text, uppercases registration/VIN, lowercases enums
statusReason: expected '  line1\nline2  ' to be 'Line1\nline2' // Object.is equality

[Killed] ArrowFunction
src/lib/part1-config.ts:171:18
     // trimmed, then the first letter is capitalized.
     notes: z
       .string()
-      .transform((s) => capitalizeFirst(s.trim()))
+      .transform(() => undefined)
       .refine((s) => s.length <= 1000, { message: M.notes })
       .transform((s) => (s === "" ? null : s)),
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/lib/part1-config.ts:172:22
     notes: z
       .string()
       .transform((s) => capitalizeFirst(s.trim()))
-      .refine((s) => s.length <= 1000, { message: M.notes })
+      .refine((s) => s.length < 1000, { message: M.notes })
       .transform((s) => (s === "" ? null : s)),
   })
killedBy: field boundaries accepts 'notes 1000 chars'
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/lib/part1-config.ts:172:15
     notes: z
       .string()
       .transform((s) => capitalizeFirst(s.trim()))
-      .refine((s) => s.length <= 1000, { message: M.notes })
+      .refine(() => undefined, { message: M.notes })
       .transform((s) => (s === "" ? null : s)),
   })
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/part1-config.ts:173:26
       .string()
       .transform((s) => capitalizeFirst(s.trim()))
       .refine((s) => s.length <= 1000, { message: M.notes })
-      .transform((s) => (s === "" ? null : s)),
+      .transform((s) => (true ? null : s)),
   })
   // CF-1: Electric requires Automatic. Surfaced on the transmission field so the
killedBy: normalization (rules §8 payload shape) trims + collapses spaces in text, uppercases registration/VIN, lowercases enums
statusReason: expected null to be 'Line1\nline2' // Object.is equality

[Killed] ConditionalExpression
src/lib/part1-config.ts:173:26
       .string()
       .transform((s) => capitalizeFirst(s.trim()))
       .refine((s) => s.length <= 1000, { message: M.notes })
-      .transform((s) => (s === "" ? null : s)),
+      .transform((s) => (false ? null : s)),
   })
   // CF-1: Electric requires Automatic. Surfaced on the transmission field so the
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: expected { price: null, make: 'Toyota', …(13) } to deeply equal { price: null, make: 'Toyota', …(13) }

[Killed] EqualityOperator
src/lib/part1-config.ts:179:49
   // first-invalid focus/scroll lands somewhere meaningful. Object-level refines
   // run only once all fields parse — which is exactly the case we must catch
   // (electric + manual are each individually valid), so this also drives unlock.
-  .refine((d) => !(d.fuelType === "electric" && d.transmission !== "automatic"), {
+  .refine((d) => !(d.fuelType === "electric" && d.transmission === "automatic"), {
     message: M.crossFieldElectricTransmission,
     path: ["transmission"],
killedBy: CF-1 cross-field — Electric requires Automatic electric + manual is blocked with the exact message on transmission
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/lib/part1-config.ts:179:11
   // first-invalid focus/scroll lands somewhere meaningful. Object-level refines
   // run only once all fields parse — which is exactly the case we must catch
   // (electric + manual are each individually valid), so this also drives unlock.
-  .refine((d) => !(d.fuelType === "electric" && d.transmission !== "automatic"), {
+  .refine(() => undefined, {
     message: M.crossFieldElectricTransmission,
     path: ["transmission"],
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/lib/part1-config.ts:181:12
   // (electric + manual are each individually valid), so this also drives unlock.
   .refine((d) => !(d.fuelType === "electric" && d.transmission !== "automatic"), {
     message: M.crossFieldElectricTransmission,
-    path: ["transmission"],
+    path: [""],
   });
 
killedBy: CF-1 cross-field — Electric requires Automatic electric + manual is blocked with the exact message on transmission
statusReason: expected undefined to be 'Electric cars must use Automatic tran…' // Object.is equality

[Survived] ArrowFunction
src/lib/part1-config.ts:199:9
 // since the field stays text in the form). Fields not listed are left untouched on
 // blur (e.g. enums, numeric inputs, VIN — normalized on Save only).
 const BLUR_NORMALIZERS: Partial<Record<Part1Field, (s: string) => string>> = {
-  make: (s) => capitalizeFirst(collapse(s)),
+  make: () => undefined,
   model: (s) => capitalizeFirst(collapse(s)),
   registrationNumber: (s) => collapse(s).toUpperCase(),

[Survived] ArrowFunction
src/lib/part1-config.ts:200:10
 // blur (e.g. enums, numeric inputs, VIN — normalized on Save only).
 const BLUR_NORMALIZERS: Partial<Record<Part1Field, (s: string) => string>> = {
   make: (s) => capitalizeFirst(collapse(s)),
-  model: (s) => capitalizeFirst(collapse(s)),
+  model: () => undefined,
   registrationNumber: (s) => collapse(s).toUpperCase(),
   color: (s) => capitalizeFirst(collapse(s)),

[NoCoverage] MethodExpression
src/lib/part1-config.ts:201:30
 const BLUR_NORMALIZERS: Partial<Record<Part1Field, (s: string) => string>> = {
   make: (s) => capitalizeFirst(collapse(s)),
   model: (s) => capitalizeFirst(collapse(s)),
-  registrationNumber: (s) => collapse(s).toUpperCase(),
+  registrationNumber: (s) => collapse(s).toLowerCase(),
   color: (s) => capitalizeFirst(collapse(s)),
   address: (s) => capitalizeFirst(collapse(s)),

[Survived] ArrowFunction
src/lib/part1-config.ts:201:23
 const BLUR_NORMALIZERS: Partial<Record<Part1Field, (s: string) => string>> = {
   make: (s) => capitalizeFirst(collapse(s)),
   model: (s) => capitalizeFirst(collapse(s)),
-  registrationNumber: (s) => collapse(s).toUpperCase(),
+  registrationNumber: () => undefined,
   color: (s) => capitalizeFirst(collapse(s)),
   address: (s) => capitalizeFirst(collapse(s)),

[Survived] ArrowFunction
src/lib/part1-config.ts:202:10
   make: (s) => capitalizeFirst(collapse(s)),
   model: (s) => capitalizeFirst(collapse(s)),
   registrationNumber: (s) => collapse(s).toUpperCase(),
-  color: (s) => capitalizeFirst(collapse(s)),
+  color: () => undefined,
   address: (s) => capitalizeFirst(collapse(s)),
   notes: (s) => capitalizeFirst(s.trim()),

[Survived] ArrowFunction
src/lib/part1-config.ts:203:12
   model: (s) => capitalizeFirst(collapse(s)),
   registrationNumber: (s) => collapse(s).toUpperCase(),
   color: (s) => capitalizeFirst(collapse(s)),
-  address: (s) => capitalizeFirst(collapse(s)),
+  address: () => undefined,
   notes: (s) => capitalizeFirst(s.trim()),
 };

[NoCoverage] MethodExpression
src/lib/part1-config.ts:204:33
   registrationNumber: (s) => collapse(s).toUpperCase(),
   color: (s) => capitalizeFirst(collapse(s)),
   address: (s) => capitalizeFirst(collapse(s)),
-  notes: (s) => capitalizeFirst(s.trim()),
+  notes: (s) => capitalizeFirst(s),
 };
 

[Survived] ArrowFunction
src/lib/part1-config.ts:204:10
   registrationNumber: (s) => collapse(s).toUpperCase(),
   color: (s) => capitalizeFirst(collapse(s)),
   address: (s) => capitalizeFirst(collapse(s)),
-  notes: (s) => capitalizeFirst(s.trim()),
+  notes: () => undefined,
 };
 

[NoCoverage] BlockStatement
src/lib/part1-config.ts:213:80
  * Color/Address → collapse; Notes → trim). Returns the value unchanged for fields
  * without a blur normalizer.
  */
-export function normalizeFieldOnBlur(field: Part1Field, value: string): string {
-  const fn = BLUR_NORMALIZERS[field];
-  return fn ? fn(value) : value;
-}
+export function normalizeFieldOnBlur(field: Part1Field, value: string): string {}
 
 /**

[Killed] BlockStatement
src/lib/part1-config.ts:223:73
  * payload ready for `saveInspection`. On failure, `errors` maps each invalid
  * field to its (first) message — UX-1 renders these inline.
  */
-export function validatePart1(input: Part1Input): Part1ValidationResult {
-  const result = part1ConfigSchema.safeParse(input);
-  if (result.success) return { ok: true, config: result.data };
-  const errors: Partial<Record<Part1Field, string>> = {};
-  for (const issue of result.error.issues) {
-    const key = issue.path[0];
-    if (typeof key === "string" && !(key in errors)) {
-      errors[key as Part1Field] = issue.message;
-    }
-  }
-  return { ok: false, errors };
-}
+export function validatePart1(input: Part1Input): Part1ValidationResult {}
 
 /**
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] ConditionalExpression
src/lib/part1-config.ts:225:7
  */
 export function validatePart1(input: Part1Input): Part1ValidationResult {
   const result = part1ConfigSchema.safeParse(input);
-  if (result.success) return { ok: true, config: result.data };
+  if (true) return { ok: true, config: result.data };
   const errors: Partial<Record<Part1Field, string>> = {};
   for (const issue of result.error.issues) {
killedBy: required fields reject when empty (exact §9 copy) 'make' empty → 'Enter the car make.'
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/lib/part1-config.ts:225:36
  */
 export function validatePart1(input: Part1Input): Part1ValidationResult {
   const result = part1ConfigSchema.safeParse(input);
-  if (result.success) return { ok: true, config: result.data };
+  if (result.success) return { ok: false, config: result.data };
   const errors: Partial<Record<Part1Field, string>> = {};
   for (const issue of result.error.issues) {
killedBy: validatePart1 — happy path accepts the six required fields with all optionals empty
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/part1-config.ts:227:44
   const result = part1ConfigSchema.safeParse(input);
   if (result.success) return { ok: true, config: result.data };
   const errors: Partial<Record<Part1Field, string>> = {};
-  for (const issue of result.error.issues) {
-    const key = issue.path[0];
-    if (typeof key === "string" && !(key in errors)) {
-      errors[key as Part1Field] = issue.message;
-    }
-  }
+  for (const issue of result.error.issues) {}
   return { ok: false, errors };
 }
killedBy: required fields reject when empty (exact §9 copy) 'make' empty → 'Enter the car make.'
statusReason: expected undefined to be 'Enter the car make.' // Object.is equality

[Killed] ConditionalExpression
src/lib/part1-config.ts:229:9
   const errors: Partial<Record<Part1Field, string>> = {};
   for (const issue of result.error.issues) {
     const key = issue.path[0];
-    if (typeof key === "string" && !(key in errors)) {
+    if (false) {
       errors[key as Part1Field] = issue.message;
     }
killedBy: required fields reject when empty (exact §9 copy) 'make' empty → 'Enter the car make.'
statusReason: expected undefined to be 'Enter the car make.' // Object.is equality

[Killed] BlockStatement
src/lib/part1-config.ts:229:54
   const errors: Partial<Record<Part1Field, string>> = {};
   for (const issue of result.error.issues) {
     const key = issue.path[0];
-    if (typeof key === "string" && !(key in errors)) {
-      errors[key as Part1Field] = issue.message;
-    }
+    if (typeof key === "string" && !(key in errors)) {}
   }
   return { ok: false, errors };
killedBy: required fields reject when empty (exact §9 copy) 'make' empty → 'Enter the car make.'
statusReason: expected undefined to be 'Enter the car make.' // Object.is equality

[Killed] BooleanLiteral
src/lib/part1-config.ts:233:16
       errors[key as Part1Field] = issue.message;
     }
   }
-  return { ok: false, errors };
+  return { ok: true, errors };
 }
 
killedBy: required fields reject when empty (exact §9 copy) 'make' empty → 'Enter the car make.'
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/lib/part1-config.ts:233:10
       errors[key as Part1Field] = issue.message;
     }
   }
-  return { ok: false, errors };
+  return {};
 }
 
killedBy: required fields reject when empty (exact §9 copy) 'make' empty → 'Enter the car make.'
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/lib/part1-config.ts:243:62
  * fails CF-1, so a presence-only predicate would wrongly unlock. Derived purely
  * from current values, so re-editing an invalid required field re-locks (CF-3).
  */
-export function isConfigUnlocked(input: Part1Input): boolean {
-  return part1ConfigSchema.safeParse(input).success;
-}
+export function isConfigUnlocked(input: Part1Input): boolean {}
 
 /** A camelCased inspection row's config columns as loaded from the DB (mixed types, nullable). */
killedBy: isConfigUnlocked predicate true when all six required valid and optionals empty
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/lib/part1-config.ts:256:55
  * code (e.g. the session route's unlock gate) reuse `validatePart1`/`isConfigUnlocked`
  * against a persisted row without re-implementing the stringify.
  */
-export function rowToInput(row: Part1Row): Part1Input {
-  const s = (v: string | number | null | undefined): string => (v === null || v === undefined ? "" : String(v));
-  return {
-    price: s(row.price),
-    make: s(row.make),
-    model: s(row.model),
-    year: s(row.year),
-    registrationNumber: s(row.registrationNumber),
-    vin: s(row.vin),
-    mileage: s(row.mileage),
-    fuelType: s(row.fuelType),
-    transmission: s(row.transmission),
-    drive: s(row.drive),
-    color: s(row.color),
-    bodyType: s(row.bodyType),
-    doorCount: s(row.doorCount),
-    address: s(row.address),
-    notes: s(row.notes),
-  };
-}
+export function rowToInput(row: Part1Row): Part1Input {}
 
killedBy: rowToInput + isConfigUnlocked — the S-04 session-route gate unlocks the hub for a valid persisted config row (numbers + nulls tolerated)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/part1-config.ts:257:65
  * against a persisted row without re-implementing the stringify.
  */
 export function rowToInput(row: Part1Row): Part1Input {
-  const s = (v: string | number | null | undefined): string => (v === null || v === undefined ? "" : String(v));
+  const s = (v: string | number | null | undefined): string => (v !== null || v === undefined ? "" : String(v));
   return {
     price: s(row.price),
killedBy: rowToInput + isConfigUnlocked — the S-04 session-route gate unlocks the hub for a valid persisted config row (numbers + nulls tolerated)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/part1-config.ts:257:65
  * against a persisted row without re-implementing the stringify.
  */
 export function rowToInput(row: Part1Row): Part1Input {
-  const s = (v: string | number | null | undefined): string => (v === null || v === undefined ? "" : String(v));
+  const s = (v: string | number | null | undefined): string => (false ? "" : String(v));
   return {
     price: s(row.price),
killedBy: rowToInput + isConfigUnlocked — the S-04 session-route gate unlocks the hub for a valid persisted config row (numbers + nulls tolerated)
statusReason: expected false to be true // Object.is equality
