[Survived] ArrayDeclaration
src/lib/questions.ts:32:29
 
 // --- Catalogue schema (the drift guard) -----------------------------------
 
-const partIdSchema = z.enum(["part2", "part3", "part4", "part5"]);
+const partIdSchema = z.enum([]);
 const fuelTypeSchema = z.enum(["petrol", "diesel", "hybrid", "electric"]);
 const transmissionSchema = z.enum(["manual", "automatic"]);

[Survived] StringLiteral
src/lib/questions.ts:32:48
 
 // --- Catalogue schema (the drift guard) -----------------------------------
 
-const partIdSchema = z.enum(["part2", "part3", "part4", "part5"]);
+const partIdSchema = z.enum(["part2", "part3", "", "part5"]);
 const fuelTypeSchema = z.enum(["petrol", "diesel", "hybrid", "electric"]);
 const transmissionSchema = z.enum(["manual", "automatic"]);

[Survived] StringLiteral
src/lib/questions.ts:33:42
 // --- Catalogue schema (the drift guard) -----------------------------------
 
 const partIdSchema = z.enum(["part2", "part3", "part4", "part5"]);
-const fuelTypeSchema = z.enum(["petrol", "diesel", "hybrid", "electric"]);
+const fuelTypeSchema = z.enum(["petrol", "", "hybrid", "electric"]);
 const transmissionSchema = z.enum(["manual", "automatic"]);
 const driveSchema = z.enum(["2wd", "4wd"]);

[Survived] ArrayDeclaration
src/lib/questions.ts:34:35
 
 const partIdSchema = z.enum(["part2", "part3", "part4", "part5"]);
 const fuelTypeSchema = z.enum(["petrol", "diesel", "hybrid", "electric"]);
-const transmissionSchema = z.enum(["manual", "automatic"]);
+const transmissionSchema = z.enum([]);
 const driveSchema = z.enum(["2wd", "4wd"]);
 const bodyTypeSchema = z.enum(["sedan", "hatchback", "suv", "coupe", "convertible", "van", "pickup", "other"]);

[Survived] StringLiteral
src/lib/questions.ts:35:29
 const partIdSchema = z.enum(["part2", "part3", "part4", "part5"]);
 const fuelTypeSchema = z.enum(["petrol", "diesel", "hybrid", "electric"]);
 const transmissionSchema = z.enum(["manual", "automatic"]);
-const driveSchema = z.enum(["2wd", "4wd"]);
+const driveSchema = z.enum(["", "4wd"]);
 const bodyTypeSchema = z.enum(["sedan", "hatchback", "suv", "coupe", "convertible", "van", "pickup", "other"]);
 // The 5 runtime equipment flags, canonically spelled (note the all-caps `EU` in

[Survived] StringLiteral
src/lib/questions.ts:36:92
 const fuelTypeSchema = z.enum(["petrol", "diesel", "hybrid", "electric"]);
 const transmissionSchema = z.enum(["manual", "automatic"]);
 const driveSchema = z.enum(["2wd", "4wd"]);
-const bodyTypeSchema = z.enum(["sedan", "hatchback", "suv", "coupe", "convertible", "van", "pickup", "other"]);
+const bodyTypeSchema = z.enum(["sedan", "hatchback", "suv", "coupe", "convertible", "van", "", "other"]);
 // The 5 runtime equipment flags, canonically spelled (note the all-caps `EU` in
 // `importedFromEU` — see the casing gotcha on FLAG_COLUMN_MAP). This enum is the

[Survived] StringLiteral
src/lib/questions.ts:36:102
 const fuelTypeSchema = z.enum(["petrol", "diesel", "hybrid", "electric"]);
 const transmissionSchema = z.enum(["manual", "automatic"]);
 const driveSchema = z.enum(["2wd", "4wd"]);
-const bodyTypeSchema = z.enum(["sedan", "hatchback", "suv", "coupe", "convertible", "van", "pickup", "other"]);
+const bodyTypeSchema = z.enum(["sedan", "hatchback", "suv", "coupe", "convertible", "van", "pickup", ""]);
 // The 5 runtime equipment flags, canonically spelled (note the all-caps `EU` in
 // `importedFromEU` — see the casing gotcha on FLAG_COLUMN_MAP). This enum is the

[Survived] ArrayDeclaration
src/lib/questions.ts:40:34
 // The 5 runtime equipment flags, canonically spelled (note the all-caps `EU` in
 // `importedFromEU` — see the casing gotcha on FLAG_COLUMN_MAP). This enum is the
 // validation guard; the iterable list of flags comes from the parsed data (RUNTIME_FLAGS).
-const runtimeFlagSchema = z.enum([
-  "chargingPortEquipped",
-  "evBatteryDocsAvailable",
-  "turboEquipped",
-  "mechanicalCompressorEquipped",
-  "importedFromEU",
-]);
+const runtimeFlagSchema = z.enum([]);
 
 const visibleWhenSchema = z.object({

[Survived] StringLiteral
src/lib/questions.ts:42:3
 // validation guard; the iterable list of flags comes from the parsed data (RUNTIME_FLAGS).
 const runtimeFlagSchema = z.enum([
   "chargingPortEquipped",
-  "evBatteryDocsAvailable",
+  "",
   "turboEquipped",
   "mechanicalCompressorEquipped",

[Survived] StringLiteral
src/lib/questions.ts:43:3
 const runtimeFlagSchema = z.enum([
   "chargingPortEquipped",
   "evBatteryDocsAvailable",
-  "turboEquipped",
+  "",
   "mechanicalCompressorEquipped",
   "importedFromEU",

[Survived] StringLiteral
src/lib/questions.ts:44:3
   "chargingPortEquipped",
   "evBatteryDocsAvailable",
   "turboEquipped",
-  "mechanicalCompressorEquipped",
+  "",
   "importedFromEU",
 ]);

[Survived] MethodExpression
src/lib/questions.ts:49:13
 ]);
 
 const visibleWhenSchema = z.object({
-  fuelType: z.array(fuelTypeSchema).min(1).optional(),
+  fuelType: z.array(fuelTypeSchema).max(1).optional(),
   transmission: z.array(transmissionSchema).min(1).optional(),
   drive: z.array(driveSchema).min(1).optional(),

[Survived] MethodExpression
src/lib/questions.ts:50:17
 
 const visibleWhenSchema = z.object({
   fuelType: z.array(fuelTypeSchema).min(1).optional(),
-  transmission: z.array(transmissionSchema).min(1).optional(),
+  transmission: z.array(transmissionSchema).max(1).optional(),
   drive: z.array(driveSchema).min(1).optional(),
   bodyType: z.array(bodyTypeSchema).min(1).optional(),

[Survived] MethodExpression
src/lib/questions.ts:51:10
 const visibleWhenSchema = z.object({
   fuelType: z.array(fuelTypeSchema).min(1).optional(),
   transmission: z.array(transmissionSchema).min(1).optional(),
-  drive: z.array(driveSchema).min(1).optional(),
+  drive: z.array(driveSchema).max(1).optional(),
   bodyType: z.array(bodyTypeSchema).min(1).optional(),
 });

[Survived] MethodExpression
src/lib/questions.ts:52:13
   fuelType: z.array(fuelTypeSchema).min(1).optional(),
   transmission: z.array(transmissionSchema).min(1).optional(),
   drive: z.array(driveSchema).min(1).optional(),
-  bodyType: z.array(bodyTypeSchema).min(1).optional(),
+  bodyType: z.array(bodyTypeSchema).max(1).optional(),
 });
 

[Survived] Regex
src/lib/questions.ts:56:24
 });
 
 const questionGroupSchema = z.object({
-  id: z.string().regex(/^g_.+$/),
+  id: z.string().regex(/^g_.$/),
   part: partIdSchema,
   order: z.number().int(),

[Survived] MethodExpression
src/lib/questions.ts:59:12
   id: z.string().regex(/^g_.+$/),
   part: partIdSchema,
   order: z.number().int(),
-  section: z.string().min(1),
+  section: z.string().max(1),
   subsection: z.string().nullable(),
   dependsOnFields: z.array(z.enum(["fuelType", "transmission", "drive", "bodyType"])),

[Survived] StringLiteral
src/lib/questions.ts:61:73
   order: z.number().int(),
   section: z.string().min(1),
   subsection: z.string().nullable(),
-  dependsOnFields: z.array(z.enum(["fuelType", "transmission", "drive", "bodyType"])),
+  dependsOnFields: z.array(z.enum(["fuelType", "transmission", "drive", ""])),
   visibleWhen: visibleWhenSchema,
   requiresEquipmentFlag: runtimeFlagSchema.optional(),

[Survived] MethodExpression
src/lib/questions.ts:68:12
 
 const visibilityModelSchema = z.object({
   type: z.literal("additive-buckets"),
-  formula: z.array(z.enum(["base", "fuelType", "transmission", "drive", "bodyType"])).min(5),
+  formula: z.array(z.enum(["base", "fuelType", "transmission", "drive", "bodyType"])).max(5),
   emptyBuckets: z.object({
     drive: z.array(driveSchema),

[Survived] ArrayDeclaration
src/lib/questions.ts:68:27
 
 const visibilityModelSchema = z.object({
   type: z.literal("additive-buckets"),
-  formula: z.array(z.enum(["base", "fuelType", "transmission", "drive", "bodyType"])).min(5),
+  formula: z.array(z.enum([])).min(5),
   emptyBuckets: z.object({
     drive: z.array(driveSchema),

[Survived] MethodExpression
src/lib/questions.ts:73:17
     drive: z.array(driveSchema),
     bodyType: z.array(bodyTypeSchema),
   }),
-  runtimeFlags: z.array(runtimeFlagSchema).min(1),
+  runtimeFlags: z.array(runtimeFlagSchema).max(1),
 });
 

[Survived] MethodExpression
src/lib/questions.ts:78:15
 
 const mappingConfigSchema = z.object({
   version: z.literal(1),
-  sourceFile: z.string().min(1),
+  sourceFile: z.string().max(1),
   visibilityModel: visibilityModelSchema,
   questionGroups: z.array(questionGroupSchema),

[Killed] ObjectLiteral
src/lib/questions.ts:83:33
   questionGroups: z.array(questionGroupSchema),
 });
 
-const questionSchema = z.object({
-  id: z.string().regex(/^q_.+$/),
-  groupId: z.string().regex(/^g_.+$/),
-  part: partIdSchema,
-  section: z.string().min(1),
-  subsection: z.string().nullable(),
-  label: z.string().min(1),
-  order: z.number().int(),
-  explanationRef: z
-    .string()
-    .regex(/^exp_.+$/)
-    .optional(),
-});
+const questionSchema = z.object({});
 
 const explanationEntrySchema = z.object({
killedBy: full axis-config matrix reconciles against the catalogue oracle petrol/manual/2wd/sedan: engine visible question ids equal the oracle
statusReason: expected Set{} to deeply equal Set{ …(128) }

[Survived] Regex
src/lib/questions.ts:84:24
 });
 
 const questionSchema = z.object({
-  id: z.string().regex(/^q_.+$/),
+  id: z.string().regex(/^q_.+/),
   groupId: z.string().regex(/^g_.+$/),
   part: partIdSchema,

[Survived] Regex
src/lib/questions.ts:85:29
 
 const questionSchema = z.object({
   id: z.string().regex(/^q_.+$/),
-  groupId: z.string().regex(/^g_.+$/),
+  groupId: z.string().regex(/g_.+$/),
   part: partIdSchema,
   section: z.string().min(1),

[Survived] Regex
src/lib/questions.ts:85:29
 
 const questionSchema = z.object({
   id: z.string().regex(/^q_.+$/),
-  groupId: z.string().regex(/^g_.+$/),
+  groupId: z.string().regex(/^g_.$/),
   part: partIdSchema,
   section: z.string().min(1),

[Survived] MethodExpression
src/lib/questions.ts:87:12
   id: z.string().regex(/^q_.+$/),
   groupId: z.string().regex(/^g_.+$/),
   part: partIdSchema,
-  section: z.string().min(1),
+  section: z.string().max(1),
   subsection: z.string().nullable(),
   label: z.string().min(1),

[Survived] MethodExpression
src/lib/questions.ts:89:10
   part: partIdSchema,
   section: z.string().min(1),
   subsection: z.string().nullable(),
-  label: z.string().min(1),
+  label: z.string().max(1),
   order: z.number().int(),
   explanationRef: z

[Survived] Regex
src/lib/questions.ts:93:12
   order: z.number().int(),
   explanationRef: z
     .string()
-    .regex(/^exp_.+$/)
+    .regex(/^exp_.+/)
     .optional(),
 });

[Survived] MethodExpression
src/lib/questions.ts:98:17
 });
 
 const explanationEntrySchema = z.object({
-  legacyNumber: z.number().int().min(1),
+  legacyNumber: z.number().int().max(1),
   text: z.string().min(1),
 });

[Survived] MethodExpression
src/lib/questions.ts:99:9
 
 const explanationEntrySchema = z.object({
   legacyNumber: z.number().int().min(1),
-  text: z.string().min(1),
+  text: z.string().max(1),
 });
 

[Survived] MethodExpression
src/lib/questions.ts:105:19
 const questionBankSchema = z.object({
   version: z.literal(1),
   sourceFile: z.string().min(1),
-  allowedAnswers: z.array(z.enum(["yes", "no", "dont_know"])).min(1),
+  allowedAnswers: z.array(z.enum(["yes", "no", "dont_know"])).max(1),
   questions: z.array(questionSchema),
   explanations: z.record(z.string().regex(/^exp_.+$/), explanationEntrySchema),

[Survived] ArrayDeclaration
src/lib/questions.ts:105:34
 const questionBankSchema = z.object({
   version: z.literal(1),
   sourceFile: z.string().min(1),
-  allowedAnswers: z.array(z.enum(["yes", "no", "dont_know"])).min(1),
+  allowedAnswers: z.array(z.enum([])).min(1),
   questions: z.array(questionSchema),
   explanations: z.record(z.string().regex(/^exp_.+$/), explanationEntrySchema),

[Survived] Regex
src/lib/questions.ts:107:43
   sourceFile: z.string().min(1),
   allowedAnswers: z.array(z.enum(["yes", "no", "dont_know"])).min(1),
   questions: z.array(questionSchema),
-  explanations: z.record(z.string().regex(/^exp_.+$/), explanationEntrySchema),
+  explanations: z.record(z.string().regex(/^exp_.$/), explanationEntrySchema),
 });
 

[Survived] Regex
src/lib/questions.ts:107:43
   sourceFile: z.string().min(1),
   allowedAnswers: z.array(z.enum(["yes", "no", "dont_know"])).min(1),
   questions: z.array(questionSchema),
-  explanations: z.record(z.string().regex(/^exp_.+$/), explanationEntrySchema),
+  explanations: z.record(z.string().regex(/exp_.+$/), explanationEntrySchema),
 });
 

[Survived] BlockStatement
src/lib/questions.ts:138:82
  * deliberately malformed catalogue and assert this throws — the same call runs at module
  * load below on the real data, which is the drift guard.
  */
-export function parseCatalogue(bankRaw: unknown, mappingRaw: unknown): Catalogue {
-  const bank = questionBankSchema.parse(bankRaw);
-  const mapping = mappingConfigSchema.parse(mappingRaw);
-  return {
-    groups: mapping.questionGroups,
-    questions: bank.questions,
-    explanations: bank.explanations,
-    runtimeFlags: mapping.visibilityModel.runtimeFlags,
-  };
-}
+export function parseCatalogue(bankRaw: unknown, mappingRaw: unknown): Catalogue {}
 
 // Recursively freeze so the frozen catalogue cannot be mutated by any consumer.

[Survived] BlockStatement
src/lib/questions.ts:150:37
 }
 
 // Recursively freeze so the frozen catalogue cannot be mutated by any consumer.
-function deepFreeze<T>(value: T): T {
-  if (value && typeof value === "object" && !Object.isFrozen(value)) {
-    Object.freeze(value);
-    for (const v of Object.values(value as Record<string, unknown>)) deepFreeze(v);
-  }
-  return value;
-}
+function deepFreeze<T>(value: T): T {}
 
 const CATALOGUE = deepFreeze(parseCatalogue(bankJson, mappingJson));

[Killed] BooleanLiteral
src/lib/questions.ts:151:45
 
 // Recursively freeze so the frozen catalogue cannot be mutated by any consumer.
 function deepFreeze<T>(value: T): T {
-  if (value && typeof value === "object" && !Object.isFrozen(value)) {
+  if (value && typeof value === "object" && Object.isFrozen(value)) {
     Object.freeze(value);
     for (const v of Object.values(value as Record<string, unknown>)) deepFreeze(v);
killedBy: frozen catalogue & stable counts hands out a deeply frozen catalogue (no consumer can mutate it)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/questions.ts:151:7
 
 // Recursively freeze so the frozen catalogue cannot be mutated by any consumer.
 function deepFreeze<T>(value: T): T {
-  if (value && typeof value === "object" && !Object.isFrozen(value)) {
+  if (false) {
     Object.freeze(value);
     for (const v of Object.values(value as Record<string, unknown>)) deepFreeze(v);
killedBy: frozen catalogue & stable counts hands out a deeply frozen catalogue (no consumer can mutate it)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/questions.ts:201:12
   group: QuestionGroup,
   config: VisibilityConfig,
   activeFlags: ReadonlySet<RuntimeFlag>,
-): boolean {
-  for (const [axis, allowed] of Object.entries(group.visibleWhen)) {
-    const v = config[axis as keyof VisibilityConfig];
-    if (!v || !(allowed as string[]).includes(v)) return false;
-  }
-  if (group.requiresEquipmentFlag && !activeFlags.has(group.requiresEquipmentFlag)) return false;
-  return true;
-}
+): boolean {}
 
 /** The camelCased inspection columns the visibility predicate reads as its config axes. */
killedBy: base groups (visibleWhen {}) are the only groups visible for an empty config with no flags
statusReason: expected [] to have a length of 20 but got +0

[Killed] BlockStatement
src/lib/questions.ts:202:68
   config: VisibilityConfig,
   activeFlags: ReadonlySet<RuntimeFlag>,
 ): boolean {
-  for (const [axis, allowed] of Object.entries(group.visibleWhen)) {
-    const v = config[axis as keyof VisibilityConfig];
-    if (!v || !(allowed as string[]).includes(v)) return false;
-  }
+  for (const [axis, allowed] of Object.entries(group.visibleWhen)) {}
   if (group.requiresEquipmentFlag && !activeFlags.has(group.requiresEquipmentFlag)) return false;
   return true;
killedBy: base groups (visibleWhen {}) are the only groups visible for an empty config with no flags
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/questions.ts:204:15
 ): boolean {
   for (const [axis, allowed] of Object.entries(group.visibleWhen)) {
     const v = config[axis as keyof VisibilityConfig];
-    if (!v || !(allowed as string[]).includes(v)) return false;
+    if (!v || (allowed as string[]).includes(v)) return false;
   }
   if (group.requiresEquipmentFlag && !activeFlags.has(group.requiresEquipmentFlag)) return false;
killedBy: base groups (visibleWhen {}) returns the petrol/manual/2wd/sedan groups in the exact authored order
statusReason: expected [ …(37) ] to deeply equal [ …(30) ]

[Killed] ConditionalExpression
src/lib/questions.ts:204:9
 ): boolean {
   for (const [axis, allowed] of Object.entries(group.visibleWhen)) {
     const v = config[axis as keyof VisibilityConfig];
-    if (!v || !(allowed as string[]).includes(v)) return false;
+    if (true) return false;
   }
   if (group.requiresEquipmentFlag && !activeFlags.has(group.requiresEquipmentFlag)) return false;
killedBy: base groups (visibleWhen {}) returns the petrol/manual/2wd/sedan groups in the exact authored order
statusReason: expected [ …(20) ] to deeply equal [ …(30) ]

[Killed] BooleanLiteral
src/lib/questions.ts:206:38
     const v = config[axis as keyof VisibilityConfig];
     if (!v || !(allowed as string[]).includes(v)) return false;
   }
-  if (group.requiresEquipmentFlag && !activeFlags.has(group.requiresEquipmentFlag)) return false;
+  if (group.requiresEquipmentFlag && activeFlags.has(group.requiresEquipmentFlag)) return false;
   return true;
 }
killedBy: base groups (visibleWhen {}) are the only groups visible for an empty config with no flags
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/questions.ts:206:7
     const v = config[axis as keyof VisibilityConfig];
     if (!v || !(allowed as string[]).includes(v)) return false;
   }
-  if (group.requiresEquipmentFlag && !activeFlags.has(group.requiresEquipmentFlag)) return false;
+  if (false) return false;
   return true;
 }
killedBy: base groups (visibleWhen {}) are the only groups visible for an empty config with no flags
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/questions.ts:207:10
     if (!v || !(allowed as string[]).includes(v)) return false;
   }
   if (group.requiresEquipmentFlag && !activeFlags.has(group.requiresEquipmentFlag)) return false;
-  return true;
+  return false;
 }
 
killedBy: base groups (visibleWhen {}) are the only groups visible for an empty config with no flags
statusReason: expected [] to have a length of 20 but got +0

[NoCoverage] BlockStatement
src/lib/questions.ts:219:82
  * enum member, so this is the one place that narrows the DB-side `string | null` to the
  * predicate's enum domain (`null` → `undefined`, i.e. an unset axis that fails its predicate).
  */
-export function configFromInspection(row: InspectionConfigRow): VisibilityConfig {
-  return {
-    fuelType: (row.fuelType ?? undefined) as VisibilityConfig["fuelType"],
-    transmission: (row.transmission ?? undefined) as VisibilityConfig["transmission"],
-    drive: (row.drive ?? undefined) as VisibilityConfig["drive"],
-    bodyType: (row.bodyType ?? undefined) as VisibilityConfig["bodyType"],
-  };
-}
+export function configFromInspection(row: InspectionConfigRow): VisibilityConfig {}
 
 /** Groups visible for `(config, flags)`, sorted by `order`. */

[Killed] BlockStatement
src/lib/questions.ts:229:113
 }
 
 /** Groups visible for `(config, flags)`, sorted by `order`. */
-export function selectVisibleGroups(config: VisibilityConfig, flags: ReadonlySet<RuntimeFlag>): QuestionGroup[] {
-  return CATALOGUE.groups.filter((g) => isGroupVisible(g, config, flags)).sort((a, b) => a.order - b.order);
-}
+export function selectVisibleGroups(config: VisibilityConfig, flags: ReadonlySet<RuntimeFlag>): QuestionGroup[] {}
 
 /**
killedBy: base groups (visibleWhen {}) are the only groups visible for an empty config with no flags
statusReason: Cannot read properties of undefined (reading 'every')

[Killed] MethodExpression
src/lib/questions.ts:230:10
 
 /** Groups visible for `(config, flags)`, sorted by `order`. */
 export function selectVisibleGroups(config: VisibilityConfig, flags: ReadonlySet<RuntimeFlag>): QuestionGroup[] {
-  return CATALOGUE.groups.filter((g) => isGroupVisible(g, config, flags)).sort((a, b) => a.order - b.order);
+  return CATALOGUE.groups.sort((a, b) => a.order - b.order);
 }
 
killedBy: base groups (visibleWhen {}) are the only groups visible for an empty config with no flags
statusReason: Cannot assign to read only property '0' of object '[object Array]'

[Killed] ArrowFunction
src/lib/questions.ts:230:34
 
 /** Groups visible for `(config, flags)`, sorted by `order`. */
 export function selectVisibleGroups(config: VisibilityConfig, flags: ReadonlySet<RuntimeFlag>): QuestionGroup[] {
-  return CATALOGUE.groups.filter((g) => isGroupVisible(g, config, flags)).sort((a, b) => a.order - b.order);
+  return CATALOGUE.groups.filter(() => undefined).sort((a, b) => a.order - b.order);
 }
 
killedBy: base groups (visibleWhen {}) are the only groups visible for an empty config with no flags
statusReason: expected [] to have a length of 20 but got +0

[Killed] BlockStatement
src/lib/questions.ts:237:114
  * The visible questions' `q_…` IDs. **The single source of truth for visibility** that
  * S-07 will re-run and diff.
  */
-export function selectVisibleQuestionIds(config: VisibilityConfig, flags: ReadonlySet<RuntimeFlag>): Set<string> {
-  const visibleGroupIds = new Set(selectVisibleGroups(config, flags).map((g) => g.id));
-  const ids = new Set<string>();
-  for (const q of CATALOGUE.questions) if (visibleGroupIds.has(q.groupId)) ids.add(q.id);
-  return ids;
-}
+export function selectVisibleQuestionIds(config: VisibilityConfig, flags: ReadonlySet<RuntimeFlag>): Set<string> {}
 
 /** Per-Part visible question counts for the session nav. */
killedBy: empty buckets add nothing 2wd and sedan contribute no extra groups
statusReason: a is not iterable

[Killed] ArrowFunction
src/lib/questions.ts:238:74
  * S-07 will re-run and diff.
  */
 export function selectVisibleQuestionIds(config: VisibilityConfig, flags: ReadonlySet<RuntimeFlag>): Set<string> {
-  const visibleGroupIds = new Set(selectVisibleGroups(config, flags).map((g) => g.id));
+  const visibleGroupIds = new Set(selectVisibleGroups(config, flags).map(() => undefined));
   const ids = new Set<string>();
   for (const q of CATALOGUE.questions) if (visibleGroupIds.has(q.groupId)) ids.add(q.id);
killedBy: full axis-config matrix reconciles against the catalogue oracle petrol/manual/2wd/sedan: engine visible question ids equal the oracle
statusReason: expected Set{} to deeply equal Set{ …(128) }

[Killed] ConditionalExpression
src/lib/questions.ts:240:44
 export function selectVisibleQuestionIds(config: VisibilityConfig, flags: ReadonlySet<RuntimeFlag>): Set<string> {
   const visibleGroupIds = new Set(selectVisibleGroups(config, flags).map((g) => g.id));
   const ids = new Set<string>();
-  for (const q of CATALOGUE.questions) if (visibleGroupIds.has(q.groupId)) ids.add(q.id);
+  for (const q of CATALOGUE.questions) if (false) ids.add(q.id);
   return ids;
 }
killedBy: full axis-config matrix reconciles against the catalogue oracle petrol/manual/2wd/sedan: engine visible question ids equal the oracle
statusReason: expected Set{} to deeply equal Set{ …(128) }

[Killed] ConditionalExpression
src/lib/questions.ts:240:44
 export function selectVisibleQuestionIds(config: VisibilityConfig, flags: ReadonlySet<RuntimeFlag>): Set<string> {
   const visibleGroupIds = new Set(selectVisibleGroups(config, flags).map((g) => g.id));
   const ids = new Set<string>();
-  for (const q of CATALOGUE.questions) if (visibleGroupIds.has(q.groupId)) ids.add(q.id);
+  for (const q of CATALOGUE.questions) if (true) ids.add(q.id);
   return ids;
 }
killedBy: full axis-config matrix reconciles against the catalogue oracle petrol/manual/2wd/sedan: engine visible question ids equal the oracle
statusReason: expected Set{ …(206) } to deeply equal Set{ …(128) }

[Killed] BlockStatement
src/lib/questions.ts:245:120
 }
 
 /** Per-Part visible question counts for the session nav. */
-export function visibleCountsByPart(config: VisibilityConfig, flags: ReadonlySet<RuntimeFlag>): Record<PartId, number> {
-  const visibleGroupIds = new Set(selectVisibleGroups(config, flags).map((g) => g.id));
-  const counts: Record<PartId, number> = { part2: 0, part3: 0, part4: 0, part5: 0 };
-  for (const q of CATALOGUE.questions) if (visibleGroupIds.has(q.groupId)) counts[q.part]++;
-  return counts;
-}
+export function visibleCountsByPart(config: VisibilityConfig, flags: ReadonlySet<RuntimeFlag>): Record<PartId, number> {}
 
 /** `explanationRef` → explanation text (for S-05; S-04 only wires it). */
killedBy: frozen catalogue & stable counts petrol vs EV totals differ in the expected direction
statusReason: expected undefined to deeply equal { part2: 86, part3: 14, …(2) }

[Killed] ArrowFunction
src/lib/questions.ts:246:74
 
 /** Per-Part visible question counts for the session nav. */
 export function visibleCountsByPart(config: VisibilityConfig, flags: ReadonlySet<RuntimeFlag>): Record<PartId, number> {
-  const visibleGroupIds = new Set(selectVisibleGroups(config, flags).map((g) => g.id));
+  const visibleGroupIds = new Set(selectVisibleGroups(config, flags).map(() => undefined));
   const counts: Record<PartId, number> = { part2: 0, part3: 0, part4: 0, part5: 0 };
   for (const q of CATALOGUE.questions) if (visibleGroupIds.has(q.groupId)) counts[q.part]++;
killedBy: frozen catalogue & stable counts petrol vs EV totals differ in the expected direction
statusReason: expected { part2: +0, part3: +0, …(2) } to deeply equal { part2: 86, part3: 14, …(2) }

[Killed] ConditionalExpression
src/lib/questions.ts:248:44
 export function visibleCountsByPart(config: VisibilityConfig, flags: ReadonlySet<RuntimeFlag>): Record<PartId, number> {
   const visibleGroupIds = new Set(selectVisibleGroups(config, flags).map((g) => g.id));
   const counts: Record<PartId, number> = { part2: 0, part3: 0, part4: 0, part5: 0 };
-  for (const q of CATALOGUE.questions) if (visibleGroupIds.has(q.groupId)) counts[q.part]++;
+  for (const q of CATALOGUE.questions) if (true) counts[q.part]++;
   return counts;
 }
killedBy: frozen catalogue & stable counts petrol vs EV totals differ in the expected direction
statusReason: expected { part2: 123, part3: 23, …(2) } to deeply equal { part2: 86, part3: 14, …(2) }

[Killed] UpdateOperator
src/lib/questions.ts:248:76
 export function visibleCountsByPart(config: VisibilityConfig, flags: ReadonlySet<RuntimeFlag>): Record<PartId, number> {
   const visibleGroupIds = new Set(selectVisibleGroups(config, flags).map((g) => g.id));
   const counts: Record<PartId, number> = { part2: 0, part3: 0, part4: 0, part5: 0 };
-  for (const q of CATALOGUE.questions) if (visibleGroupIds.has(q.groupId)) counts[q.part]++;
+  for (const q of CATALOGUE.questions) if (visibleGroupIds.has(q.groupId)) counts[q.part]--;
   return counts;
 }
killedBy: frozen catalogue & stable counts petrol vs EV totals differ in the expected direction
statusReason: expected { part2: -86, part3: -14, …(2) } to deeply equal { part2: 86, part3: 14, …(2) }

[Killed] BlockStatement
src/lib/questions.ts:253:64
 }
 
 /** `explanationRef` → explanation text (for S-05; S-04 only wires it). */
-export function resolveExplanation(ref: string): string | null {
-  return CATALOGUE.explanations[ref]?.text ?? null;
-}
+export function resolveExplanation(ref: string): string | null {}
 
 /**
killedBy: explanation resolver resolves a known ref and returns null for an unknown one
statusReason: expected undefined to be 'Damaged cylinder head, cylinder head …' // Object.is equality

[Killed] LogicalOperator
src/lib/questions.ts:254:10
 
 /** `explanationRef` → explanation text (for S-05; S-04 only wires it). */
 export function resolveExplanation(ref: string): string | null {
-  return CATALOGUE.explanations[ref]?.text ?? null;
+  return CATALOGUE.explanations[ref]?.text && null;
 }
 
killedBy: explanation resolver resolves a known ref and returns null for an unknown one
statusReason: expected null to be 'Damaged cylinder head, cylinder head …' // Object.is equality

[Killed] OptionalChaining
src/lib/questions.ts:254:10
 
 /** `explanationRef` → explanation text (for S-05; S-04 only wires it). */
 export function resolveExplanation(ref: string): string | null {
-  return CATALOGUE.explanations[ref]?.text ?? null;
+  return CATALOGUE.explanations[ref].text ?? null;
 }
 
killedBy: explanation resolver resolves a known ref and returns null for an unknown one
statusReason: Cannot read properties of undefined (reading 'text')
