[Killed] BlockStatement
src/lib/questions.ts:262:85
  * the explicit {@link FLAG_COLUMN_MAP} (NOT incidental casing agreement). A column whose
  * value is exactly `true` activates its catalogue flag; `null`/`false`/missing do not.
  */
-export function activeFlagsFromInspection(row: InspectionFlagRow): Set<RuntimeFlag> {
-  const active = new Set<RuntimeFlag>();
-  for (const [column, flag] of Object.entries(FLAG_COLUMN_MAP)) {
-    if (row[column as keyof typeof FLAG_COLUMN_MAP] === true) active.add(flag);
-  }
-  return active;
-}
+export function activeFlagsFromInspection(row: InspectionFlagRow): Set<RuntimeFlag> {}
 
 /**
killedBy: flag-binding symmetry (the importedFromEU↔importedFromEu guard) an inspection row with importedFromEu: true activates the importedFromEU flag
statusReason: Cannot read properties of undefined (reading 'has')

[Killed] BlockStatement
src/lib/questions.ts:264:65
  */
 export function activeFlagsFromInspection(row: InspectionFlagRow): Set<RuntimeFlag> {
   const active = new Set<RuntimeFlag>();
-  for (const [column, flag] of Object.entries(FLAG_COLUMN_MAP)) {
-    if (row[column as keyof typeof FLAG_COLUMN_MAP] === true) active.add(flag);
-  }
+  for (const [column, flag] of Object.entries(FLAG_COLUMN_MAP)) {}
   return active;
 }
killedBy: flag-binding symmetry (the importedFromEU↔importedFromEu guard) an inspection row with importedFromEu: true activates the importedFromEU flag
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/questions.ts:265:9
 export function activeFlagsFromInspection(row: InspectionFlagRow): Set<RuntimeFlag> {
   const active = new Set<RuntimeFlag>();
   for (const [column, flag] of Object.entries(FLAG_COLUMN_MAP)) {
-    if (row[column as keyof typeof FLAG_COLUMN_MAP] === true) active.add(flag);
+    if (false) active.add(flag);
   }
   return active;
killedBy: flag-binding symmetry (the importedFromEU↔importedFromEu guard) an inspection row with importedFromEu: true activates the importedFromEU flag
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/questions.ts:265:57
 export function activeFlagsFromInspection(row: InspectionFlagRow): Set<RuntimeFlag> {
   const active = new Set<RuntimeFlag>();
   for (const [column, flag] of Object.entries(FLAG_COLUMN_MAP)) {
-    if (row[column as keyof typeof FLAG_COLUMN_MAP] === true) active.add(flag);
+    if (row[column as keyof typeof FLAG_COLUMN_MAP] === false) active.add(flag);
   }
   return active;
killedBy: flag-binding symmetry (the importedFromEU↔importedFromEu guard) an inspection row with importedFromEu: true activates the importedFromEU flag
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/questions.ts:276:75
  * when X is forced active (its `visibleWhen` axes still evaluated against `config`).
  * Reuses {@link isGroupVisible}, so the toggle UI carries no hand-coded fuel rules to drift.
  */
-export function relevantFlags(config: VisibilityConfig): Set<RuntimeFlag> {
-  const relevant = new Set<RuntimeFlag>();
-  for (const flag of RUNTIME_FLAGS) {
-    const forced = new Set<RuntimeFlag>([flag]);
-    if (CATALOGUE.groups.some((g) => g.requiresEquipmentFlag === flag && isGroupVisible(g, config, forced))) {
-      relevant.add(flag);
-    }
-  }
-  return relevant;
-}
+export function relevantFlags(config: VisibilityConfig): Set<RuntimeFlag> {}
 
 /** An equipment toggle the session screen should render: the catalogue `flag` (for the
killedBy: relevantFlags (catalogue-derived toggle filter) petrol exposes turbo / compressor / imported, never EV flags
statusReason: expected undefined to deeply equal Set{ 'turboEquipped', …(2) }

[Killed] BlockStatement
src/lib/questions.ts:278:37
  */
 export function relevantFlags(config: VisibilityConfig): Set<RuntimeFlag> {
   const relevant = new Set<RuntimeFlag>();
-  for (const flag of RUNTIME_FLAGS) {
-    const forced = new Set<RuntimeFlag>([flag]);
-    if (CATALOGUE.groups.some((g) => g.requiresEquipmentFlag === flag && isGroupVisible(g, config, forced))) {
-      relevant.add(flag);
-    }
-  }
+  for (const flag of RUNTIME_FLAGS) {}
   return relevant;
 }
killedBy: relevantFlags (catalogue-derived toggle filter) petrol exposes turbo / compressor / imported, never EV flags
statusReason: expected Set{} to deeply equal Set{ 'turboEquipped', …(2) }

[Killed] ArrowFunction
src/lib/questions.ts:280:31
   const relevant = new Set<RuntimeFlag>();
   for (const flag of RUNTIME_FLAGS) {
     const forced = new Set<RuntimeFlag>([flag]);
-    if (CATALOGUE.groups.some((g) => g.requiresEquipmentFlag === flag && isGroupVisible(g, config, forced))) {
+    if (CATALOGUE.groups.some(() => undefined)) {
       relevant.add(flag);
     }
killedBy: relevantFlags (catalogue-derived toggle filter) petrol exposes turbo / compressor / imported, never EV flags
statusReason: expected Set{} to deeply equal Set{ 'turboEquipped', …(2) }

[Killed] ConditionalExpression
src/lib/questions.ts:280:38
   const relevant = new Set<RuntimeFlag>();
   for (const flag of RUNTIME_FLAGS) {
     const forced = new Set<RuntimeFlag>([flag]);
-    if (CATALOGUE.groups.some((g) => g.requiresEquipmentFlag === flag && isGroupVisible(g, config, forced))) {
+    if (CATALOGUE.groups.some((g) => true)) {
       relevant.add(flag);
     }
killedBy: relevantFlags (catalogue-derived toggle filter) petrol exposes turbo / compressor / imported, never EV flags
statusReason: expected Set{ 'chargingPortEquipped', …(4) } to deeply equal Set{ 'turboEquipped', …(2) }

[Killed] BlockStatement
src/lib/questions.ts:298:77
  * The equipment toggles to render for `config`, derived from {@link relevantFlags} so the
  * toggle UI carries no hand-coded fuel rules to drift. Stable order (RUNTIME_FLAGS order).
  */
-export function relevantToggles(config: VisibilityConfig): RelevantToggle[] {
-  return [...relevantFlags(config)].map((flag) => ({ flag, column: FLAG_TO_COLUMN[flag] }));
-}
+export function relevantToggles(config: VisibilityConfig): RelevantToggle[] {}
 
 /** The relevant equipment toggles keyed by `fuelType` value (plus `"none"` for an unset
killedBy: relevantTogglesByFuel (Part 1's catalogue-free relevance map) keys each fuelType plus `none`, each entry matching relevantToggles for that config
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/lib/questions.ts:299:41
  * toggle UI carries no hand-coded fuel rules to drift. Stable order (RUNTIME_FLAGS order).
  */
 export function relevantToggles(config: VisibilityConfig): RelevantToggle[] {
-  return [...relevantFlags(config)].map((flag) => ({ flag, column: FLAG_TO_COLUMN[flag] }));
+  return [...relevantFlags(config)].map(() => undefined);
 }
 
killedBy: relevantTogglesByFuel (Part 1's catalogue-free relevance map) keys each fuelType plus `none`, each entry matching relevantToggles for that config
statusReason: Cannot read properties of undefined (reading 'column')

[Killed] ObjectLiteral
src/lib/questions.ts:299:52
  * toggle UI carries no hand-coded fuel rules to drift. Stable order (RUNTIME_FLAGS order).
  */
 export function relevantToggles(config: VisibilityConfig): RelevantToggle[] {
-  return [...relevantFlags(config)].map((flag) => ({ flag, column: FLAG_TO_COLUMN[flag] }));
+  return [...relevantFlags(config)].map((flag) => ({}));
 }
 
killedBy: relevantTogglesByFuel (Part 1's catalogue-free relevance map) keys each fuelType plus `none`, each entry matching relevantToggles for that config
statusReason: expected [ undefined ] to deeply equal [ 'importedFromEu' ]

[Killed] BlockStatement
src/lib/questions.ts:309:64
  *  test (`tests/questions.test.ts`). */
 export type RelevantTogglesByFuel = Record<string, RelevantToggle[]>;
 
-export function relevantTogglesByFuel(): RelevantTogglesByFuel {
-  const map: RelevantTogglesByFuel = { none: relevantToggles({}) };
-  for (const fuel of fuelTypeSchema.options) map[fuel] = relevantToggles({ fuelType: fuel });
-  return map;
-}
+export function relevantTogglesByFuel(): RelevantTogglesByFuel {}
 
 /**
killedBy: relevantTogglesByFuel (Part 1's catalogue-free relevance map) keys each fuelType plus `none`, each entry matching relevantToggles for that config
statusReason: Cannot convert undefined or null to object

[Killed] ObjectLiteral
src/lib/questions.ts:310:38
 export type RelevantTogglesByFuel = Record<string, RelevantToggle[]>;
 
 export function relevantTogglesByFuel(): RelevantTogglesByFuel {
-  const map: RelevantTogglesByFuel = { none: relevantToggles({}) };
+  const map: RelevantTogglesByFuel = {};
   for (const fuel of fuelTypeSchema.options) map[fuel] = relevantToggles({ fuelType: fuel });
   return map;
killedBy: relevantTogglesByFuel (Part 1's catalogue-free relevance map) keys each fuelType plus `none`, each entry matching relevantToggles for that config
statusReason: expected [ Array(4) ] to deeply equal [ Array(5) ]

[Killed] BlockStatement
src/lib/questions.ts:322:72
  * WITHOUT the catalogue (see `@/lib/session-counts`); the additive model guarantees that
  * sum equals `visibleCountsByPart(config, activeFlags)`.
  */
-export function sessionCounts(config: VisibilityConfig): SessionCounts {
-  const base = visibleCountsByPart(config, new Set<RuntimeFlag>());
-  const flagDeltas: Partial<Record<RuntimeFlag, PartCounts>> = {};
-  for (const flag of relevantFlags(config)) {
-    const withFlag = visibleCountsByPart(config, new Set<RuntimeFlag>([flag]));
-    flagDeltas[flag] = {
-      part2: withFlag.part2 - base.part2,
-      part3: withFlag.part3 - base.part3,
-      part4: withFlag.part4 - base.part4,
-      part5: withFlag.part5 - base.part5,
-    };
-  }
-  return { base, flagDeltas };
-}
+export function sessionCounts(config: VisibilityConfig): SessionCounts {}
 
killedBy: Phase 4: sessionCounts ⇄ countsForFlags equals the engine for any flag subset recomputes petrol counts client-side identically to visibleCountsByPart
statusReason: Cannot read properties of undefined (reading 'base')

[Killed] BlockStatement
src/lib/questions.ts:325:45
 export function sessionCounts(config: VisibilityConfig): SessionCounts {
   const base = visibleCountsByPart(config, new Set<RuntimeFlag>());
   const flagDeltas: Partial<Record<RuntimeFlag, PartCounts>> = {};
-  for (const flag of relevantFlags(config)) {
-    const withFlag = visibleCountsByPart(config, new Set<RuntimeFlag>([flag]));
-    flagDeltas[flag] = {
-      part2: withFlag.part2 - base.part2,
-      part3: withFlag.part3 - base.part3,
-      part4: withFlag.part4 - base.part4,
-      part5: withFlag.part5 - base.part5,
-    };
-  }
+  for (const flag of relevantFlags(config)) {}
   return { base, flagDeltas };
 }
killedBy: Phase 4: sessionCounts ⇄ countsForFlags equals the engine for any flag subset recomputes petrol counts client-side identically to visibleCountsByPart
statusReason: expected { part2: 86, part3: 14, …(2) } to deeply equal { part2: 87, part3: 14, …(2) }

[Killed] ArithmeticOperator
src/lib/questions.ts:328:14
   for (const flag of relevantFlags(config)) {
     const withFlag = visibleCountsByPart(config, new Set<RuntimeFlag>([flag]));
     flagDeltas[flag] = {
-      part2: withFlag.part2 - base.part2,
+      part2: withFlag.part2 + base.part2,
       part3: withFlag.part3 - base.part3,
       part4: withFlag.part4 - base.part4,
killedBy: Phase 4: sessionCounts ⇄ countsForFlags equals the engine for any flag subset recomputes petrol counts client-side identically to visibleCountsByPart
statusReason: expected { part2: 603, part3: 14, …(2) } to deeply equal { part2: 87, part3: 14, …(2) }

[Killed] ArithmeticOperator
src/lib/questions.ts:329:14
     const withFlag = visibleCountsByPart(config, new Set<RuntimeFlag>([flag]));
     flagDeltas[flag] = {
       part2: withFlag.part2 - base.part2,
-      part3: withFlag.part3 - base.part3,
+      part3: withFlag.part3 + base.part3,
       part4: withFlag.part4 - base.part4,
       part5: withFlag.part5 - base.part5,
killedBy: Phase 4: sessionCounts ⇄ countsForFlags equals the engine for any flag subset recomputes petrol counts client-side identically to visibleCountsByPart
statusReason: expected { part2: 87, part3: 98, …(2) } to deeply equal { part2: 87, part3: 14, …(2) }

[Killed] ArithmeticOperator
src/lib/questions.ts:330:14
     flagDeltas[flag] = {
       part2: withFlag.part2 - base.part2,
       part3: withFlag.part3 - base.part3,
-      part4: withFlag.part4 - base.part4,
+      part4: withFlag.part4 + base.part4,
       part5: withFlag.part5 - base.part5,
     };
killedBy: Phase 4: sessionCounts ⇄ countsForFlags equals the engine for any flag subset recomputes petrol counts client-side identically to visibleCountsByPart
statusReason: expected { part2: 87, part3: 14, …(2) } to deeply equal { part2: 87, part3: 14, …(2) }

[Killed] ArithmeticOperator
src/lib/questions.ts:331:14
       part2: withFlag.part2 - base.part2,
       part3: withFlag.part3 - base.part3,
       part4: withFlag.part4 - base.part4,
-      part5: withFlag.part5 - base.part5,
+      part5: withFlag.part5 + base.part5,
     };
   }
killedBy: Phase 4: sessionCounts ⇄ countsForFlags equals the engine for any flag subset recomputes petrol counts client-side identically to visibleCountsByPart
statusReason: expected { part2: 87, part3: 14, …(2) } to deeply equal { part2: 87, part3: 14, …(2) }

[Killed] ObjectLiteral
src/lib/questions.ts:334:10
       part5: withFlag.part5 - base.part5,
     };
   }
-  return { base, flagDeltas };
+  return {};
 }
 
killedBy: Phase 4: sessionCounts ⇄ countsForFlags equals the engine for any flag subset recomputes petrol counts client-side identically to visibleCountsByPart
statusReason: Cannot convert undefined or null to object
