[NoCoverage] BlockStatement
src/lib/supabase.ts:6:78
 import { SUPABASE_URL, SUPABASE_KEY } from "astro:env/server";
 import type { Database } from "@/db/database.types";
 
-export function createClient(requestHeaders: Headers, cookies: AstroCookies) {
-  if (!SUPABASE_URL || !SUPABASE_KEY) {
-    return null;
-  }
-  return createServerClient<Database>(SUPABASE_URL, SUPABASE_KEY, {
-    cookies: {
-      getAll() {
-        return parseCookieHeader(requestHeaders.get("Cookie") ?? "").map(({ name, value }) => ({
-          name,
-          value: value ?? "",
-        }));
-      },
-      setAll(cookiesToSet) {
-        cookiesToSet.forEach(({ name, value, options }) => {
-          cookies.set(name, value, options);
-        });
-      },
-    },
-  });
-}
+export function createClient(requestHeaders: Headers, cookies: AstroCookies) {}
 

[NoCoverage] BooleanLiteral
src/lib/supabase.ts:7:7
 import type { Database } from "@/db/database.types";
 
 export function createClient(requestHeaders: Headers, cookies: AstroCookies) {
-  if (!SUPABASE_URL || !SUPABASE_KEY) {
+  if (SUPABASE_URL || !SUPABASE_KEY) {
     return null;
   }

[NoCoverage] BooleanLiteral
src/lib/supabase.ts:7:24
 import type { Database } from "@/db/database.types";
 
 export function createClient(requestHeaders: Headers, cookies: AstroCookies) {
-  if (!SUPABASE_URL || !SUPABASE_KEY) {
+  if (!SUPABASE_URL || SUPABASE_KEY) {
     return null;
   }

[NoCoverage] ObjectLiteral
src/lib/supabase.ts:11:14
     return null;
   }
   return createServerClient<Database>(SUPABASE_URL, SUPABASE_KEY, {
-    cookies: {
-      getAll() {
-        return parseCookieHeader(requestHeaders.get("Cookie") ?? "").map(({ name, value }) => ({
-          name,
-          value: value ?? "",
-        }));
-      },
-      setAll(cookiesToSet) {
-        cookiesToSet.forEach(({ name, value, options }) => {
-          cookies.set(name, value, options);
-        });
-      },
-    },
+    cookies: {},
   });
 }

[NoCoverage] BlockStatement
src/lib/supabase.ts:12:16
   }
   return createServerClient<Database>(SUPABASE_URL, SUPABASE_KEY, {
     cookies: {
-      getAll() {
-        return parseCookieHeader(requestHeaders.get("Cookie") ?? "").map(({ name, value }) => ({
-          name,
-          value: value ?? "",
-        }));
-      },
+      getAll() {},
       setAll(cookiesToSet) {
         cookiesToSet.forEach(({ name, value, options }) => {

[NoCoverage] ArrowFunction
src/lib/supabase.ts:13:74
   return createServerClient<Database>(SUPABASE_URL, SUPABASE_KEY, {
     cookies: {
       getAll() {
-        return parseCookieHeader(requestHeaders.get("Cookie") ?? "").map(({ name, value }) => ({
-          name,
-          value: value ?? "",
-        }));
+        return parseCookieHeader(requestHeaders.get("Cookie") ?? "").map(() => undefined);
       },
       setAll(cookiesToSet) {

[NoCoverage] LogicalOperator
src/lib/supabase.ts:13:34
   return createServerClient<Database>(SUPABASE_URL, SUPABASE_KEY, {
     cookies: {
       getAll() {
-        return parseCookieHeader(requestHeaders.get("Cookie") ?? "").map(({ name, value }) => ({
+        return parseCookieHeader(requestHeaders.get("Cookie") && "").map(({ name, value }) => ({
           name,
           value: value ?? "",

[NoCoverage] LogicalOperator
src/lib/supabase.ts:15:18
       getAll() {
         return parseCookieHeader(requestHeaders.get("Cookie") ?? "").map(({ name, value }) => ({
           name,
-          value: value ?? "",
+          value: value && "",
         }));
       },

[NoCoverage] BlockStatement
src/lib/supabase.ts:18:28
           value: value ?? "",
         }));
       },
-      setAll(cookiesToSet) {
-        cookiesToSet.forEach(({ name, value, options }) => {
-          cookies.set(name, value, options);
-        });
-      },
+      setAll(cookiesToSet) {},
     },
   });

[NoCoverage] BlockStatement
src/lib/supabase.ts:19:60
         }));
       },
       setAll(cookiesToSet) {
-        cookiesToSet.forEach(({ name, value, options }) => {
-          cookies.set(name, value, options);
-        });
+        cookiesToSet.forEach(({ name, value, options }) => {});
       },
     },
