[NoCoverage] BlockStatement
src/lib/sync.ts:27:82
  * user switch is correct — they belong to the previous session and can never sync
  * under the new one.
  */
-export async function resetLocalStoreOnUserChange(userId: string): Promise<void> {
-  if (localStorage.getItem(LAST_OWNER_KEY) === userId) return;
-  await db.transaction("rw", db.inspections, db.changeQueue, async () => {
-    await db.inspections.clear();
-    await db.changeQueue.clear();
-  });
-  localStorage.setItem(LAST_OWNER_KEY, userId);
-}
+export async function resetLocalStoreOnUserChange(userId: string): Promise<void> {}
 
 // The 15 Part 1 config columns (camelCase projection of the snake_case DB

[NoCoverage] ConditionalExpression
src/lib/sync.ts:28:7
  * under the new one.
  */
 export async function resetLocalStoreOnUserChange(userId: string): Promise<void> {
-  if (localStorage.getItem(LAST_OWNER_KEY) === userId) return;
+  if (true) return;
   await db.transaction("rw", db.inspections, db.changeQueue, async () => {
     await db.inspections.clear();

[NoCoverage] ConditionalExpression
src/lib/sync.ts:28:7
  * under the new one.
  */
 export async function resetLocalStoreOnUserChange(userId: string): Promise<void> {
-  if (localStorage.getItem(LAST_OWNER_KEY) === userId) return;
+  if (false) return;
   await db.transaction("rw", db.inspections, db.changeQueue, async () => {
     await db.inspections.clear();

[NoCoverage] BlockStatement
src/lib/sync.ts:29:74
  */
 export async function resetLocalStoreOnUserChange(userId: string): Promise<void> {
   if (localStorage.getItem(LAST_OWNER_KEY) === userId) return;
-  await db.transaction("rw", db.inspections, db.changeQueue, async () => {
-    await db.inspections.clear();
-    await db.changeQueue.clear();
-  });
+  await db.transaction("rw", db.inspections, db.changeQueue, async () => {});
   localStorage.setItem(LAST_OWNER_KEY, userId);
 }

[Killed] StringLiteral
src/lib/sync.ts:104:24
 export async function saveInspection(input: SaveInput): Promise<void> {
   const now = new Date().toISOString();
 
-  await db.transaction("rw", db.inspections, db.changeQueue, async () => {
+  await db.transaction("", db.inspections, db.changeQueue, async () => {
     const existing = await db.inspections.get(input.id);
 
killedBy: saveInspection read-merge (src/lib/sync.ts) a notes-only save preserves a pre-existing Part 1 config
statusReason: Invalid transaction mode:

[Killed] OptionalChaining
src/lib/sync.ts:116:33
 
     const row: Inspection = {
       id: input.id,
-      ownerId: input.ownerId ?? existing?.ownerId ?? "", // server stamps the authoritative owner_id
+      ownerId: input.ownerId ?? existing.ownerId ?? "", // server stamps the authoritative owner_id
       status: input.status ?? existing?.status ?? "draft",
       name: input.name ?? existing?.name ?? null,
killedBy: saveInspection read-merge (src/lib/sync.ts) a notes-only save preserves a pre-existing Part 1 config
statusReason: Cannot read properties of undefined (reading 'ownerId')

[Survived] LogicalOperator
src/lib/sync.ts:116:16
 
     const row: Inspection = {
       id: input.id,
-      ownerId: input.ownerId ?? existing?.ownerId ?? "", // server stamps the authoritative owner_id
+      ownerId: (input.ownerId ?? existing?.ownerId) && "", // server stamps the authoritative owner_id
       status: input.status ?? existing?.status ?? "draft",
       name: input.name ?? existing?.name ?? null,

[Killed] OptionalChaining
src/lib/sync.ts:117:31
     const row: Inspection = {
       id: input.id,
       ownerId: input.ownerId ?? existing?.ownerId ?? "", // server stamps the authoritative owner_id
-      status: input.status ?? existing?.status ?? "draft",
+      status: input.status ?? existing.status ?? "draft",
       name: input.name ?? existing?.name ?? null,
       createdAt: input.createdAt ?? existing?.createdAt ?? now,
killedBy: saveInspection read-merge (src/lib/sync.ts) a notes-only save preserves a pre-existing Part 1 config
statusReason: Cannot read properties of undefined (reading 'status')

[Survived] LogicalOperator
src/lib/sync.ts:117:15
     const row: Inspection = {
       id: input.id,
       ownerId: input.ownerId ?? existing?.ownerId ?? "", // server stamps the authoritative owner_id
-      status: input.status ?? existing?.status ?? "draft",
+      status: input.status && existing?.status ?? "draft",
       name: input.name ?? existing?.name ?? null,
       createdAt: input.createdAt ?? existing?.createdAt ?? now,

[Killed] LogicalOperator
src/lib/sync.ts:118:13
       id: input.id,
       ownerId: input.ownerId ?? existing?.ownerId ?? "", // server stamps the authoritative owner_id
       status: input.status ?? existing?.status ?? "draft",
-      name: input.name ?? existing?.name ?? null,
+      name: (input.name ?? existing?.name) && null,
       createdAt: input.createdAt ?? existing?.createdAt ?? now,
       updatedAt: now, // optimistic ordering hint; overwritten by the server's value
killedBy: saveInspection read-merge (src/lib/sync.ts) a notes-only save preserves a pre-existing Part 1 config
statusReason: expected null to be 'Session A' // Object.is equality

[Killed] LogicalOperator
src/lib/sync.ts:118:13
       id: input.id,
       ownerId: input.ownerId ?? existing?.ownerId ?? "", // server stamps the authoritative owner_id
       status: input.status ?? existing?.status ?? "draft",
-      name: input.name ?? existing?.name ?? null,
+      name: input.name && existing?.name ?? null,
       createdAt: input.createdAt ?? existing?.createdAt ?? now,
       updatedAt: now, // optimistic ordering hint; overwritten by the server's value
killedBy: saveInspection read-merge (src/lib/sync.ts) a notes-only save preserves a pre-existing Part 1 config
statusReason: expected null to be 'Session A' // Object.is equality

[Killed] OptionalChaining
src/lib/sync.ts:119:37
       ownerId: input.ownerId ?? existing?.ownerId ?? "", // server stamps the authoritative owner_id
       status: input.status ?? existing?.status ?? "draft",
       name: input.name ?? existing?.name ?? null,
-      createdAt: input.createdAt ?? existing?.createdAt ?? now,
+      createdAt: input.createdAt ?? existing.createdAt ?? now,
       updatedAt: now, // optimistic ordering hint; overwritten by the server's value
       ...data,
killedBy: saveInspection read-merge (src/lib/sync.ts) a notes-only save preserves a pre-existing Part 1 config
statusReason: Cannot read properties of undefined (reading 'createdAt')

[Survived] LogicalOperator
src/lib/sync.ts:119:18
       ownerId: input.ownerId ?? existing?.ownerId ?? "", // server stamps the authoritative owner_id
       status: input.status ?? existing?.status ?? "draft",
       name: input.name ?? existing?.name ?? null,
-      createdAt: input.createdAt ?? existing?.createdAt ?? now,
+      createdAt: (input.createdAt ?? existing?.createdAt) && now,
       updatedAt: now, // optimistic ordering hint; overwritten by the server's value
       ...data,

[Survived] StringLiteral
src/lib/sync.ts:127:15
 
     await db.inspections.put(row);
     await db.changeQueue.add({
-      entity: "inspections",
+      entity: "",
       entityId: row.id,
       op: "put",

[Survived] StringLiteral
src/lib/sync.ts:129:11
     await db.changeQueue.add({
       entity: "inspections",
       entityId: row.id,
-      op: "put",
+      op: "",
       payload: row,
       createdAt: Date.now(), // numeric FIFO ordering hint (distinct from the row's ISO createdAt)

[Survived] BooleanLiteral
src/lib/sync.ts:139:16
 // Reentrancy guard: several triggers can call `flushQueue` at once (the `online`
 // event, a visibility change, the retry timer). Without this, concurrent drains
 // could POST the same op twice before the first reconciles its queue delete.
-let flushing = false;
+let flushing = true;
 
 /**

[NoCoverage] BlockStatement
src/lib/sync.ts:149:51
  * `delete` drops the local row + queue entry; `put` adopts the server's
  * authoritative camelCase row and flips `synced: 1`.
  */
-export async function flushQueue(): Promise<void> {
-  if (flushing) return; // a drain is already in progress
-  flushing = true;
-  try {
-    await drainQueue();
-  } finally {
-    flushing = false;
-  }
-}
+export async function flushQueue(): Promise<void> {}
 
 async function drainQueue(): Promise<void> {

[NoCoverage] ConditionalExpression
src/lib/sync.ts:150:7
  * authoritative camelCase row and flips `synced: 1`.
  */
 export async function flushQueue(): Promise<void> {
-  if (flushing) return; // a drain is already in progress
+  if (false) return; // a drain is already in progress
   flushing = true;
   try {

[NoCoverage] ConditionalExpression
src/lib/sync.ts:150:7
  * authoritative camelCase row and flips `synced: 1`.
  */
 export async function flushQueue(): Promise<void> {
-  if (flushing) return; // a drain is already in progress
+  if (true) return; // a drain is already in progress
   flushing = true;
   try {

[NoCoverage] BooleanLiteral
src/lib/sync.ts:151:14
  */
 export async function flushQueue(): Promise<void> {
   if (flushing) return; // a drain is already in progress
-  flushing = true;
+  flushing = false;
   try {
     await drainQueue();

[NoCoverage] BlockStatement
src/lib/sync.ts:152:7
 export async function flushQueue(): Promise<void> {
   if (flushing) return; // a drain is already in progress
   flushing = true;
-  try {
-    await drainQueue();
-  } finally {
+  try {} finally {
     flushing = false;
   }

[NoCoverage] BlockStatement
src/lib/sync.ts:154:13
   flushing = true;
   try {
     await drainQueue();
-  } finally {
-    flushing = false;
-  }
+  } finally {}
 }
 

[NoCoverage] BooleanLiteral
src/lib/sync.ts:155:16
   try {
     await drainQueue();
   } finally {
-    flushing = false;
+    flushing = true;
   }
 }

[NoCoverage] BlockStatement
src/lib/sync.ts:164:9
 
   for (const op of ops) {
     let res: Response;
-    try {
-      res = await fetch("/api/inspections/sync", {
-        method: "POST",
-        headers: { "Content-Type": "application/json" },
-        body: JSON.stringify({ op: op.op, entityId: op.entityId, payload: op.payload }),
-      });
-    } catch {
+    try {} catch {
       break; // offline / network blip — stop draining, retry on the next online event
     }

[NoCoverage] StringLiteral
src/lib/sync.ts:166:17
     let res: Response;
     try {
       res = await fetch("/api/inspections/sync", {
-        method: "POST",
+        method: "",
         headers: { "Content-Type": "application/json" },
         body: JSON.stringify({ op: op.op, entityId: op.entityId, payload: op.payload }),

[NoCoverage] ObjectLiteral
src/lib/sync.ts:167:18
     try {
       res = await fetch("/api/inspections/sync", {
         method: "POST",
-        headers: { "Content-Type": "application/json" },
+        headers: {},
         body: JSON.stringify({ op: op.op, entityId: op.entityId, payload: op.payload }),
       });

[NoCoverage] ObjectLiteral
src/lib/sync.ts:168:30
       res = await fetch("/api/inspections/sync", {
         method: "POST",
         headers: { "Content-Type": "application/json" },
-        body: JSON.stringify({ op: op.op, entityId: op.entityId, payload: op.payload }),
+        body: JSON.stringify({}),
       });
     } catch {

[NoCoverage] BlockStatement
src/lib/sync.ts:170:13
         headers: { "Content-Type": "application/json" },
         body: JSON.stringify({ op: op.op, entityId: op.entityId, payload: op.payload }),
       });
-    } catch {
-      break; // offline / network blip — stop draining, retry on the next online event
-    }
+    } catch {}
 
     if (!res.ok) break; // transient server error — preserve FIFO order, retry later

[NoCoverage] ConditionalExpression
src/lib/sync.ts:174:9
       break; // offline / network blip — stop draining, retry on the next online event
     }
 
-    if (!res.ok) break; // transient server error — preserve FIFO order, retry later
+    if (false) break; // transient server error — preserve FIFO order, retry later
 
     if (op.op === "delete") {

[NoCoverage] ConditionalExpression
src/lib/sync.ts:174:9
       break; // offline / network blip — stop draining, retry on the next online event
     }
 
-    if (!res.ok) break; // transient server error — preserve FIFO order, retry later
+    if (true) break; // transient server error — preserve FIFO order, retry later
 
     if (op.op === "delete") {

[NoCoverage] BlockStatement
src/lib/sync.ts:176:29
 
     if (!res.ok) break; // transient server error — preserve FIFO order, retry later
 
-    if (op.op === "delete") {
-      // 204, no body. Drop the local row and the queue entry together.
-      await db.transaction("rw", db.inspections, db.changeQueue, async () => {
-        await db.inspections.delete(op.entityId);
-        if (op.seq !== undefined) await db.changeQueue.delete(op.seq);
-      });
-      continue;
-    }
+    if (op.op === "delete") {}
 
     // put: adopt the authoritative row (server-stamped owner_id + updated_at).

[NoCoverage] EqualityOperator
src/lib/sync.ts:176:9
 
     if (!res.ok) break; // transient server error — preserve FIFO order, retry later
 
-    if (op.op === "delete") {
+    if (op.op !== "delete") {
       // 204, no body. Drop the local row and the queue entry together.
       await db.transaction("rw", db.inspections, db.changeQueue, async () => {

[NoCoverage] BlockStatement
src/lib/sync.ts:178:78
 
     if (op.op === "delete") {
       // 204, no body. Drop the local row and the queue entry together.
-      await db.transaction("rw", db.inspections, db.changeQueue, async () => {
-        await db.inspections.delete(op.entityId);
-        if (op.seq !== undefined) await db.changeQueue.delete(op.seq);
-      });
+      await db.transaction("rw", db.inspections, db.changeQueue, async () => {});
       continue;
     }

[NoCoverage] ConditionalExpression
src/lib/sync.ts:180:13
       // 204, no body. Drop the local row and the queue entry together.
       await db.transaction("rw", db.inspections, db.changeQueue, async () => {
         await db.inspections.delete(op.entityId);
-        if (op.seq !== undefined) await db.changeQueue.delete(op.seq);
+        if (true) await db.changeQueue.delete(op.seq);
       });
       continue;

[NoCoverage] ConditionalExpression
src/lib/sync.ts:180:13
       // 204, no body. Drop the local row and the queue entry together.
       await db.transaction("rw", db.inspections, db.changeQueue, async () => {
         await db.inspections.delete(op.entityId);
-        if (op.seq !== undefined) await db.changeQueue.delete(op.seq);
+        if (false) await db.changeQueue.delete(op.seq);
       });
       continue;

[NoCoverage] BlockStatement
src/lib/sync.ts:187:76
 
     // put: adopt the authoritative row (server-stamped owner_id + updated_at).
     const saved = (await res.json()) as Omit<Inspection, "synced">;
-    await db.transaction("rw", db.inspections, db.changeQueue, async () => {
-      await db.inspections.update(op.entityId, { ...saved, synced: 1 });
-      if (op.seq !== undefined) await db.changeQueue.delete(op.seq);
-    });
+    await db.transaction("rw", db.inspections, db.changeQueue, async () => {});
   }
 }

[NoCoverage] ObjectLiteral
src/lib/sync.ts:188:48
     // put: adopt the authoritative row (server-stamped owner_id + updated_at).
     const saved = (await res.json()) as Omit<Inspection, "synced">;
     await db.transaction("rw", db.inspections, db.changeQueue, async () => {
-      await db.inspections.update(op.entityId, { ...saved, synced: 1 });
+      await db.inspections.update(op.entityId, {});
       if (op.seq !== undefined) await db.changeQueue.delete(op.seq);
     });

[NoCoverage] EqualityOperator
src/lib/sync.ts:189:11
     const saved = (await res.json()) as Omit<Inspection, "synced">;
     await db.transaction("rw", db.inspections, db.changeQueue, async () => {
       await db.inspections.update(op.entityId, { ...saved, synced: 1 });
-      if (op.seq !== undefined) await db.changeQueue.delete(op.seq);
+      if (op.seq === undefined) await db.changeQueue.delete(op.seq);
     });
   }

[NoCoverage] ConditionalExpression
src/lib/sync.ts:189:11
     const saved = (await res.json()) as Omit<Inspection, "synced">;
     await db.transaction("rw", db.inspections, db.changeQueue, async () => {
       await db.inspections.update(op.entityId, { ...saved, synced: 1 });
-      if (op.seq !== undefined) await db.changeQueue.delete(op.seq);
+      if (true) await db.changeQueue.delete(op.seq);
     });
   }

[NoCoverage] BooleanLiteral
src/lib/sync.ts:217:17
  * the returned cleanup on unmount.
  */
 export function startAutoSync(): () => void {
-  let stopped = false;
+  let stopped = true;
 
   const drain = () => {

[NoCoverage] BlockStatement
src/lib/sync.ts:219:23
 export function startAutoSync(): () => void {
   let stopped = false;
 
-  const drain = () => {
-    if (stopped || !navigator.onLine) return;
-    void flushQueue();
-  };
+  const drain = () => {};
 
   const onOnline = () => {

[NoCoverage] ConditionalExpression
src/lib/sync.ts:220:9
   let stopped = false;
 
   const drain = () => {
-    if (stopped || !navigator.onLine) return;
+    if (false) return;
     void flushQueue();
   };

[NoCoverage] LogicalOperator
src/lib/sync.ts:220:9
   let stopped = false;
 
   const drain = () => {
-    if (stopped || !navigator.onLine) return;
+    if (stopped && !navigator.onLine) return;
     void flushQueue();
   };

[NoCoverage] BlockStatement
src/lib/sync.ts:224:26
     void flushQueue();
   };
 
-  const onOnline = () => {
-    drain();
-  };
+  const onOnline = () => {};
   const onVisibility = () => {
     if (document.visibilityState === "visible") drain();

[NoCoverage] BlockStatement
src/lib/sync.ts:227:30
   const onOnline = () => {
     drain();
   };
-  const onVisibility = () => {
-    if (document.visibilityState === "visible") drain();
-  };
+  const onVisibility = () => {};
 
   window.addEventListener("online", onOnline);

[NoCoverage] ConditionalExpression
src/lib/sync.ts:228:9
     drain();
   };
   const onVisibility = () => {
-    if (document.visibilityState === "visible") drain();
+    if (true) drain();
   };
 

[NoCoverage] EqualityOperator
src/lib/sync.ts:228:9
     drain();
   };
   const onVisibility = () => {
-    if (document.visibilityState === "visible") drain();
+    if (document.visibilityState !== "visible") drain();
   };
 

[NoCoverage] StringLiteral
src/lib/sync.ts:232:29
   };
 
   window.addEventListener("online", onOnline);
-  document.addEventListener("visibilitychange", onVisibility);
+  document.addEventListener("", onVisibility);
 
   const timer = window.setInterval(() => {

[NoCoverage] BlockStatement
src/lib/sync.ts:234:42
   window.addEventListener("online", onOnline);
   document.addEventListener("visibilitychange", onVisibility);
 
-  const timer = window.setInterval(() => {
-    if (stopped || !navigator.onLine) return;
-    void db.changeQueue.count().then((pending) => {
-      if (pending > 0) void flushQueue();
-    });
-  }, RETRY_INTERVAL_MS);
+  const timer = window.setInterval(() => {}, RETRY_INTERVAL_MS);
 
   drain(); // initial attempt on mount

[NoCoverage] LogicalOperator
src/lib/sync.ts:235:9
   document.addEventListener("visibilitychange", onVisibility);
 
   const timer = window.setInterval(() => {
-    if (stopped || !navigator.onLine) return;
+    if (stopped && !navigator.onLine) return;
     void db.changeQueue.count().then((pending) => {
       if (pending > 0) void flushQueue();

[NoCoverage] ConditionalExpression
src/lib/sync.ts:235:9
   document.addEventListener("visibilitychange", onVisibility);
 
   const timer = window.setInterval(() => {
-    if (stopped || !navigator.onLine) return;
+    if (false) return;
     void db.changeQueue.count().then((pending) => {
       if (pending > 0) void flushQueue();

[NoCoverage] BlockStatement
src/lib/sync.ts:236:51
 
   const timer = window.setInterval(() => {
     if (stopped || !navigator.onLine) return;
-    void db.changeQueue.count().then((pending) => {
-      if (pending > 0) void flushQueue();
-    });
+    void db.changeQueue.count().then((pending) => {});
   }, RETRY_INTERVAL_MS);
 

[NoCoverage] EqualityOperator
src/lib/sync.ts:237:11
   const timer = window.setInterval(() => {
     if (stopped || !navigator.onLine) return;
     void db.changeQueue.count().then((pending) => {
-      if (pending > 0) void flushQueue();
+      if (pending <= 0) void flushQueue();
     });
   }, RETRY_INTERVAL_MS);

[NoCoverage] EqualityOperator
src/lib/sync.ts:237:11
   const timer = window.setInterval(() => {
     if (stopped || !navigator.onLine) return;
     void db.changeQueue.count().then((pending) => {
-      if (pending > 0) void flushQueue();
+      if (pending >= 0) void flushQueue();
     });
   }, RETRY_INTERVAL_MS);

[NoCoverage] BlockStatement
src/lib/sync.ts:243:16
 
   drain(); // initial attempt on mount
 
-  return () => {
-    stopped = true;
-    window.removeEventListener("online", onOnline);
-    document.removeEventListener("visibilitychange", onVisibility);
-    window.clearInterval(timer);
-  };
+  return () => {};
 }
 

[NoCoverage] StringLiteral
src/lib/sync.ts:246:34
   return () => {
     stopped = true;
     window.removeEventListener("online", onOnline);
-    document.removeEventListener("visibilitychange", onVisibility);
+    document.removeEventListener("", onVisibility);
     window.clearInterval(timer);
   };
