[NoCoverage] StringLiteral
src/middleware.ts:4:41
 import { defineMiddleware } from "astro:middleware";
 import { createClient } from "@/lib/supabase";
 
-const PROTECTED_ROUTES = ["/dashboard", "/inspections"];
+const PROTECTED_ROUTES = ["/dashboard", ""];
 
 export const onRequest = defineMiddleware(async (context, next) => {

[NoCoverage] BlockStatement
src/middleware.ts:6:68
 
 const PROTECTED_ROUTES = ["/dashboard", "/inspections"];
 
-export const onRequest = defineMiddleware(async (context, next) => {
-  const supabase = createClient(context.request.headers, context.cookies);
-
-  if (supabase) {
-    const {
-      data: { user },
-    } = await supabase.auth.getUser();
-    context.locals.user = user ?? null;
-  } else {
-    context.locals.user = null;
-  }
-
-  if (PROTECTED_ROUTES.some((route) => context.url.pathname.startsWith(route))) {
-    if (!context.locals.user) {
-      return context.redirect("/auth/signin");
-    }
-  }
-
-  return next();
-});
+export const onRequest = defineMiddleware(async (context, next) => {});
 

[NoCoverage] ConditionalExpression
src/middleware.ts:9:7
 export const onRequest = defineMiddleware(async (context, next) => {
   const supabase = createClient(context.request.headers, context.cookies);
 
-  if (supabase) {
+  if (false) {
     const {
       data: { user },

[NoCoverage] BlockStatement
src/middleware.ts:9:17
 export const onRequest = defineMiddleware(async (context, next) => {
   const supabase = createClient(context.request.headers, context.cookies);
 
-  if (supabase) {
-    const {
-      data: { user },
-    } = await supabase.auth.getUser();
-    context.locals.user = user ?? null;
-  } else {
+  if (supabase) {} else {
     context.locals.user = null;
   }

[NoCoverage] LogicalOperator
src/middleware.ts:13:27
     const {
       data: { user },
     } = await supabase.auth.getUser();
-    context.locals.user = user ?? null;
+    context.locals.user = user && null;
   } else {
     context.locals.user = null;

[NoCoverage] BlockStatement
src/middleware.ts:14:10
       data: { user },
     } = await supabase.auth.getUser();
     context.locals.user = user ?? null;
-  } else {
-    context.locals.user = null;
-  }
+  } else {}
 
   if (PROTECTED_ROUTES.some((route) => context.url.pathname.startsWith(route))) {

[NoCoverage] MethodExpression
src/middleware.ts:18:7
     context.locals.user = null;
   }
 
-  if (PROTECTED_ROUTES.some((route) => context.url.pathname.startsWith(route))) {
+  if (PROTECTED_ROUTES.every(route => context.url.pathname.startsWith(route))) {
     if (!context.locals.user) {
       return context.redirect("/auth/signin");

[NoCoverage] ConditionalExpression
src/middleware.ts:18:7
     context.locals.user = null;
   }
 
-  if (PROTECTED_ROUTES.some((route) => context.url.pathname.startsWith(route))) {
+  if (true) {
     if (!context.locals.user) {
       return context.redirect("/auth/signin");

[NoCoverage] BooleanLiteral
src/middleware.ts:19:9
   }
 
   if (PROTECTED_ROUTES.some((route) => context.url.pathname.startsWith(route))) {
-    if (!context.locals.user) {
+    if (context.locals.user) {
       return context.redirect("/auth/signin");
     }

[NoCoverage] ConditionalExpression
src/middleware.ts:19:9
   }
 
   if (PROTECTED_ROUTES.some((route) => context.url.pathname.startsWith(route))) {
-    if (!context.locals.user) {
+    if (true) {
       return context.redirect("/auth/signin");
     }
