[NoCoverage] BlockStatement
pages/api/inspections/create.ts:17:50
 // No camel/snake transform: the row is built server-side from scalars, so this
 // endpoint never crosses the casing boundary the sync endpoint owns.
 
-export const POST: APIRoute = async (context) => {
-  const supabase = createClient(context.request.headers, context.cookies);
-  if (!supabase) return new Response("Supabase not configured", { status: 503 });
-
-  const user = context.locals.user; // cookie session, set by src/middleware.ts
-  if (!user) return new Response("Unauthorized", { status: 401 });
-
-  const today = new Date().toISOString().slice(0, 10); // YYYY-MM-DD
-  const { data, error } = await supabase
-    .from("inspections")
-    .insert({ owner_id: user.id, status: "draft", name: `Draft inspection — ${today}` })
-    .select("id")
-    .single();
-
-  if (error) {
-    // The limit trigger raises this distinctive message — surface it as 409.
-    if (error.message.includes(INSPECTION_LIMIT_ERROR)) {
-      return new Response(INSPECTION_LIMIT_ERROR, { status: 409 });
-    }
-    return new Response(error.message, { status: 400 });
-  }
-
-  return Response.json({ id: data.id }, { status: 201 });
-};
+export const POST: APIRoute = async (context) => {};
 

[NoCoverage] ConditionalExpression
pages/api/inspections/create.ts:19:7
 
 export const POST: APIRoute = async (context) => {
   const supabase = createClient(context.request.headers, context.cookies);
-  if (!supabase) return new Response("Supabase not configured", { status: 503 });
+  if (true) return new Response("Supabase not configured", { status: 503 });
 
   const user = context.locals.user; // cookie session, set by src/middleware.ts

[NoCoverage] BooleanLiteral
pages/api/inspections/create.ts:19:7
 
 export const POST: APIRoute = async (context) => {
   const supabase = createClient(context.request.headers, context.cookies);
-  if (!supabase) return new Response("Supabase not configured", { status: 503 });
+  if (supabase) return new Response("Supabase not configured", { status: 503 });
 
   const user = context.locals.user; // cookie session, set by src/middleware.ts

[NoCoverage] ConditionalExpression
pages/api/inspections/create.ts:22:7
   if (!supabase) return new Response("Supabase not configured", { status: 503 });
 
   const user = context.locals.user; // cookie session, set by src/middleware.ts
-  if (!user) return new Response("Unauthorized", { status: 401 });
+  if (false) return new Response("Unauthorized", { status: 401 });
 
   const today = new Date().toISOString().slice(0, 10); // YYYY-MM-DD

[NoCoverage] BooleanLiteral
pages/api/inspections/create.ts:22:7
   if (!supabase) return new Response("Supabase not configured", { status: 503 });
 
   const user = context.locals.user; // cookie session, set by src/middleware.ts
-  if (!user) return new Response("Unauthorized", { status: 401 });
+  if (user) return new Response("Unauthorized", { status: 401 });
 
   const today = new Date().toISOString().slice(0, 10); // YYYY-MM-DD

[NoCoverage] MethodExpression
pages/api/inspections/create.ts:24:17
   const user = context.locals.user; // cookie session, set by src/middleware.ts
   if (!user) return new Response("Unauthorized", { status: 401 });
 
-  const today = new Date().toISOString().slice(0, 10); // YYYY-MM-DD
+  const today = new Date().toISOString(); // YYYY-MM-DD
   const { data, error } = await supabase
     .from("inspections")

[NoCoverage] StringLiteral
pages/api/inspections/create.ts:27:42
   const today = new Date().toISOString().slice(0, 10); // YYYY-MM-DD
   const { data, error } = await supabase
     .from("inspections")
-    .insert({ owner_id: user.id, status: "draft", name: `Draft inspection — ${today}` })
+    .insert({ owner_id: user.id, status: "", name: `Draft inspection — ${today}` })
     .select("id")
     .single();

[NoCoverage] StringLiteral
pages/api/inspections/create.ts:28:13
   const { data, error } = await supabase
     .from("inspections")
     .insert({ owner_id: user.id, status: "draft", name: `Draft inspection — ${today}` })
-    .select("id")
+    .select("")
     .single();
 

[NoCoverage] ConditionalExpression
pages/api/inspections/create.ts:33:9
 
   if (error) {
     // The limit trigger raises this distinctive message — surface it as 409.
-    if (error.message.includes(INSPECTION_LIMIT_ERROR)) {
+    if (false) {
       return new Response(INSPECTION_LIMIT_ERROR, { status: 409 });
     }

[NoCoverage] BlockStatement
pages/api/inspections/create.ts:33:57
 
   if (error) {
     // The limit trigger raises this distinctive message — surface it as 409.
-    if (error.message.includes(INSPECTION_LIMIT_ERROR)) {
-      return new Response(INSPECTION_LIMIT_ERROR, { status: 409 });
-    }
+    if (error.message.includes(INSPECTION_LIMIT_ERROR)) {}
     return new Response(error.message, { status: 400 });
   }

[NoCoverage] ObjectLiteral
pages/api/inspections/create.ts:39:41
     return new Response(error.message, { status: 400 });
   }
 
-  return Response.json({ id: data.id }, { status: 201 });
+  return Response.json({ id: data.id }, {});
 };
 

[NoCoverage] ObjectLiteral
pages/api/inspections/create.ts:39:24
     return new Response(error.message, { status: 400 });
   }
 
-  return Response.json({ id: data.id }, { status: 201 });
+  return Response.json({}, { status: 201 });
 };
 
