[Killed] ConditionalExpression
pages/api/inspections/sync.ts:25:7
 
 export const POST: APIRoute = async (context) => {
   const supabase = createClient(context.request.headers, context.cookies);
-  if (!supabase) return new Response("Supabase not configured", { status: 503 });
+  if (false) return new Response("Supabase not configured", { status: 503 });
 
   const user = context.locals.user; // cookie session, set by src/middleware.ts
killedBy: POST /api/inspections/sync returns 503 when Supabase is not configured
statusReason: Cannot read properties of null (reading 'from')

[Killed] ConditionalExpression
pages/api/inspections/sync.ts:28:7
   if (!supabase) return new Response("Supabase not configured", { status: 503 });
 
   const user = context.locals.user; // cookie session, set by src/middleware.ts
-  if (!user) return new Response("Unauthorized", { status: 401 });
+  if (true) return new Response("Unauthorized", { status: 401 });
 
   let body: SyncOp;
killedBy: POST /api/inspections/sync upserts a put under the session owner, ignoring a spoofed ownerId, and strips synced
statusReason: expected 401 to be 200 // Object.is equality

[Killed] BlockStatement
pages/api/inspections/sync.ts:31:7
   if (!user) return new Response("Unauthorized", { status: 401 });
 
   let body: SyncOp;
-  try {
-    body = (await context.request.json()) as SyncOp;
-  } catch {
+  try {} catch {
     return new Response("Invalid JSON body", { status: 400 });
   }
killedBy: POST /api/inspections/sync upserts a put under the session owner, ignoring a spoofed ownerId, and strips synced
statusReason: Cannot read properties of undefined (reading 'op')

[NoCoverage] BlockStatement
pages/api/inspections/sync.ts:33:11
   let body: SyncOp;
   try {
     body = (await context.request.json()) as SyncOp;
-  } catch {
-    return new Response("Invalid JSON body", { status: 400 });
-  }
+  } catch {}
 
   if (body.op === "delete") {

[NoCoverage] StringLiteral
pages/api/inspections/sync.ts:34:25
   try {
     body = (await context.request.json()) as SyncOp;
   } catch {
-    return new Response("Invalid JSON body", { status: 400 });
+    return new Response("", { status: 400 });
   }
 

[Killed] ConditionalExpression
pages/api/inspections/sync.ts:37:7
     return new Response("Invalid JSON body", { status: 400 });
   }
 
-  if (body.op === "delete") {
+  if (false) {
     // RLS scopes the delete to the owner; no body to return.
     const { error } = await supabase.from("inspections").delete().eq("id", body.entityId);
killedBy: POST /api/inspections/sync delete is owner-scoped — removes the owner's row, returns 204
statusReason: expected 400 to be 204 // Object.is equality

[Killed] ConditionalExpression
pages/api/inspections/sync.ts:37:7
     return new Response("Invalid JSON body", { status: 400 });
   }
 
-  if (body.op === "delete") {
+  if (true) {
     // RLS scopes the delete to the owner; no body to return.
     const { error } = await supabase.from("inspections").delete().eq("id", body.entityId);
killedBy: POST /api/inspections/sync upserts a put under the session owner, ignoring a spoofed ownerId, and strips synced
statusReason: expected 204 to be 200 // Object.is equality

[Killed] ConditionalExpression
pages/api/inspections/sync.ts:40:9
   if (body.op === "delete") {
     // RLS scopes the delete to the owner; no body to return.
     const { error } = await supabase.from("inspections").delete().eq("id", body.entityId);
-    if (error) return new Response(error.message, { status: 400 });
+    if (true) return new Response(error.message, { status: 400 });
     return new Response(null, { status: 204 });
   }
killedBy: POST /api/inspections/sync delete is owner-scoped — removes the owner's row, returns 204
statusReason: Cannot read properties of null (reading 'message')

[Survived] ConditionalExpression
pages/api/inspections/sync.ts:40:9
   if (body.op === "delete") {
     // RLS scopes the delete to the owner; no body to return.
     const { error } = await supabase.from("inspections").delete().eq("id", body.entityId);
-    if (error) return new Response(error.message, { status: 400 });
+    if (false) return new Response(error.message, { status: 400 });
     return new Response(null, { status: 204 });
   }

[Killed] LogicalOperator
pages/api/inspections/sync.ts:48:39
   // session — RLS `with check (owner_id = auth.uid())` rejects anything else, so
   // any client-sent ownerId is overwritten here. camel → snake at this boundary;
   // scalar columns only (no jsonb yet), so the top-level transform is sufficient.
-  const { synced: _synced, ...row } = body.payload ?? {};
+  const { synced: _synced, ...row } = body.payload && {};
   const payload = snakecaseKeys({ ...row, ownerId: user.id });
 
killedBy: POST /api/inspections/sync upserts a put under the session owner, ignoring a spoofed ownerId, and strips synced
statusReason: expected null to be 'from client' // Object.is equality

[Killed] StringLiteral
pages/api/inspections/sync.ts:52:11
   const payload = snakecaseKeys({ ...row, ownerId: user.id });
 
   const { data, error } = await supabase
-    .from("inspections")
+    .from("")
     .upsert(payload as never)
     .select()
killedBy: POST /api/inspections/sync upserts a put under the session owner, ignoring a spoofed ownerId, and strips synced
statusReason: Invalid relation name: relation must be a non-empty string.

[Killed] ConditionalExpression
pages/api/inspections/sync.ts:57:7
     .select()
     .single();
 
-  if (error) return new Response(error.message, { status: 400 });
+  if (true) return new Response(error.message, { status: 400 });
   // snake → camel: hand the authoritative row (incl. server-stamped updatedAt) back.
   return Response.json(camelcaseKeys(data, { deep: true }));
killedBy: POST /api/inspections/sync upserts a put under the session owner, ignoring a spoofed ownerId, and strips synced
statusReason: Cannot read properties of null (reading 'message')

[Survived] ConditionalExpression
pages/api/inspections/sync.ts:57:7
     .select()
     .single();
 
-  if (error) return new Response(error.message, { status: 400 });
+  if (false) return new Response(error.message, { status: 400 });
   // snake → camel: hand the authoritative row (incl. server-stamped updatedAt) back.
   return Response.json(camelcaseKeys(data, { deep: true }));

[Survived] BooleanLiteral
pages/api/inspections/sync.ts:59:52
 
   if (error) return new Response(error.message, { status: 400 });
   // snake → camel: hand the authoritative row (incl. server-stamped updatedAt) back.
-  return Response.json(camelcaseKeys(data, { deep: true }));
+  return Response.json(camelcaseKeys(data, { deep: false }));
 };
 
