[Killed] BlockStatement
src/lib/session-counts.ts:25:106
 const PART_IDS = ["part2", "part3", "part4", "part5"] as const;
 
 /** Live per-Part counts for a given active-flag set: base + every active flag's delta. */
-export function countsForFlags(counts: SessionCounts, activeFlags: ReadonlySet<RuntimeFlag>): PartCounts {
-  const result: PartCounts = { ...counts.base };
-  for (const flag of Object.keys(counts.flagDeltas) as RuntimeFlag[]) {
-    const delta = counts.flagDeltas[flag];
-    if (!delta || !activeFlags.has(flag)) continue;
-    for (const p of PART_IDS) result[p] += delta[p];
-  }
-  return result;
-}
+export function countsForFlags(counts: SessionCounts, activeFlags: ReadonlySet<RuntimeFlag>): PartCounts {}
 
 /** Sum of the per-Part counts — the Total Score / completion denominator. */
killedBy: Phase 4: sessionCounts ⇄ countsForFlags equals the engine for any flag subset recomputes petrol counts client-side identically to visibleCountsByPart
statusReason: expected undefined to deeply equal { part2: 86, part3: 14, …(2) }

[Killed] BlockStatement
src/lib/session-counts.ts:27:71
 /** Live per-Part counts for a given active-flag set: base + every active flag's delta. */
 export function countsForFlags(counts: SessionCounts, activeFlags: ReadonlySet<RuntimeFlag>): PartCounts {
   const result: PartCounts = { ...counts.base };
-  for (const flag of Object.keys(counts.flagDeltas) as RuntimeFlag[]) {
-    const delta = counts.flagDeltas[flag];
-    if (!delta || !activeFlags.has(flag)) continue;
-    for (const p of PART_IDS) result[p] += delta[p];
-  }
+  for (const flag of Object.keys(counts.flagDeltas) as RuntimeFlag[]) {}
   return result;
 }
killedBy: Phase 4: sessionCounts ⇄ countsForFlags equals the engine for any flag subset recomputes petrol counts client-side identically to visibleCountsByPart
statusReason: expected { part2: 86, part3: 14, …(2) } to deeply equal { part2: 87, part3: 14, …(2) }

[Killed] LogicalOperator
src/lib/session-counts.ts:29:9
   const result: PartCounts = { ...counts.base };
   for (const flag of Object.keys(counts.flagDeltas) as RuntimeFlag[]) {
     const delta = counts.flagDeltas[flag];
-    if (!delta || !activeFlags.has(flag)) continue;
+    if (!delta && !activeFlags.has(flag)) continue;
     for (const p of PART_IDS) result[p] += delta[p];
   }
killedBy: Phase 4: sessionCounts ⇄ countsForFlags equals the engine for any flag subset recomputes petrol counts client-side identically to visibleCountsByPart
statusReason: expected { part2: 87, part3: 14, …(2) } to deeply equal { part2: 86, part3: 14, …(2) }

[Killed] BooleanLiteral
src/lib/session-counts.ts:29:9
   const result: PartCounts = { ...counts.base };
   for (const flag of Object.keys(counts.flagDeltas) as RuntimeFlag[]) {
     const delta = counts.flagDeltas[flag];
-    if (!delta || !activeFlags.has(flag)) continue;
+    if (delta || !activeFlags.has(flag)) continue;
     for (const p of PART_IDS) result[p] += delta[p];
   }
killedBy: Phase 4: sessionCounts ⇄ countsForFlags equals the engine for any flag subset recomputes petrol counts client-side identically to visibleCountsByPart
statusReason: expected { part2: 86, part3: 14, …(2) } to deeply equal { part2: 87, part3: 14, …(2) }

[Killed] AssignmentOperator
src/lib/session-counts.ts:30:31
   for (const flag of Object.keys(counts.flagDeltas) as RuntimeFlag[]) {
     const delta = counts.flagDeltas[flag];
     if (!delta || !activeFlags.has(flag)) continue;
-    for (const p of PART_IDS) result[p] += delta[p];
+    for (const p of PART_IDS) result[p] -= delta[p];
   }
   return result;
killedBy: Phase 4: sessionCounts ⇄ countsForFlags equals the engine for any flag subset recomputes petrol counts client-side identically to visibleCountsByPart
statusReason: expected { part2: 85, part3: 14, …(2) } to deeply equal { part2: 87, part3: 14, …(2) }

[Killed] BlockStatement
src/lib/session-counts.ts:36:56
 }
 
 /** Sum of the per-Part counts — the Total Score / completion denominator. */
-export function totalCount(counts: PartCounts): number {
-  return PART_IDS.reduce((sum, p) => sum + counts[p], 0);
-}
+export function totalCount(counts: PartCounts): number {}
 
killedBy: Phase 4: sessionCounts ⇄ countsForFlags equals the engine for any flag subset recomputes petrol counts client-side identically to visibleCountsByPart
statusReason: expected undefined to be 128 // Object.is equality

[Killed] ArrowFunction
src/lib/session-counts.ts:37:26
 
 /** Sum of the per-Part counts — the Total Score / completion denominator. */
 export function totalCount(counts: PartCounts): number {
-  return PART_IDS.reduce((sum, p) => sum + counts[p], 0);
+  return PART_IDS.reduce(() => undefined, 0);
 }
 
killedBy: Phase 4: sessionCounts ⇄ countsForFlags equals the engine for any flag subset recomputes petrol counts client-side identically to visibleCountsByPart
statusReason: expected undefined to be 128 // Object.is equality

[Killed] ArithmeticOperator
src/lib/session-counts.ts:37:38
 
 /** Sum of the per-Part counts — the Total Score / completion denominator. */
 export function totalCount(counts: PartCounts): number {
-  return PART_IDS.reduce((sum, p) => sum + counts[p], 0);
+  return PART_IDS.reduce((sum, p) => sum - counts[p], 0);
 }
 
killedBy: Phase 4: sessionCounts ⇄ countsForFlags equals the engine for any flag subset recomputes petrol counts client-side identically to visibleCountsByPart
statusReason: expected -128 to be 128 // Object.is equality
