[Killed] StringLiteral
src/lib/session-routes.ts:12:67
 /** The parts the session tree exposes (Part 1 is the config form; 2–5 are question screens). */
 export type PartParam = "1" | "2" | "3" | "4" | "5";
 
-const VALID_PARTS: ReadonlySet<string> = new Set<PartParam>(["1", "2", "3", "4", "5"]);
+const VALID_PARTS: ReadonlySet<string> = new Set<PartParam>(["1", "", "3", "4", "5"]);
 
 /** Type guard: is the `[part]` route param one of the five real parts? */
killedBy: isValidPart — the [part] route-param guard accepts the five real parts
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/lib/session-routes.ts:12:82
 /** The parts the session tree exposes (Part 1 is the config form; 2–5 are question screens). */
 export type PartParam = "1" | "2" | "3" | "4" | "5";
 
-const VALID_PARTS: ReadonlySet<string> = new Set<PartParam>(["1", "2", "3", "4", "5"]);
+const VALID_PARTS: ReadonlySet<string> = new Set<PartParam>(["1", "2", "3", "4", ""]);
 
 /** Type guard: is the `[part]` route param one of the five real parts? */
killedBy: isValidPart — the [part] route-param guard accepts the five real parts
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/session-routes.ts:15:74
 const VALID_PARTS: ReadonlySet<string> = new Set<PartParam>(["1", "2", "3", "4", "5"]);
 
 /** Type guard: is the `[part]` route param one of the five real parts? */
-export function isValidPart(part: string | undefined): part is PartParam {
-  return part !== undefined && VALID_PARTS.has(part);
-}
+export function isValidPart(part: string | undefined): part is PartParam {}
 
 /** What a per-Part screen should do: redirect somewhere, or render a given screen. */
killedBy: isValidPart — the [part] route-param guard accepts the five real parts
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
src/lib/session-routes.ts:16:10
 
 /** Type guard: is the `[part]` route param one of the five real parts? */
 export function isValidPart(part: string | undefined): part is PartParam {
-  return part !== undefined && VALID_PARTS.has(part);
+  return part !== undefined || VALID_PARTS.has(part);
 }
 
killedBy: isValidPart — the [part] route-param guard rejects unknown parts, non-numerics, and undefined (→ /dashboard in the route)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/session-routes.ts:16:10
 
 /** Type guard: is the `[part]` route param one of the five real parts? */
 export function isValidPart(part: string | undefined): part is PartParam {
-  return part !== undefined && VALID_PARTS.has(part);
+  return false;
 }
 
killedBy: isValidPart — the [part] route-param guard accepts the five real parts
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/session-routes.ts:34:114
  * Part validity and row presence are handled by the route itself (`isValidPart` + the
  * RLS `null` check) so `row` narrows for the render path without a cast.
  */
-export function resolvePartScreen(input: { id: string; part: PartParam; unlocked: boolean }): PartScreenDecision {
-  if (input.part !== "1" && !input.unlocked) return { redirect: `/inspections/${input.id}/session/part/1` };
-  return input.part === "1" ? { render: "form" } : { render: "placeholder" };
-}
+export function resolvePartScreen(input: { id: string; part: PartParam; unlocked: boolean }): PartScreenDecision {}
 
killedBy: resolvePartScreen — lock gate + screen choice (valid part, row present) Part 1 always renders the config form, locked or not
statusReason: expected undefined to deeply equal { render: 'form' }

[Killed] EqualityOperator
src/lib/session-routes.ts:35:7
  * RLS `null` check) so `row` narrows for the render path without a cast.
  */
 export function resolvePartScreen(input: { id: string; part: PartParam; unlocked: boolean }): PartScreenDecision {
-  if (input.part !== "1" && !input.unlocked) return { redirect: `/inspections/${input.id}/session/part/1` };
+  if (input.part === "1" && !input.unlocked) return { redirect: `/inspections/${input.id}/session/part/1` };
   return input.part === "1" ? { render: "form" } : { render: "placeholder" };
 }
killedBy: resolvePartScreen — lock gate + screen choice (valid part, row present) Part 1 always renders the config form, locked or not
statusReason: expected { Object (redirect) } to deeply equal { render: 'form' }

[Killed] ConditionalExpression
src/lib/session-routes.ts:35:7
  * RLS `null` check) so `row` narrows for the render path without a cast.
  */
 export function resolvePartScreen(input: { id: string; part: PartParam; unlocked: boolean }): PartScreenDecision {
-  if (input.part !== "1" && !input.unlocked) return { redirect: `/inspections/${input.id}/session/part/1` };
+  if (false) return { redirect: `/inspections/${input.id}/session/part/1` };
   return input.part === "1" ? { render: "form" } : { render: "placeholder" };
 }
killedBy: resolvePartScreen — lock gate + screen choice (valid part, row present) Parts 2–5 with an invalid config redirect back to that inspection's Part 1
statusReason: expected { render: 'placeholder' } to deeply equal { Object (redirect) }

[Killed] ConditionalExpression
src/lib/session-routes.ts:36:10
  */
 export function resolvePartScreen(input: { id: string; part: PartParam; unlocked: boolean }): PartScreenDecision {
   if (input.part !== "1" && !input.unlocked) return { redirect: `/inspections/${input.id}/session/part/1` };
-  return input.part === "1" ? { render: "form" } : { render: "placeholder" };
+  return false ? { render: "form" } : { render: "placeholder" };
 }
 
killedBy: resolvePartScreen — lock gate + screen choice (valid part, row present) Part 1 always renders the config form, locked or not
statusReason: expected { render: 'placeholder' } to deeply equal { render: 'form' }

[Killed] ConditionalExpression
src/lib/session-routes.ts:36:10
  */
 export function resolvePartScreen(input: { id: string; part: PartParam; unlocked: boolean }): PartScreenDecision {
   if (input.part !== "1" && !input.unlocked) return { redirect: `/inspections/${input.id}/session/part/1` };
-  return input.part === "1" ? { render: "form" } : { render: "placeholder" };
+  return true ? { render: "form" } : { render: "placeholder" };
 }
 
killedBy: resolvePartScreen — lock gate + screen choice (valid part, row present) Parts 2–5 with a valid config render the placeholder
statusReason: expected { render: 'form' } to deeply equal { render: 'placeholder' }
