[Killed] ConditionalExpression
src/lib/part1-config.ts:78:20
       const v = collapse(s);
       return opts.capitalize ? capitalizeFirst(v) : v;
     })
-    .refine((s) => s.length >= opts.min && s.length <= opts.max, { message });
+    .refine((s) => true, { message });
 
 const optionalText = (
killedBy: required fields reject when empty (exact §9 copy) 'make' empty → 'Enter the car make.'
statusReason: expected true to be false // Object.is equality
