[Survived] ConditionalExpression
src/lib/questions.ts:151:16
 
 // Recursively freeze so the frozen catalogue cannot be mutated by any consumer.
 function deepFreeze<T>(value: T): T {
-  if (value && typeof value === "object" && !Object.isFrozen(value)) {
+  if (value && true && !Object.isFrozen(value)) {
     Object.freeze(value);
     for (const v of Object.values(value as Record<string, unknown>)) deepFreeze(v);

[Survived] LogicalOperator
src/lib/questions.ts:151:7
 
 // Recursively freeze so the frozen catalogue cannot be mutated by any consumer.
 function deepFreeze<T>(value: T): T {
-  if (value && typeof value === "object" && !Object.isFrozen(value)) {
+  if (value || typeof value === "object" && !Object.isFrozen(value)) {
     Object.freeze(value);
     for (const v of Object.values(value as Record<string, unknown>)) deepFreeze(v);
